<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft Word 97">
<TITLE>Apresentacao</TITLE>
<META NAME="Template" CONTENT="J:\MSOFFICE\OFFICE\html.dot">
</HEAD>
<BODY LINK="#0000ff" VLINK="#800080" BACKGROUND="doc_b.gif">
<Basefont size=2>
<B><FONT SIZE=5><P>Apresenta&ccedil;&atilde;o</B></FONT><FONT SIZE=1> </P>
</FONT><P><HR></P>
<FONT SIZE=2><P>Este manual se destina a profissionais que atuam como analistas de sistemas, de suporte t&eacute;cnico, como administradores de dados, de banco de dados ou como programadores e que utilizam o SADS como ferramenta para o desenvolvimento de seu trabalho.</FONT> </P>
<FONT SIZE=2><P>O objetivo deste documento &eacute; fornecer detalhes t&eacute;cnicos e aprofundamentos te&oacute;ricos sobre o funcionamento do SADS, de modo a tornar mais claro e produtivo o contato com o software.</FONT> </P>
<FONT SIZE=2><P>Nele encontram-se informa&ccedil;&otilde;es e sugest&otilde;es para uma utiliza&ccedil;&atilde;o mais efetiva dos m&oacute;dulos que comp&otilde;em o SADS.</FONT> </P>
<FONT SIZE=2><P>Este manual &eacute; compat&iacute;vel com a vers&atilde;o 4.2 e &eacute; composto por sete se&ccedil;&otilde;es e tr&ecirc;s ap&ecirc;ndices, cujos conte&uacute;dos s&atilde;o sintetizados a seguir:</FONT> </P><DIR>

<P><A HREF="Secao1.hTM"><B>Se&ccedil;&atilde;o I - Requisitos e conceitos para utiliza&ccedil;&atilde;o do SADS</B></A><FONT SIZE=2> </P><DIR>

<P>Esta se&ccedil;&atilde;o explica a padroniza&ccedil;&atilde;o utilizada pelo SADS, os procedimentos de habilita&ccedil;&atilde;o para o seu uso, o processo de navega&ccedil;&atilde;o, os tipos de telas utilizadas, as regras para preenchimento dos campos, os diferentes n&iacute;veis de ajuda e os processos de pagina&ccedil;&atilde;o. </P></DIR>

</FONT><P><A HREF="Indsec2.htm"><B>Se&ccedil;&atilde;o II - Elementos do reposit&oacute;rio de dados do SADS</B></A><FONT SIZE=2> </P><DIR>

<P>Esta se&ccedil;&atilde;o apresenta os elementos do projeto conceitual, l&oacute;gico e f&iacute;sico, em ordem alfab&eacute;tica, fornecendo detalhes que facilitam o desenvolvimento de aplica&ccedil;&otilde;es com a utiliza&ccedil;&atilde;o do SADS.</FONT> </P></DIR>

<P><A HREF="Indsec3.htm"><B>Se&ccedil;&atilde;o III - Fun&ccedil;&otilde;es de apoio</B></A><FONT SIZE=2> </P><DIR>

<P>Esta se&ccedil;&atilde;o apresenta as transa&ccedil;&otilde;es que apoiam tanto a utiliza&ccedil;&atilde;o do SADS como a dos sistemas constru&iacute;dos atrav&eacute;s dele, em ordem alfab&eacute;tica.</FONT> </P>
<FONT SIZE=2><P>Com rela&ccedil;&atilde;o aos informativos, apresenta as consultas gerais e gerenciais, os relat&oacute;rios e as refer&ecirc;ncias cruzadas dispon&iacute;veis.</FONT> </P>
<FONT SIZE=2><P>Com rela&ccedil;&atilde;o aos utilit&aacute;rios, apresenta fun&ccedil;&otilde;es isoladas, como as de duplica&ccedil;&atilde;o de elementos e resseq&uuml;enciamento de estruturas, e tamb&eacute;m m&oacute;dulos inteiros, como os de navega&ccedil;&atilde;o, consulta a cancelamentos <I>on-line</I> e integra&ccedil;&atilde;o ET-SADS x SADS.</FONT> </P></DIR>

<P><A HREF="Secao4.htm"><B>Se&ccedil;&atilde;o IV - Apoio &agrave; manuten&ccedil;&atilde;o</B></A><FONT SIZE=2> </P><DIR>

<P>Esta se&ccedil;&atilde;o apresenta listas de procedimentos que facilitam algumas manuten&ccedil;&otilde;es mais complexas que envolvem v&aacute;rias transa&ccedil;&otilde;es em sistemas constru&iacute;dos atrav&eacute;s do SADS.</FONT> </P></DIR>

<P><A HREF="Secao5.htm"><B>Se&ccedil;&atilde;o V - Parametriza&ccedil;&otilde;es do SADS</B></A><FONT SIZE=2> </P><DIR>

<P>A utiliza&ccedil;&atilde;o do SADS envolve, mesmo que implicitamente, padr&otilde;es e m&eacute;todos de trabalho. Alguns destes padr&otilde;es s&atilde;o flex&iacute;veis e podem ser parametrizados de acordo com a conveni&ecirc;ncia da instala&ccedil;&atilde;o.</FONT> </P></DIR>

<P><A HREF="Indsec6.htm"><B>Se&ccedil;&atilde;o VI </B>-<B> Sistema de Seguran&ccedil;a do SADS</B></A><FONT SIZE=2> </P><DIR>

<P>Esta se&ccedil;&atilde;o apresenta todas as fun&ccedil;&otilde;es e caracter&iacute;sticas da ferramenta do SADS respons&aacute;vel por garantir o acesso &agrave;s informa&ccedil;&otilde;es da empresa.</FONT> </P></DIR>

<P><A HREF="Secao7.htm"><B>Se&ccedil;&atilde;o VII - Servidor WEB</B></A><FONT SIZE=2> </P><DIR>

<P>Esta se&ccedil;&atilde;o apresenta o Servidor Web do SADS, que &eacute; um m&oacute;dulo que torna poss&iacute;vel a utiliza&ccedil;&atilde;o de aplicativos desenvolvidos em SADS, sendo executados em uma m&aacute;quina Unisys S&eacute;rie A, no ambiente <I>Word Wide Web</I>.</FONT> </P></DIR>

<P><A HREF="Apendia.htm"><B>Ap&ecirc;ndice A - Arquivos residentes nos ambientes de desenvolvimento e produ&ccedil;&atilde;o</B></A> </P><DIR>

<FONT SIZE=2><P>Este ap&ecirc;ndice apresenta os objetos, <I>libraries</I>, arquivos e <I>jobs</I> para cada m&oacute;dulo que comp&otilde;e o SADS que, para permitir o processamento do SADS e dos sistemas aplicativos, necessitam estar residentes nos ambientes de desenvolvimento e produ&ccedil;&atilde;o .</FONT> </P></DIR>

<P><A HREF="Apendib.htm"><B>Ap&ecirc;ndice B - SADS Secund&aacute;rio</B></A><FONT SIZE=2> </P><DIR>

<P>Este ap&ecirc;ndice apresenta os procedimentos para cria&ccedil;&atilde;o do ambiente secund&aacute;rio do SADS, que tem como objetivo propiciar a exist&ecirc;ncia de dois ambientes SADS semi-independentes em uma mesma m&aacute;quina. </P></DIR>

</FONT><P><A HREF="Glossari.htm"><B>Gloss&aacute;rio</B></A><FONT SIZE=2> </P></DIR>

</FONT><P><BR>
<B><FONT SIZE=5>Como usar este manual</B></FONT><FONT SIZE=1> </P>
</FONT><P><HR></P>
<FONT SIZE=2><P>Este manual deve ser utilizado sob demanda, ou seja, para solucionar alguma d&uacute;vida espec&iacute;fica durante qualquer fase do desenvolvimento de um sistema.</FONT> </P>
<FONT SIZE=2><P>A Se&ccedil;&atilde;o II, que descreve os elementos suportados pelo reposit&oacute;rio de dados do SADS, n&atilde;o est&aacute; ordenada logicamente segundo as etapas do desenvolvimento de sistemas. Ela obedece a uma seq&uuml;&ecirc;ncia alfab&eacute;tica em rela&ccedil;&atilde;o aos elementos cadastrados no reposit&oacute;rio, sendo que, para cada um deles, s&atilde;o apresentados os t&oacute;picos: Conceitua&ccedil;&atilde;o, Padroniza&ccedil;&atilde;o, Utiliza&ccedil;&atilde;o, Cadastramento e Fun&ccedil;&otilde;es de apoio. A Se&ccedil;&atilde;o III, que descreve as fun&ccedil;&otilde;es de apoio ao sistema, tamb&eacute;m est&aacute; ordenada alfabeticamente, de modo a facilitar a localiza&ccedil;&atilde;o de seus itens.</FONT> </P>
<FONT SIZE=2><P>O leitor deve orientar a sua leitura a partir da organiza&ccedil;&atilde;o deste manual atrav&eacute;s de &iacute;ndices. O &iacute;ndice geral apresenta toda a distribui&ccedil;&atilde;o tem&aacute;tica do manual. Os &iacute;ndices parciais, que antecedem a cada se&ccedil;&atilde;o, proporcionam mais rapidez e facilidade na localiza&ccedil;&atilde;o de assuntos espec&iacute;ficos. </P>
<P>No cabe&ccedil;alho e no rodap&eacute; de cada p&aacute;gina s&atilde;o fornecidos os dados de identifica&ccedil;&atilde;o da se&ccedil;&atilde;o e a numera&ccedil;&atilde;o progressiva, a fim de tornar mais f&aacute;cil e r&aacute;pida a localiza&ccedil;&atilde;o da informa&ccedil;&atilde;o desejada. Al&eacute;m destes recursos, centralizados no cabe&ccedil;alho de cada p&aacute;gina da Se&ccedil;&atilde;o II encontram-se os nomes dos elementos do SADS que est&atilde;o sendo explicados.</FONT> </P>
<FONT SIZE=2><P>Os assuntos s&atilde;o identificados a partir de padr&otilde;es gr&aacute;ficos diferentes para t&iacute;tulos, subt&iacute;tulos, t&oacute;picos e subt&oacute;picos, alinhados &agrave; margem esquerda das p&aacute;ginas.</FONT> </P>
<FONT SIZE=2><P>Os campos das telas de processamento s&atilde;o apresentados em negrito e e os comandos e valores que os campos das telas podem assumir s&atilde;o apresentados em letras mai&uacute;sculas.</FONT> </P>
<FONT SIZE=2><P>Finalmente, no texto principal, est&atilde;o sendo utilizados caracteres it&aacute;licos como recurso para identifica&ccedil;&atilde;o de palavras de origem estrangeira.</FONT> </P></BODY>
</HTML>
