<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft Word 97">
<TITLE>CONSISTE</TITLE>
<META NAME="Template" CONTENT="J:\MSOFFICE\OFFICE\html.dot">
</HEAD>
<BODY LINK="#0000ff" VLINK="#800080" BACKGROUND="DOC_B.GIF">
<basefont size=2>
<B><FONT SIZE=6><P><A NAME="Conge">Consist&ecirc;ncia geral</A></B></FONT> </P>
<P><HR></P>
<B><FONT SIZE=5><P><A NAME="Conce">Conceitua&ccedil;&atilde;o</A></B></FONT> </P>
<P><HR></P>
<FONT SIZE=2><P>Consist&ecirc;ncia geral de dados &eacute; o m&oacute;dulo do SADS respons&aacute;vel pela valida&ccedil;&atilde;o dos dados de entrada para programas on-line, feita de forma interpretativa e em tempo de execu&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Efetua cr&iacute;ticas de diferentes naturezas, a partir de testes previamente cadastrados, minimizando as defini&ccedil;&otilde;es e codifica&ccedil;&otilde;es nos programas aplicativos.</FONT> </P>
<FONT SIZE=2><P>A interface &eacute; feita atrav&eacute;s da utiliza&ccedil;&atilde;o de uma sub-rotina que converte as informa&ccedil;&otilde;es da tela de acordo com os cadastramentos no RD: efetua todos os testes definidos para os atributos e especificamente para a consist&ecirc;ncia, move zeros &agrave; esquerda de campos num&eacute;ricos, alinha &agrave; direita campos num&eacute;ricos digitados &agrave; esquerda, zera campos num&eacute;ricos n&atilde;o informados, calcula d&iacute;gito verificador, inverte datas e devolve a tela convertida para o programa aplicativo.</FONT> </P>
<P>&Eacute; importante observar que, nas consist&ecirc;ncias das telas de atualiza&ccedil;&atilde;o paginada, as convers&otilde;es dos dados informados pelo usu&aacute;rio - invers&otilde;es de datas, ajustes de campos num&eacute;ricos, c&aacute;lculos de d&iacute;gitos e valores negativos para campos, quando informado sinal igual a "-" - ser&atilde;o feitas de acordo com o cadastramento do programa de atualiza&ccedil;&atilde;o paginada associado &agrave; tela, da seguinte forma: </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Caso na defini&ccedil;&atilde;o do processamento do programa seja informado "S" no campo RETORNO DA CONSISTENCIA (S/N), a consist&ecirc;ncia ir&aacute; retornar os dados devidamente convertidos e ajustados para o programa trat&aacute;-los; e </P>
</FONT><P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Caso na defini&ccedil;&atilde;o do processamento do programa n&atilde;o seja informado "S" no campo RETORNO DA CONSISTENCIA(S/N), a consist&ecirc;ncia n&atilde;o ir&aacute; retornar os dados devidamente convertidos e ajustados para o programa. </P></DIR>

<P>A utiliza&ccedil;&atilde;o da consit&ecirc;ncia geral permite a obten&ccedil;&atilde;o de ganhos elevados de produtividade no desenvolvimento e manuten&ccedil;&atilde;o de sistemas.</FONT> </P>
<FONT SIZE=2><P>A cada tela ou tabela do sistema pode estar relacionada uma consist&ecirc;ncia, onde estar&atilde;o definidos os testes e convers&otilde;es a serem efetuados sobre os dados que ser&atilde;o por ela captados.</FONT> </P>
<FONT SIZE=2><P>A consist&ecirc;ncia da tela ou tabela, que possui um c&oacute;digo pr&oacute;prio que a identifica perante o SADS, &eacute; composta pelos seguintes elementos:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Uma estrutura, onde s&atilde;o cadastrados os atributos de entrada de dados cujos valores ser&atilde;o testados (e convertidos);</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Testes de valida&ccedil;&atilde;o dos dados em n&iacute;vel de estrutura, que s&atilde;o aqueles testes efetuados sobre os atributos pertencentes &agrave; estrutura da consist&ecirc;ncia somente quando a mesma for executada.</FONT> </P></DIR>

<FONT SIZE=2><P>O SADS &eacute;, pois, o respons&aacute;vel por executar a valida&ccedil;&atilde;o da entrada de dados de acordo com a estrutura e testes cadastrados na consist&ecirc;ncia da tela ou da tabela.</FONT> </P>
<FONT SIZE=2><P>A seguir, s&atilde;o apresentadas as caracter&iacute;sticas e potencialidades do m&oacute;dulo de consist&ecirc;ncia geral:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Interativo, interpretativo e din&acirc;mico<B>:</B></FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Cadastramento e manuten&ccedil;&atilde;o dos par&acirc;metros de valida&ccedil;&atilde;o de forma interativa atrav&eacute;s de terminais; </P>
</FONT><P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Execu&ccedil;&atilde;o das consist&ecirc;ncias atrav&eacute;s de sub-rotina gen&eacute;rica, ativada pelos programas aplicativos em tempo de processamento; </P>
</FONT><P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Convers&atilde;o de dados de entrada tais como: invers&atilde;o de data, alinhamento de valores num&eacute;ricos &agrave; direita com zeros &agrave; esquerda; </P>
</FONT><P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Valida&ccedil;&otilde;es executadas de forma interpretativa a partir dos par&acirc;metros cadastrados e a partir da defini&ccedil;&atilde;o de validades para atributos e estrutura de tela;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Altera&ccedil;&atilde;o de testes cadastrados efetuadas dinamicamente sem necessidade de compila&ccedil;&atilde;o de programas; </P>
</FONT><P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Simula&ccedil;&atilde;o e verifica&ccedil;&atilde;o das validades para cada dado antes mesmo do desenvolvimento dos programas; </P>
</FONT><P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Possibilidade de entrada de dados com v&iacute;rgula decimal, flutuante com alinhamento autom&aacute;tico de acordo com as decimais definidas para o atributo; </P>
</FONT><P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Integra&ccedil;&atilde;o com o reposit&oacute;rio de dados do SADS:</FONT> </P><DIR>

<P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Capta&ccedil;&atilde;o autom&aacute;tica das defini&ccedil;&otilde;es estabelecidas para o dom&iacute;nio de cada atributo, assegurando a unicidade das defini&ccedil;&otilde;es em n&iacute;vel geral da instala&ccedil;&atilde;o; </P>
</FONT><P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Documenta&ccedil;&atilde;o autom&aacute;tica com interpreta&ccedil;&atilde;o das validades intr&iacute;nsecas de cada atributo e das espec&iacute;ficas das estruturas das consist&ecirc;ncias; </P>
</FONT><P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Documenta&ccedil;&atilde;o din&acirc;mica para o usu&aacute;rio, permitindo consulta a descri&ccedil;&atilde;o e validades do atributo em n&iacute;vel de estrutura e em n&iacute;vel de defini&ccedil;&atilde;o geral para a instala&ccedil;&atilde;o, quando h&aacute; erros, em tempo de execu&ccedil;&atilde;o. </P></DIR>
</DIR>

</FONT><P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Flex&iacute;vel e racional:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Execu&ccedil;&atilde;o de consist&ecirc;ncias de diversas naturezas: testes padr&otilde;es - data, hora, CPF, CGC, m&oacute;dulo 10, etc -; testes de formato, conte&uacute;do e somat&oacute;rio de atributos; testes condicionais (se/ent&atilde;o); testes de duplicidade; valida&ccedil;&otilde;es contra tabelas; testes de seguran&ccedil;a em n&iacute;vel de atributo;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Disparo de sub-rotinas para valida&ccedil;&otilde;es espec&iacute;ficas da aplica&ccedil;&atilde;o do tipo consist&ecirc;ncia contra cadastros gen&eacute;ricos; </P>
</FONT><P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Elimina&ccedil;&atilde;o da defini&ccedil;&atilde;o e desenvolvimento de rotinas de consist&ecirc;ncia internas aos programas, acarretando ganhos em produtividade no desenvolvimento e manuten&ccedil;&atilde;o de sistemas; </P>
</FONT><P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Racionaliza&ccedil;&atilde;o das m&uacute;ltiplas etapas de compila&ccedil;&atilde;o e testes com a consequente redu&ccedil;&atilde;o dos recursos de m&aacute;quina necess&aacute;rios a execu&ccedil;&atilde;o destas etapas; </P>
</FONT><P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Diminui&ccedil;&atilde;o do tamanho dos programas fonte e de mem&oacute;ria exigida para os c&oacute;digos objetos.</FONT> </P></DIR>
</DIR>

<FONT SIZE=2><P>Maiores detalhes a respeito das caracter&iacute;sticas da consist&ecirc;ncia geral est&atilde;o explicados no t&oacute;pico "Cadastramento", neste mesmo item.</FONT> </P>
<B><FONT SIZE=5><P><A NAME="Consis">Funcionamento da consist&ecirc;ncia geral em tempo de processamento</A></B></FONT> </P>
<FONT SIZE=2><P>A execu&ccedil;&atilde;o da consist&ecirc;ncia de tela de aplicativo pode ser disparada pelos <I>hosts</I> dos programas aplicativos, em tempo de processamento, no momento em que um usu&aacute;rio transmite a tela.</FONT> </P>
<FONT SIZE=2><P>O <I>host</I> dispara a consist&ecirc;ncia geral que faz a valida&ccedil;&atilde;o e convers&atilde;o dos dados de entrada e os entrega para o programa chamado somente quando estiverem devidamente qualificados. Ele se encarrega tamb&eacute;m de enviar mensagens de erros, quando detectados. Em caso de telas de processamento, menus de op&ccedil;&atilde;o e menus de escolha, o cursor ser&aacute; posicionado no primeiro campo que tiver provocado o erro.</FONT> </P>
<FONT SIZE=2><P>A execu&ccedil;&atilde;o da consist&ecirc;ncia geral pode tamb&eacute;m ser disparada internamente aos programas chamados, atrav&eacute;s da codifica&ccedil;&atilde;o devida da integra&ccedil;&atilde;o com a sub-rotina encarregada pela execu&ccedil;&atilde;o da consist&ecirc;ncia - SSCS01. Neste caso, o programa chamado deve testar o retorno da sub-rotina e solicitar ao <I>host</I> o envio das mensagens de erros, quando existirem.</FONT> </P>
<FONT SIZE=2><P>Os cadastramentos dos menus dos aplicativos que utilizam a chamada &agrave; consist&ecirc;ncia geral pelo <I>host</I>, e a codifica&ccedil;&atilde;o dos programas chamados que efetuam internamente chamada &agrave; sub-rotina de consist&ecirc;ncia, est&atilde;o detalhadamente explicados neste item, no t&oacute;pico "Interface com aplicativos".</FONT> </P>
<B><FONT SIZE=5><P><A NAME="Tescon">Tipos de testes da consist&ecirc;ncia</A></B></FONT> </P>
<FONT SIZE=2><P>As informa&ccedil;&otilde;es necess&aacute;rias &agrave; execu&ccedil;&atilde;o dos testes de valida&ccedil;&atilde;o nos dados submetidos &agrave; consist&ecirc;ncia s&atilde;o especificadas no reposit&oacute;rio de dados do SADS da seguinte forma:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Atrav&eacute;s da defini&ccedil;&atilde;o dos atributos (formato, tamanho, casas decimais, sinal, validades, tabela/sub-rotina, dom&iacute;nio, teste padr&atilde;o) que pertencem &agrave; estrutura da consist&ecirc;ncia;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Atrav&eacute;s do cadastramento da estrutura da consist&ecirc;ncia: nela poder&atilde;o ser definidas as caracter&iacute;sticas dos atributos que s&atilde;o pr&oacute;prias da consist&ecirc;ncia;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Atrav&eacute;s do cadastramento dos testes de valida&ccedil;&atilde;o dos atributos em n&iacute;vel de estrutura: v&aacute;rios tipos de testes, envolvendo os atributos pertencentes &agrave; estrutura da consist&ecirc;ncia, podem ser especificados.</FONT> </P></DIR>

<FONT SIZE=2><P>A consist&ecirc;ncia geral faz testes para valida&ccedil;&atilde;o e convers&atilde;o dos seguintes formatos das entradas de dados:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Alfab&eacute;tico;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Alfanum&eacute;rico;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Num&eacute;rico;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Num&eacute;rico com sinal;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Num&eacute;rico - alinhando &agrave; direita;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Num&eacute;rico, inteiro - alinhando &agrave; direita;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Num&eacute;rico, com v&iacute;rgula obrigat&oacute;ria - alinhando &agrave; direita.</FONT> </P></DIR>

<FONT SIZE=2><P>Conforme o padr&atilde;o definido para um atributo, a consist&ecirc;ncia geral pode efetuar os seguintes testes:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de hora de acordo com um dos seguintes padr&otilde;es: HHMM ou HHMMSS;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de data de acordo com um dos seguintes padr&otilde;es: <BR>
DDMMAA; DDMMAA e faz a invers&atilde;o para AAMMDD; DDMMAAAA; <BR>
DDMMAAAA e faz a invers&atilde;o para AAAAMMDD; AAMMDD; AAAAMMDD; <BR>
DDMM; MMDD; MMAA; AAMM; MMAAAA ou AAAAMM;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de d&iacute;gito usando m&oacute;dulo 10;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de d&iacute;gito usando m&oacute;dulo 11;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>C&aacute;lculo de d&iacute;gito m&oacute;dulo 10, retornando o resultado para o programa chamado;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>C&aacute;lculo de d&iacute;gito m&oacute;dulo 11, retornando o resultado para o programa chamado;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de validade do CPF;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de validade do CGC - abrangendo CPF;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de validade de CGC - n&atilde;o abrangendo CPF;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de informa&ccedil;&atilde;o no padr&atilde;o "S/N";</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de exist&ecirc;ncia da esta&ccedil;&atilde;o definida na rede;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de valor num&eacute;rico informado diferente de zero;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de primeira posi&ccedil;&atilde;o diferente de branco;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de exist&ecirc;ncia de v&aacute;rios brancos entre palavras;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de validade de impressora ou grupo de impressoras, quando utiliza-se o <I>Reprints</I>;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de informa&ccedil;&atilde;o no padr&atilde;o de sexo;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de informa&ccedil;&atilde;o no padr&atilde;o de estado civil.</FONT> </P></DIR>

<FONT SIZE=2><P>Conforme os testes definidos na valida&ccedil;&atilde;o em n&iacute;vel de estrutura, a consist&ecirc;ncia faz as seguintes cr&iacute;ticas de dados:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de um atributo contra constante;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de um atributo contra outro atributo;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de um atributo contra acumulador;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de um atributo contra tabela;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de um atributo contra sub-rotina da aplica&ccedil;&atilde;o;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de um atributo contra dados do sistema ou logon do usu&aacute;rio;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de um atributo para seguran&ccedil;a de acesso aos dados;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de duplicidade entre ocorr&ecirc;ncias de uma informa&ccedil;&atilde;o; </P>
</FONT><P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de desigualdade entre ocorr&ecirc;ncias de uma informa&ccedil;&atilde;o; </P>
</FONT><P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de informa&ccedil;&atilde;o de pelo menos uma ocorr&ecirc;ncia de um atributo ou grupo opcional;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de quantidade de ocorr&ecirc;ncias preenchidas;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Testes condicionais para atributos;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Defini&ccedil;&atilde;o de grupo opcional.</FONT> </P></DIR>

<B><FONT SIZE=5><P><A NAME="Condad">Tipos de convers&otilde;es de dados efetuadas pela consist&ecirc;ncia</A></B></FONT> </P>
<FONT SIZE=2><P>A consist&ecirc;ncia geral faz a valida&ccedil;&atilde;o e convers&atilde;o dos dados de entrada e os entrega para o programa chamado somente quando estiverem devidamente tratados e qualificados. <BR>
As convers&otilde;es dos dados de entrada a serem efetuadas pela consist&ecirc;ncia geral s&atilde;o determinadas conforme o formato e teste padr&atilde;o do atributo, definidos no reposit&oacute;rio de dados do SADS e na estrutura da consist&ecirc;ncia.</FONT> </P>
<FONT SIZE=2><P>As convers&otilde;es que podem ser efetuadas no atributo, de acordo com seu cadastramento e o cadastramento da estrutura da consist&ecirc;ncia, s&atilde;o as seguintes:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Alinhar dados num&eacute;ricos &agrave; direita;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Alinhar dados num&eacute;ricos &agrave; direita movendo zeros para as casas decimais;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Alinhar dados num&eacute;ricos &agrave; direita posicionando automaticamente o ponto decimal informado;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Acertar sinal em atributo negativo;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Inverter data no formato dia/m&ecirc;s/ano para ano/m&ecirc;s/dia;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Calcular d&iacute;gito m&oacute;dulo 10;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Calcular d&iacute;gito m&oacute;dulo 11;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Movimentar valor <I>default</I> para atributos opcionais n&atilde;o informados.</FONT> </P></DIR>

<B><FONT SIZE=5><P><A NAME="Tipcon">Tipos de consist&ecirc;ncia</A></B></FONT> </P>
<FONT SIZE=2><P>Existem tr&ecirc;s tipos de consist&ecirc;ncia no SADS, quais sejam:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Consist&ecirc;ncias de telas: determinam os testes e convers&otilde;es a serem efetuados sobre os dados informados nas telas que fazem parte do sistema aplicativo e s&atilde;o identificadas no seu c&oacute;digo pela constante "C" (sssCnnnn).</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Consist&ecirc;ncias de tabelas: determinam os testes e convers&otilde;es a serem efetuados sobre os dados informados nas tabelas dos aplicativos definidas no SADS e tamb&eacute;m s&atilde;o identificadas no seu c&oacute;digo pela constante "C" (sssCnnnn).</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Consist&ecirc;ncias de<I> jobs: </I>&nbsp;determinam os testes e convers&otilde;es a serem efetuados sobre os dados informados nas telas de par&acirc;metros dos<I> jobs</I> do Sistema de Controle de Processamento (SPO) e s&atilde;o identificadas no seu c&oacute;digo pela constante "Q" (sssQxxxx).</FONT> </P></DIR>

<B><FONT SIZE=5><P>Libera&ccedil;&atilde;o de consist&ecirc;ncia para os ambientes de teste e de produ&ccedil;&atilde;o</B></FONT> </P>
<FONT SIZE=2><P>Associado aos testes da consist&ecirc;ncia, existe o ambiente em que eles s&atilde;o executados. Deste modo, um mesmo c&oacute;digo de consist&ecirc;ncia pode ter testes diferentes sendo executados nos ambientes de teste e de produ&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>A libera&ccedil;&atilde;o de uma consist&ecirc;ncia &eacute; o processo que torna os seus testes dispon&iacute;veis para execu&ccedil;&atilde;o em um determinado ambiente.</FONT> </P>
<FONT SIZE=2><P>Os programas execut&aacute;veis no ambiente de teste ir&atilde;o utilizar os testes de consist&ecirc;ncia liberados para o ambiente de teste, e aqueles execut&aacute;veis no ambiente de produ&ccedil;&atilde;o ir&atilde;o utilizar os testes liberados para a produ&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Uma consist&ecirc;ncia deve ser liberada, a fim de se tornar dispon&iacute;vel para utiliza&ccedil;&atilde;o nos ambientes de teste e de produ&ccedil;&atilde;o, sempre que:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>For efetuado seu cadastramento;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Forem efetuadas manuten&ccedil;&otilde;es no seu cadastramento, na sua estrutura ou nos seus testes em n&iacute;vel de estrutura;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Forem efetuadas altera&ccedil;&otilde;es nas defini&ccedil;&otilde;es dos atributos que fazem parte de sua estrutura.</FONT> </P></DIR>

<FONT SIZE=2><P>Para liberar uma consist&ecirc;ncia para a produ&ccedil;&atilde;o, &eacute; necess&aacute;rio que a mesma j&aacute; esteja liberada para testes.</FONT> </P>
<B><FONT SIZE=5><P><A NAME="Padro">Padroniza&ccedil;&atilde;o</A></B></FONT> </P>
<P><HR></P>
<FONT SIZE=2><P>A padroniza&ccedil;&atilde;o utilizada pelo SADS para os c&oacute;digos de consist&ecirc;ncia &eacute;:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>"ssstxxxx"</B>, onde:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><B><FONT SIZE=2>"sss"</B> &eacute; o c&oacute;digo alfab&eacute;tico que identifica o sistema;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><B><FONT SIZE=2>"t"</B> &eacute; o tipo de elemento que identifica a consist&ecirc;ncia e</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><B><FONT SIZE=2>"xxxx"</B> &eacute; o diferenciador da consist&ecirc;ncia.</P></DIR>
</DIR>

<P>O tipo de elemento que identifica a consist&ecirc;ncia &eacute;:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>"C" - Para as consist&ecirc;ncias de telas e tabelas;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>"Q" - Para as consist&ecirc;ncias de telas par&acirc;metros de <I>jobs</I> do SPO.</FONT> </P></DIR>

<FONT SIZE=2><P>O diferenciador da consist&ecirc;ncia varia conforme o tipo de consist&ecirc;ncia, da seguinte forma:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Consist&ecirc;ncia de uma tela do sistema:</B></FONT> </P>
<FONT SIZE=2><P>Neste caso, o c&oacute;digo da consist&ecirc;ncia deve ter o mesmo diferenciador da tela a ser consistida.</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><B><FONT SIZE=2>"sssCnnnn",</B> onde:</FONT> </P><DIR>

<P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><B><FONT SIZE=2>"sss"</B> &eacute; o c&oacute;digo alfab&eacute;tico que identifica o sistema;</FONT> </P>
<P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><B><FONT SIZE=2>"C"</B> &eacute; a constante de tela e</FONT> </P>
<P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><B><FONT SIZE=2>"nnnn"</B> &eacute; o identificador num&eacute;rico da tela.</FONT> </P></DIR>

<FONT SIZE=2><P>Exemplo:</FONT> </P>
<FONT SIZE=2><P>A consist&ecirc;ncia da tela de c&oacute;digo SRHT0122 &eacute; SRHC0122, onde:</FONT> </P>
<B><FONT SIZE=2><P>"SRHC0122"</B> onde:</FONT> </P><DIR>

<B><FONT SIZE=2><P>"SRH"</B> &eacute; o c&oacute;digo do sistema;</FONT> </P>
<B><FONT SIZE=2><P>"C"</B> &eacute; a constante de tela;</FONT> </P>
<B><FONT SIZE=2><P>"01"</B> &eacute; o c&oacute;digo do menu da tela e</FONT> </P>
<B><FONT SIZE=2><P>"02"</B> &eacute; o c&oacute;digo da transa&ccedil;&atilde;o da tela.</FONT> </P></DIR>
</DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Consist&ecirc;ncia de uma tabela do sistema:</B></FONT> </P>
<FONT SIZE=2><P>Neste caso, o c&oacute;digo da consist&ecirc;ncia deve ter o mesmo diferenciador da tabela a ser consistida:</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><B><FONT SIZE=2>"sssCnnnn"</B> onde:</FONT> </P><DIR>
<DIR>

<P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><B><FONT SIZE=2>"sss"</B> &eacute; o c&oacute;digo alfab&eacute;tico que identifica o sistema;</FONT> </P>
<P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><B><FONT SIZE=2>"C"</B> &eacute; a constante de consist&ecirc;ncia de tabela e</FONT> </P>
<P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><B><FONT SIZE=2>"nnnn"</B> &eacute; o identificador num&eacute;rico da tabela (deve ser maior ou igual a "5000").</FONT> </P></DIR>

<FONT SIZE=2><P>Exemplo:</FONT> </P>
<FONT SIZE=2><P>A consist&ecirc;ncia da tabela de c&oacute;digo SRHM6000 &eacute; SRHC6000, onde:</FONT> </P>
<B><FONT SIZE=2><P>"SRHC6000"</B> onde:</FONT> </P><DIR>

<B><FONT SIZE=2><P>"SRH"</B> &eacute; o c&oacute;digo do sistema;</FONT> </P>
<B><FONT SIZE=2><P>"C"</B> &eacute; a constante de consist&ecirc;ncia de tabela e</FONT> </P>
<B><FONT SIZE=2><P>"6000"</B> &eacute; o n&uacute;mero sequencial da tabela.</FONT> </P></DIR>
</DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Consist&ecirc;ncia de tela de par&acirc;metro de<I> job</I> do Sistema Controle de Processamento (SPO):</B></FONT> </P>
<FONT SIZE=2><P>Neste caso, o c&oacute;digo da consist&ecirc;ncia deve ter o mesmo diferenciador da tela de par&acirc;metro do <I>job</I>: </P><DIR>

</FONT><P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><B><FONT SIZE=2>"sssQxxxx"</B> onde:</FONT> </P><DIR>

<P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><B><FONT SIZE=2>"sss"</B> &eacute; o c&oacute;digo alfab&eacute;tico ue identifica o sistema;</FONT> </P>
<P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><B><FONT SIZE=2>"Q"</B> &eacute; a constante de consist&ecirc;ncia de tela par&acirc;metro de job e</FONT> </P>
<P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><B><FONT SIZE=2>"xxxx"</B> &eacute; o diferenciador da tela par&acirc;metro de job.</FONT> </P></DIR>
</DIR>
</DIR>

<B><FONT SIZE=5><P><A NAME="Utili">Utiliza&ccedil;&atilde;o</A></B></FONT> </P>
<P><HR></P>
<FONT SIZE=2><P>A consist&ecirc;ncia geral, tal como citado em sua defini&ccedil;&atilde;o, &eacute; um m&oacute;dulo do SADS respons&aacute;vel por efetuar a cr&iacute;tica e convers&atilde;o da entrada de dados para o processamento de transa&ccedil;&otilde;es <I>on-line</I>.</FONT> </P>
<FONT SIZE=2><P>Essas cr&iacute;ticas e convers&otilde;es dos dados de entrada s&atilde;o executadas por uma sub-rotina gen&eacute;rica do SADS - SSCS01 - de acordo com as defini&ccedil;&otilde;es de consist&ecirc;ncias e atributos cadastradas no reposit&oacute;rio de dados.</FONT> </P>
<FONT SIZE=2><P>Atrav&eacute;s do cadastramento dessas consist&ecirc;ncias, elimina-se a necessidade de codifica&ccedil;&atilde;o dos diversos tipos de testes, internamente aos programas aplicativos, permitindo maior flexibilidade e agilidade no desenvolvimento e nas manuten&ccedil;&otilde;es dos sistemas aplicativos.</FONT> </P>
<FONT SIZE=2><P>Ap&oacute;s a libera&ccedil;&atilde;o da consist&ecirc;ncia para o ambiente de teste ou produ&ccedil;&atilde;o, torna-se poss&iacute;vel utiliz&aacute;-la pelos programas execut&aacute;veis neste ambiente.</FONT> </P>
<FONT SIZE=2><P>Tamb&eacute;m ap&oacute;s a libera&ccedil;&atilde;o, pode-se efetuar a simula&ccedil;&atilde;o da consist&ecirc;ncia de tela, ou seja, torna-se poss&iacute;vel disparar sua execu&ccedil;&atilde;o antes mesmo do desenvolvimento dos programas chamados do sistema.</FONT> </P>
<B><FONT SIZE=5><P><A NAME="Cadas">Cadastramento</A></B></FONT> </P>
<P><HR></P>
<FONT SIZE=2><P>Para cadastrar a estrutura de uma consist&ecirc;ncia, &eacute; indispens&aacute;vel que seu sistema tenha sido anteriormente cadastrado no reposit&oacute;rio de dados do SADS.</FONT> </P>
<FONT SIZE=2><P>O SADS permite efetuar a gera&ccedil;&atilde;o autom&aacute;tica da estrutura de uma consist&ecirc;ncia a partir de uma tela ou de uma tabela anteriormente cadastrada.</FONT> </P>
<FONT SIZE=2><P>Para efetuar a gera&ccedil;&atilde;o autom&aacute;tica da consist&ecirc;ncia de tela, &eacute; necess&aacute;rio que a estrutura da tela esteja cadastrada no reposit&oacute;rio de dados do SADS e que possua atributos de <I>input</I>.</FONT> </P>
<FONT SIZE=2><P>No caso de gera&ccedil;&atilde;o da consist&ecirc;ncia de tabela, &eacute; necess&aacute;rio que a estrutura da tabela esteja cadastrada no reposit&oacute;rio de dados do SADS.</FONT> </P>
<FONT SIZE=2><P>No cadastramento de testes de valida&ccedil;&atilde;o que fazem refer&ecirc;ncia a elementos do reposit&oacute;rio (tabelas e sub-rotinas), ser&aacute; exigido que estes j&aacute; estejam cadastrados.</FONT> </P>
<B><FONT SIZE=4><P>Roteiro</B></FONT> </P>
<FONT SIZE=2><P>Para cadastrar uma consist&ecirc;ncia no SADS e torn&aacute;-la dispon&iacute;vel para utiliza&ccedil;&atilde;o, execute as seguintes fun&ccedil;&otilde;es:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><A HREF="#Gerest">Gera&ccedil;&atilde;o de estrutura de consist&ecirc;ncia a partir de tela ou tabela</A><FONT SIZE=2>;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><A HREF="#Defcon">Defini&ccedil;&atilde;o de consist&ecirc;ncia</A><FONT SIZE=2>;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><A HREF="#Cadest">Cadastramento de estrutura de consist&ecirc;ncia</A><FONT SIZE=2>;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><A HREF="#Cadtes">Cadastramento de testes de valida&ccedil;&atilde;o em n&iacute;vel de estrutura</A><FONT SIZE=2> (opcional);</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><A HREF="#Libcon">Libera&ccedil;&atilde;o de consist&ecirc;ncia</A><FONT SIZE=2>.</FONT> </P></DIR>

<FONT SIZE=2><P>Outra fun&ccedil;&atilde;o que pode ser efetuada para a consist&ecirc;ncia &eacute;:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><A HREF="#Simcon">Simula&ccedil;&atilde;o de consist&ecirc;ncia</A><FONT SIZE=2>.</FONT> </P></DIR>

<B><FONT SIZE=5><P><A NAME="Gerest">Gera&ccedil;&atilde;o de estrutura de consist&ecirc;ncia a partir de tela ou tabela</A></B></FONT> </P>
<FONT SIZE=2><P>O SADS permite efetuar o cadastramento autom&aacute;tico da estrutura de uma consist&ecirc;ncia a partir de uma tela ou de uma tabela anteriormente cadastrada.</FONT> </P>
<FONT SIZE=2><P>Esta opera&ccedil;&atilde;o substitui a inclus&atilde;o manual do cadastramento da consist&ecirc;ncia. Ap&oacute;s a gera&ccedil;&atilde;o da consist&ecirc;ncia, no entanto, pode-se alterar a sua estrutura, incluir testes de valida&ccedil;&atilde;o ou liber&aacute;-la para teste.</FONT> </P>
<FONT SIZE=2><P>A respeito da gera&ccedil;&atilde;o da consist&ecirc;ncia a partir de uma tela, tem-se as seguintes considera&ccedil;&otilde;es:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Todos os atributos indicados como<I> input</I> na estrutura da tela, juntamente com os itens com ocorr&ecirc;ncias, ser&atilde;o transferidos para a estrutura da consist&ecirc;ncia. Consequentemente, as indica&ccedil;&otilde;es de opcionalidade, tamanho, sinal e decimais da estrutura da tela tamb&eacute;m ser&atilde;o herdadas;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>O atributo que identifica o <I>trancode</I> &eacute; o &uacute;nico atributo de entrada que n&atilde;o &eacute; copiado da estrutura da tela para a estrutura da consist&ecirc;ncia;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Se houver indica&ccedil;&atilde;o de in&iacute;cio e fim de grupo opcional na estrutura da tela, ser&aacute; automaticamente gerado este teste nas valida&ccedil;&otilde;es em n&iacute;vel de estrutura de consist&ecirc;ncia (veja como delimitar um grupo opcional na estrutura da tela nesta se&ccedil;&atilde;o, item "Tela").</FONT> </P></DIR>

<FONT SIZE=2><P>A respeito da gera&ccedil;&atilde;o da consist&ecirc;ncia a partir de uma tabela, tem-se as seguintes considera&ccedil;&otilde;es:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Os atributos da estrutura da tabela e os atributos "TBLCOD" (C&oacute;digo de Tabela), "TLACONT" (Indica&ccedil;&atilde;o de Continua&ccedil;&atilde;o) e "TLACONF" (Indica&ccedil;&atilde;o de Confirma&ccedil;&atilde;o), que s&atilde;o atributos pertencentes ao SADS, ser&atilde;o automaticamente agregados &agrave; estrutura da consist&ecirc;ncia;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>As indica&ccedil;&otilde;es de opcionalidade indicadas na estrutura da tabela ser&atilde;o herdadas;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>O teste de grupo opcional ser&aacute; gerado com in&iacute;cio no primeiro atributo chave e com fim no &uacute;ltimo atributo da tabela;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Se uma tabela possuir apenas um atributo, este ser&aacute; gerado como opcional em vez de ser gerado grupo opcional para ele.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Se uma tabela terminar com ocorr&ecirc;ncias, os atributos ser&atilde;o gerados como opcionais em vez de ser gerado grupo opcional para eles.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Se o desenho da tabela j&aacute; estiver cadastrado no reposit&oacute;rio de dados, ser&aacute; gerado um item grupo com o mesmo n&uacute;mero de ocorr&ecirc;ncias que couberem na tela de capta&ccedil;&atilde;o de itens para a tabela. Caso contr&aacute;rio, o item grupo ser&aacute; gerado com "9999" ocorr&ecirc;ncias. </P></DIR>

<P>Na estrutura de telas e tabelas, &eacute; permitido que se cadastre, dentro de um item grupo que possui ocorr&ecirc;ncias, um outro item grupo. Tamb&eacute;m &eacute; poss&iacute;vel cadastrar um atributo que possua mais de dois atributos hierarquicamente superiores. No entanto, estas situa&ccedil;&otilde;es n&atilde;o s&atilde;o suportadas pela consist&ecirc;ncia. Neste caso, pode-se gerar a consist&ecirc;ncia a partir da tela ou tabela, por&eacute;m, antes de liber&aacute;-la, ser&atilde;o necess&aacute;rias algumas altera&ccedil;&otilde;es em sua estrutura. </P>
</FONT><P>Por exemplo: </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Se, na estrutura da consist&ecirc;ncia, um atributo tiver mais de dois atributos hierarquicamente superiores, conforme exibido a seguir: </P></DIR>
</FONT>
<TABLE BORDER CELLSPACING=1 BORDERCOLOR="#000000" WIDTH=177>
<TR><TD WIDTH="60%" VALIGN="MIDDLE">
<PRE>
ATRIBUTO</PRE></TD>
<TD WIDTH="40%" VALIGN="MIDDLE">
<PRE>
NIVEL</PRE></TD>
</TR>
<TR><TD WIDTH="60%" VALIGN="MIDDLE">
<PRE>
ELECOD</PRE></TD>
<TD WIDTH="40%" VALIGN="MIDDLE">
<PRE>
10</PRE></TD>
</TR>
<TR><TD WIDTH="60%" VALIGN="MIDDLE">
<PRE>
SISCOD</PRE></TD>
<TD WIDTH="40%" VALIGN="MIDDLE">
<PRE>
15</PRE></TD>
</TR>
<TR><TD WIDTH="60%" VALIGN="MIDDLE">
<PRE>
ELECLS</PRE></TD>
<TD WIDTH="40%" VALIGN="MIDDLE">
<PRE>
15</PRE></TD>
</TR>
<TR><TD WIDTH="60%" VALIGN="MIDDLE">
<PRE>
ELETIP</PRE></TD>
<TD WIDTH="40%" VALIGN="MIDDLE">
<PRE>
20</PRE></TD>
</TR>
<TR><TD WIDTH="60%" VALIGN="MIDDLE">
<PRE>
ELEIDF</PRE></TD>
<TD WIDTH="40%" VALIGN="MIDDLE">
<PRE>
20</PRE></TD>
</TR>
<TR><TD WIDTH="60%" VALIGN="MIDDLE">
<PRE>
ELEQTD</PRE></TD>
<TD WIDTH="40%" VALIGN="MIDDLE">
<PRE>
25</PRE></TD>
</TR>
<TR><TD WIDTH="60%" VALIGN="MIDDLE">
<PRE>
ELETAM</PRE></TD>
<TD WIDTH="40%" VALIGN="MIDDLE">
<PRE>
25</PRE></TD>
</TR>
</TABLE>
<DIR>

<P>A estrutura da consist&ecirc;ncia deve ser alterada para: </P></DIR>

<TABLE CELLSPACING=0 BORDER=0 WIDTH=499>
<TR>
<TD WIDTH="21%" VALIGN="MIDDLE"><P>ATRIBUTO</TD><TD WIDTH="21%" VALIGN="MIDDLE">
<P>NIVEL</TD><TD WIDTH="11%" VALIGN="MIDDLE"><P>ou</TD>
<TD WIDTH="24%" VALIGN="MIDDLE"><P>ATRIBUTO</TD><TD WIDTH="24%" VALIGN="MIDDLE">
<P>NIVEL</TD></TR>
<TR><TD WIDTH="21%" VALIGN="MIDDLE">
<P>SISCOD</TD>
<TD WIDTH="21%" VALIGN="MIDDLE">
<P>10</TD>
<TD WIDTH="11%" VALIGN="MIDDLE" ROWSPAN=6>
<P>&nbsp;</TD>
<TD WIDTH="24%" VALIGN="MIDDLE">
<P>ELECOD</TD>
<TD WIDTH="24%" VALIGN="MIDDLE">
<P>10</TD>
</TR>
<TR><TD WIDTH="21%" VALIGN="MIDDLE">
<P>ELECLS</TD>
<TD WIDTH="21%" VALIGN="MIDDLE">
<P>10</TD>
<TD WIDTH="24%" VALIGN="MIDDLE">
<P>SISCOD</TD>
<TD WIDTH="24%" VALIGN="MIDDLE">
<P>15</TD>
</TR>
<TR><TD WIDTH="21%" VALIGN="MIDDLE">
<P>ELETIP</TD>
<TD WIDTH="21%" VALIGN="MIDDLE">
<P>15</TD>
<TD WIDTH="24%" VALIGN="MIDDLE">
<P>ELECLS</TD>
<TD WIDTH="24%" VALIGN="MIDDLE">
<P>15</TD>
</TR>
<TR><TD WIDTH="21%" VALIGN="MIDDLE">
<P>ELEIDF</TD>
<TD WIDTH="21%" VALIGN="MIDDLE">
<P>15</TD>
<TD WIDTH="24%" VALIGN="MIDDLE">
<P>ELETIP</TD>
<TD WIDTH="24%" VALIGN="MIDDLE">
<P>20</TD>
</TR>
<TR><TD WIDTH="21%" VALIGN="MIDDLE">
<P>ELEQTD</TD>
<TD WIDTH="21%" VALIGN="MIDDLE">
<P>20</TD>
<TD WIDTH="24%" VALIGN="MIDDLE">
<P>ELEQTD</TD>
<TD WIDTH="24%" VALIGN="MIDDLE">
<P>20</TD>
</TR>
<TR><TD WIDTH="21%" VALIGN="MIDDLE">
<P>ELETAM</TD>
<TD WIDTH="21%" VALIGN="MIDDLE">
<P>20</TD>
<TD WIDTH="24%" VALIGN="MIDDLE">
<P>ELETAM</TD>
<TD WIDTH="24%" VALIGN="MIDDLE">
<P>20</TD>
</TR>
</TABLE>
<DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12>Se, na estrutura da consist&ecirc;ncia, houver item grupo dentro de ocorr&ecirc;ncias, conforme exibido a seguir: </P></DIR>

<TABLE BORDER CELLSPACING=1 BORDERCOLOR="#000000" WIDTH=248>
<TR><TD WIDTH="43%" VALIGN="MIDDLE">
<PRE>
ATRIBUTO</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<PRE>
NIVEL</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<PRE>
OCORR</PRE></TD>
</TR>
<TR><TD WIDTH="43%" VALIGN="MIDDLE">
<PRE>
TABTELA</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<PRE>
10</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<PRE>

06</PRE></TD>
</TR>
<TR><TD WIDTH="43%" VALIGN="MIDDLE">
<PRE>
SISCOD</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<PRE>
15</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<P>&nbsp;</TD>
</TR>
<TR><TD WIDTH="43%" VALIGN="MIDDLE">
<PRE>
ELECLS</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<PRE>
15</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<P>&nbsp;</TD>
</TR>
<TR><TD WIDTH="43%" VALIGN="MIDDLE">
<PRE>
ELETIP</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<PRE>
20</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<P>&nbsp;</TD>
</TR>
<TR><TD WIDTH="43%" VALIGN="MIDDLE">
<PRE>
ELEIDF</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<PRE>
20</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<P>&nbsp;</TD>
</TR>
</TABLE>
<DIR>

<P>A estrutura da consist&ecirc;ncia deve ser alterada para: </P></DIR>

<TABLE BORDER CELLSPACING=1 BORDERCOLOR="#000000" WIDTH=248>
<TR><TD WIDTH="43%" VALIGN="MIDDLE">
<PRE>
ATRIBUTO</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<PRE>
NIVEL</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<PRE>
OCORR</PRE></TD>
</TR>
<TR><TD WIDTH="43%" VALIGN="MIDDLE">
<PRE>
TABTELA</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<PRE>
10</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<PRE>

06</PRE></TD>
</TR>
<TR><TD WIDTH="43%" VALIGN="MIDDLE">
<PRE>
SISCOD</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<PRE>
15</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<P>&nbsp;</TD>
</TR>
<TR><TD WIDTH="43%" VALIGN="MIDDLE">
<PRE>
ELETIP</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<PRE>
15</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<P>&nbsp;</TD>
</TR>
<TR><TD WIDTH="43%" VALIGN="MIDDLE">
<PRE>
ELEIDF</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<PRE>
15</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<P>&nbsp;</TD>
</TR>
</TABLE>

<P>Para gera&ccedil;&atilde;o autom&aacute;tica de consist&ecirc;ncia de tela, &eacute; necess&aacute;rio que a estrutura da tela esteja cadastrada no reposit&oacute;rio de dados do SADS e que possua atributos de <I><FONT SIZE=2>input</I>.</FONT> </P>
<FONT SIZE=2><P>No caso de gera&ccedil;&atilde;o de consist&ecirc;ncia de tabela, &eacute; necess&aacute;rio que a estrutura da tabela esteja cadastrada no reposit&oacute;rio de dados do SADS.</FONT> </P>
<FONT SIZE=2><P>A gera&ccedil;&atilde;o de estrutura de consist&ecirc;ncia n&atilde;o est&aacute; associada a nenhuma tela de processamento. Portanto, para efetu&aacute;-la, basta informar, no menu "GERCON", o c&oacute;digo de uma tela ou tabela a partir da qual ser&aacute; gerada a consist&ecirc;ncia.</FONT> </P>
<B><FONT SIZE=5><P><A NAME="Defcon">Defini&ccedil;&atilde;o de consist&ecirc;ncia </A></P>
</B></FONT><FONT SIZE=2><P>Definir uma consist&ecirc;ncia &eacute; determinar seu c&oacute;digo e nome e especificar qual o separador de casas decimais que ser&aacute; por ela utilizada - ponto ou v&iacute;rgula.</FONT> </P>
<FONT SIZE=2><P>Para definir uma consist&ecirc;ncia, &eacute; necess&aacute;rio que seu sistema j&aacute; esteja cadastrado no reposit&oacute;rio de dados do SADS. </P>
<B><P>CAMPOS DA TELA</B></FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>CODIGO</B> - C&oacute;digo da consist&ecirc;ncia no padr&atilde;o SADS (sssCnnnn ou sssQxxxx).</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>NOME</B> - Nome da consist&ecirc;ncia.</FONT> </P>
<FONT SIZE=2><P>O nome tem o objetivo de identificar e explicar resumidamente a que ela se refere.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SEPARADOR DE DECIMAIS</B> - Indicador do caractere que dever&aacute; ser usado como separador de casas decimais na informa&ccedil;&atilde;o de campos num&eacute;ricos com decimais.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"V" - V&iacute;rgula;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"P" - Ponto.</FONT> </P></DIR>
</DIR>

<B><FONT SIZE=5><P><A NAME="Cadest">Cadastramento de estrutura de consist&ecirc;ncia</A></B></FONT> </P>
<FONT SIZE=2><P>Cadastrar estrutura de consist&ecirc;ncia significa definir quais s&atilde;o os atributos de entrada de dados e a ordem em que aparecem, especificando, caso necess&aacute;rio, seus formatos, tamanhos, padr&otilde;es e demais caracter&iacute;sticas.</FONT> </P>
<FONT SIZE=2><P>Se a estrutura da tela ou tabela relativa &agrave; consist&ecirc;ncia j&aacute; estiver cadastrada, &eacute; mais conveniente efetuar a gera&ccedil;&atilde;o autom&aacute;tica da consist&ecirc;ncia a partir de tal estrutura, conforme descrita anteriormente no t&oacute;pico "Gera&ccedil;&atilde;o de estrutura de consist&ecirc;ncia a partir de tela ou tabela". Depois, se necess&aacute;rio, pode-se fazer adapta&ccedil;&otilde;es na mesma, conforme descrito neste t&oacute;pico.</FONT> </P>
<FONT SIZE=2><P>Para o cadastramento de estrutura de consist&ecirc;ncia, devem ser verificadas as seguintes regras:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Todos os atributos de <I>input</I> da estrutura da tela ou tabela, com exce&ccedil;&atilde;o do atributo que identifica o <I>trancode</I>, devem estar cadastrados na estrutura da consist&ecirc;ncia na mesma ordem em que aparecem na estrutura de origem.</FONT> </P>
<FONT SIZE=2><P>Os atributos da estrutura da consist&ecirc;ncia n&atilde;o precisam necessariamente ter os mesmos mnem&ocirc;nicos daqueles da estrutura da tela ou tabela correspondente. Al&eacute;m disso, &eacute; permitido que os atributos da tela ou tabela possam ser redefinidos na estrutura da consist&ecirc;ncia, possibilitando, assim, que eles tenham nome, tamanho e formato diferentes em ambas as estruturas.</FONT> </P>
<FONT SIZE=2><P>Entretanto, pode ter sido parametrizado na tabela SBPM5000 que os atributos/campos n&atilde;o podem ter seus tamanhos e formatos redefinidos nas estruturas nas quais s&atilde;o inclu&iacute;dos.</FONT> </P>
<FONT SIZE=2><P>Maiores detalhes a respeito desta parametriza&ccedil;&atilde;o, deve-se consultar a Se&ccedil;&atilde;o V, "Parametriza&ccedil;&otilde;es do SADS", item "Atributo", subitem "Redefini&ccedil;&atilde;o em estruturas".</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Na estrutura de consist&ecirc;ncia de tabela, al&eacute;m dos atributos de <I>input</I>, dever&atilde;o estar cadastrados os seguintes atributos:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>TBLCOD - C&oacute;digo de Tabela (NDEF = "S", SIS = "SST");</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>TLACONT - Indica&ccedil;&atilde;o de Continua&ccedil;&atilde;o (NDEF = "G");</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>TLACONF - Indica&ccedil;&atilde;o de Confirma&ccedil;&atilde;o (NDEF = "G").</FONT> </P></DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Na estrutura da consist&ecirc;ncia de tabela, dever&aacute; estar cadastrado um item grupo com o n&uacute;mero de ocorr&ecirc;ncias igual ao n&uacute;mero de itens que couberem na tela de capta&ccedil;&atilde;o da tabela: "TBLGRUPO" (Indicador de grupo de ocorr&ecirc;ncias na tabela).</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>No cadastramento de telas e tabelas, &eacute; permitido cadastrar, dentro de um item grupo que possui ocorr&ecirc;ncias, um outro item grupo. Esta situa&ccedil;&atilde;o, entretanto, n&atilde;o &eacute; suportada pela consist&ecirc;ncia. Neste caso, pode-se gerar a consist&ecirc;ncia a partir da tela ou tabela, por&eacute;m, antes de liber&aacute;-la, &eacute; necess&aacute;rio fazer algumas altera&ccedil;&otilde;es em sua estrutura, utilizando-se as seguintes facilidades oferecidas: uso de sufixo, atributo particular e redefini&ccedil;&atilde;o de atributo.</FONT> </P></DIR>

<FONT SIZE=2><P>A estrutura de consist&ecirc;ncia &eacute; independente da estrutura do elemento ao qual se refere (tela ou tabela) e, portanto, n&atilde;o &eacute; necess&aacute;ria uma correspond&ecirc;ncia exata entre os atributos destas estruturas. Um determinado atributo da estrutura da tela, por exemplo, pode aparecer definido por v&aacute;rios atributos na estrutura de consist&ecirc;ncia e vice-versa.</FONT> </P>
<B><FONT SIZE=2><P>CAMPOS DA TELA</B></FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>CONSISTENCIA </B>- C&oacute;digo da consist&ecirc;ncia no padr&atilde;o SADS (sssCnnnn ou sssQxxxx).</FONT> </P>
<FONT SIZE=2><P>Para cada um dos atributos que comp&otilde;e a estrutura da consist&ecirc;ncia, tem-se as seguintes informa&ccedil;&otilde;es:</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SEQ</B> - N&uacute;mero sequencial para posicionamento do atributo na estrutura.</FONT> </P>
<FONT SIZE=2><P>Este campo j&aacute; vem informado, sendo o primeiro n&uacute;mero igual a 0010 e os demais, acrescidos de 10.</FONT> </P>
<FONT SIZE=2><P>Para incluir um atributo entre dois outros j&aacute; existentes, este atributo deve ser informado em uma linha que esteja em branco e o n&uacute;mero sequencial desta linha deve ser alterado para um dentre o intervalo daqueles. O SADS reorganizar&aacute; automaticamente a estrutura e, na pr&oacute;xima opera&ccedil;&atilde;o, os atributos j&aacute; estar&atilde;o na nova ordem.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>ATRIBUTO</B> - Mnem&ocirc;nico do atributo.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SUF</B> - Sufixo do atributo.</FONT> </P>
<FONT SIZE=2><P>Este campo deve ser informado para diferenciar um atributo quando este aparecer mais de uma vez na estrutura.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>NIV</B> - N&iacute;vel de estrutura&ccedil;&atilde;o do atributo, an&aacute;logo ao n&iacute;vel Cobol.</FONT> </P>
<FONT SIZE=2><P>O n&iacute;vel inicial &eacute; 10 e, se for necess&aacute;rio criar agrupamentos de atributos - itens grupo - pode-se utilizar m&uacute;ltiplos de 5 (15, 20 e assim por diante), de forma semelhante ao Cobol.</FONT> </P>
<FONT SIZE=2><P>Um atributo definido como um item grupo pode ter no m&aacute;ximo dois n&iacute;veis hierarquicamente inferiores. Exemplo:</FONT> </P></DIR>

<TABLE BORDER CELLSPACING=1 BORDERCOLOR="#000000" WIDTH=319>
<TR><TD WIDTH="35%" VALIGN="MIDDLE">
<PRE>
ATRIBUTO</PRE></TD>
<TD WIDTH="65%" VALIGN="MIDDLE">
<PRE>
NIV</PRE></TD>
</TR>
<TR><TD WIDTH="35%" VALIGN="MIDDLE">
<PRE>
SISCOD</PRE></TD>
<TD WIDTH="65%" VALIGN="MIDDLE">
<PRE>
10</PRE></TD>
</TR>
<TR><TD WIDTH="35%" VALIGN="MIDDLE">
<PRE>
ELECOD</PRE></TD>
<TD WIDTH="65%" VALIGN="MIDDLE">
<PRE>
15</PRE></TD>
</TR>
<TR><TD WIDTH="35%" VALIGN="MIDDLE">
<PRE>
DESCOD</PRE></TD>
<TD WIDTH="65%" VALIGN="MIDDLE">
<PRE>
20</PRE></TD>
</TR>
<TR><TD WIDTH="35%" VALIGN="MIDDLE">
<PRE>
NOMCOD</PRE></TD>
<TD WIDTH="65%" VALIGN="MIDDLE">
<PRE>
25 N&iacute;vel inv&aacute;lido</PRE></TD>
</TR>
</TABLE>
<DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>NDEF</B> - N&iacute;vel de defini&ccedil;&atilde;o do atributo no reposit&oacute;rio de dados.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"S" (Sistema) - Para atributos definidos no reposit&oacute;rio de dados que pertencem ao sistema informado no campo SIS ou que pertencem ao mesmo sistema da consist&ecirc;ncia;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"P" (Particular) - Para atributos n&atilde;o definidos no reposit&oacute;rio do SADS, que s&atilde;o espec&iacute;ficos desta consist&ecirc;ncia.</FONT> </P>
<FONT SIZE=2><P>Quando o atributo &eacute; particular da consist&ecirc;ncia (campo NDEF = "P"), &eacute; obrigat&oacute;rio definir seu tamanho e formato - campos TAM e FOR.</FONT> </P>
<FONT SIZE=2><P>N&atilde;o pode ser informado NDEF = "P" caso tenha sido parametrizado na tabela SBPM5000 que n&atilde;o se pode definir atributos/campos particulares nas estuturas SADS.</FONT> </P>
<FONT SIZE=2><P>Maiores detalhes a respeito desta parametriza&ccedil;&atilde;o, deve-se consultar a Se&ccedil;&atilde;o V, "Parametriza&ccedil;&otilde;es do SADS", item "Atributo", subitem "Redefini&ccedil;&atilde;o em estruturas". </P>
</FONT><P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"G" (Global) - Para atributos definidos no SADS para utiliza&ccedil;&atilde;o gen&eacute;rica pelos sistemas aplicativos;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"R" - Para atributos que redefinem o atributo de sequ&ecirc;ncia imediatamente anterior.</FONT> </P>
<FONT SIZE=2><P>Redefini&ccedil;&otilde;es, em estruturas de consist&ecirc;ncia geral, s&atilde;o indica&ccedil;&otilde;es de que os atributos (o redefinidor e o redefinido) come&ccedil;am na mesma posi&ccedil;&atilde;o na tela.</FONT> </P>
<FONT SIZE=2><P>A respeito de redefini&ccedil;&otilde;es de atributos na estrutura da consist&ecirc;ncia, t&ecirc;m-se as seguintes considera&ccedil;&otilde;es:</FONT> </P><DIR>

<P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>O atributo redefinidor n&atilde;o precisa estar, necessariamente, cadastrado no reposit&oacute;rio de dados. Caso n&atilde;o esteja cadastrado, seu tamanho e formato (campos TAM e FOR) devem ser informados. Caso contr&aacute;rio, seu sistema (campo SIS) deve ser informado, mesmo que seja igual ao da consist&ecirc;ncia.</FONT> </P>
<P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>O tamanho do atributo redefinidor pode ser maior, igual ou menor do que o do atributo redefinido. No conte&uacute;do do atributo redefinidor, ser&atilde;o englobados todos os caracteres a partir do in&iacute;cio do atributo redefinido, extendendo pelos pr&oacute;ximos atributos da estrutura, at&eacute; completar o seu tamanho. Este tamanho &eacute; informado na estrutura ou cadastrado no reposit&oacute;rio de dados.</FONT> </P></DIR>

<FONT SIZE=2><P>Portanto, tr&ecirc;s tipos de redefini&ccedil;&atilde;o podem ser obtidos:</FONT> </P><DIR>

<P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Quando o tamanho do redefinidor for menor, tem-se em seu conte&uacute;do uma parte do conte&uacute;do do atributo redefinido;</FONT> </P>
<P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Quando o tamanho do redefinidor for igual, tem-se em seu conte&uacute;do tal e qual o conte&uacute;do do atributo redefinido ou</FONT> </P>
<P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Quando o tamanho do redefinidor for maior, ele poder&aacute; englobar v&aacute;rios outros atributos, pois ter&aacute; em seu conte&uacute;do todos os caracteres do atributo redefinido, mais os dos atributos posteriores a ele na estrutura da consist&ecirc;ncia, at&eacute; completar o seu tamanho.</FONT> </P></DIR>

<FONT SIZE=2><P>A seguir, s&atilde;o apresentados dois exemplos de cadastramento de redefini&ccedil;&atilde;o:</FONT> </P>
<PRE>
        SEQ             ATRIBUTO        NIVEL   NDEF    SIS     TAM     FOR
01      [0010]          [CRODIAINI]     [10]    [S]     [  ]    [   ]   [ ]
02      [0020]          [DATINI]        [10]    [R]     [  ]    [006]   [N]
03      [0030]          [CROMESINI]     [10]    [S]     [  ]    [   ]   [ ]
04      [0040]          [CROANOINI]     [10]    [S]     [  ]    [   ]   [ ]</PRE>
<FONT SIZE=2><P>Neste exemplo, o atributo "DATINI" redefine o atributo "CRODIAINI", que foi definido no reposit&oacute;rio de dados com tamanho 2 (dois), tal qual "CROMESINI" e "CROANOINI". Deste modo, o atributo "DATINI", que possui tamanho de seis caracteres, cont&eacute;m as mesmas informa&ccedil;&otilde;es que "CRODIAINI", mais as informa&ccedil;&otilde;es de "CROMESINI" e "CROANOINI".</FONT> </P>
<FONT SIZE=2><P>SEQ ATRIBUTO NIVEL NDEF SIS TAM FOR</FONT> </P>
<PRE>01     [0010]          [CRODATINI  ]    [10]    [P]     [  ]    [006]   [N]
02     [0020]          [DIAINI     ]    [10]    [R]     [  ]    [002]   [N]
03     [0030]          [CROHORINI  ]    [10]    [P]     [  ]    [004]   [N]</PRE>
<FONT SIZE=2><P>Neste exemplo, o atributo "DIAINI" redefine o atributo "CRODATINI", tendo em seu conte&uacute;do os dois primeiro caracteres informados para o atributo "CRODATINI".</FONT> </P>
<FONT SIZE=2><P>O atributo de redefini&ccedil;&atilde;o e os redefinidos devem possuir o mesmo n&iacute;vel hier&aacute;rquico (campo NIVEL).</FONT> </P></DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SIS</B> - C&oacute;digo do sistema ao qual o atributo pertence.</FONT> </P>
<FONT SIZE=2><P>Este campo s&oacute; deve ser informado nos seguintes casos:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Se NDEF = "S" e o atributo n&atilde;o pertencer ao mesmo sistema da consist&ecirc;ncia;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Se NDEF = "R" e o atributo j&aacute; estiver cadastrado no reposit&oacute;rio de dados do SADS.</FONT> </P></DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>TAM</B> - Tamanho do atributo.</FONT> </P>
<FONT SIZE=2><P>Este campo deve ser informado apenas para atributos particulares da consist&ecirc;ncia ou quando o atributo, na consist&ecirc;ncia, tiver um tamanho diferente daquele cadastrado em sua defini&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Caso seja informado, o tamanho definido no cadastramento do atributo ser&aacute; desprezado.</FONT> </P>
<FONT SIZE=2><P>Este campo n&atilde;o pode ser informado caso tenha sido parametrizado na tabela SBPM5000 que os atributos/campos n&atilde;o podem ter seus tamanhos redefinidos nas estruturas nas quais s&atilde;o inclu&iacute;dos.</FONT> </P>
<FONT SIZE=2><P>Maiores detalhes a respeito desta parametriza&ccedil;&atilde;o, deve-se consultar a Se&ccedil;&atilde;o V, "Parametriza&ccedil;&otilde;es do SADS", item "Atributo", subitem "Redefini&ccedil;&atilde;o em estruturas". </P>
</FONT><P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>FOR</B> - Formato do atributo.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"A" (Alfab&eacute;tico);</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"D" (Alfanum&eacute;rico);</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"N" (Num&eacute;rico).</FONT> </P></DIR>

<FONT SIZE=2><P>Este campo deve ser informado quando o atributo n&atilde;o estiver cadastrado no reposit&oacute;rio ou quando se deseja alterar, para a consist&ecirc;ncia, o formato de um atributo j&aacute; cadastrado.</FONT> </P>
<FONT SIZE=2><P>Caso seja informado, o formato definido no cadastramento do atributo ser&aacute; desprezado.</FONT> </P>
<FONT SIZE=2><P>Por&eacute;m, este campo n&atilde;o pode ser informado caso tenha sido parametrizado na tabela SBPM5000 que os atributos/campos n&atilde;o podem ter seus formatos redefinidos nas estruturas nas quais s&atilde;o inclu&iacute;dos.</FONT> </P>
<FONT SIZE=2><P>Maiores detalhes a respeito desta parametriza&ccedil;&atilde;o, deve-se consultar a Se&ccedil;&atilde;o V, "Parametriza&ccedil;&otilde;es do SADS", item "Atributo", subitem "Redefini&ccedil;&atilde;o em estruturas". </P>
</FONT><P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>AJU</B> - Tipo de ajuste do atributo.</FONT> </P>
<FONT SIZE=2><P>Este ajuste indicar&aacute; a convers&atilde;o a ser efetuada pela consist&ecirc;ncia no dado informado na tela, antes que o mesmo seja enviado ao programa aplicativo.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"A" - Para que a consist&ecirc;ncia transforme os caracteres min&uacute;sculos em caracteres mai&uacute;sculos. Ajuste v&aacute;lido somente para atributos alfab&eacute;ticos e alfanum&eacute;ricos.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"B" - Para que a consist&ecirc;ncia transforme os caracteres mai&uacute;sculos em caracteres min&uacute;sculos. Ajuste v&aacute;lido somente para atributos alfab&eacute;ticos e alfanum&eacute;ricos.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"I" - Para que a consist&ecirc;ncia preencha com zeros os campos decimais n&atilde;o informados. Caso seja informada a v&iacute;rgula, o que estiver &agrave; direita ser&aacute; considerado decimal. O campo pode ser digitado &agrave; esquerda e ser&aacute; ajustado &agrave; direita, com o preenchimento de zeros &agrave; esquerda. Ajuste v&aacute;lido somente para atributos num&eacute;ricos.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"V" - Para que a consist&ecirc;ncia torne obrigat&oacute;ria a informa&ccedil;&atilde;o de v&iacute;rgula no campo. As casas decimais n&atilde;o s&atilde;o obrigat&oacute;rias. O campo pode ser digitado &agrave; esquerda e ser&aacute; ajustado &agrave; direita, com preenchimento de zeros &agrave; esquerda. Ajuste v&aacute;lido somente para atributos num&eacute;ricos. </P>
</FONT><P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"N" - Para que a consist&ecirc;ncia s&oacute; aceite que sejam informados n&uacute;meros e alinhados &agrave; direita. Ajuste v&aacute;lido somente para atributos num&eacute;ricos.</FONT> </P></DIR>

<FONT SIZE=2><P>Cumpre ressaltar que, para os ajustes que s&atilde;o informados com v&iacute;rgula, deve-se observar que a v&iacute;rgula ocupar&aacute; uma (1) posi&ccedil;&atilde;o na tela. Portanto, atributos definidos no reposit&oacute;rio perder&atilde;o uma (1) posi&ccedil;&atilde;o para a v&iacute;rgula. Caso seja necess&aacute;rio, o tamanho do atributo deve ser acrescido de um (1) nas estruturas de tela e consist&ecirc;ncia ("TAM").</FONT> </P>
<FONT SIZE=2><P>Caso o ajuste n&atilde;o seja informado, o campo num&eacute;rico pode ser digitado &agrave; esquerda e ser&aacute; ajustado &agrave; direita, sendo preenchido com zeros &agrave; esquerda. Neste caso, pode-se informar v&iacute;rgula.</FONT> </P>
<FONT SIZE=2><P>Na consist&ecirc;ncia de uma tela paginada, o resultado dos ajustes somente ser&atilde;o passados para o programa aplicativo caso este tenha sido definido que deseja o resultado do ajuste (campo RETORNO DA CONSISTENCIA(S/N) = "S"). Independentemente desta informa&ccedil;&atilde;o, os atributos ser&atilde;o consistidos normalmente.</FONT> </P>
<FONT SIZE=2><P>Exemplos de ajustes: </P></DIR>
</FONT>
<TABLE BORDER CELLSPACING=1 BORDERCOLOR="#000000" WIDTH=449>
<TR><TD WIDTH="24%" VALIGN="MIDDLE">
<PRE>
Ajuste ("AJU")</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<PRE>
Entrada na tela</PRE></TD>
<TD WIDTH="47%" VALIGN="MIDDLE">
<PRE>
Recebido p/prog.-(Pic 9(3)V99)</PRE></TD>
</TR>
<TR><TD WIDTH="24%" VALIGN="MIDDLE">
<PRE>
" "</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<PRE>
10___</PRE></TD>
<TD WIDTH="47%" VALIGN="MIDDLE">
<PRE>
00010</PRE></TD>
</TR>
<TR><TD WIDTH="24%" VALIGN="MIDDLE">
<PRE>
" "</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<PRE>
1234_</PRE></TD>
<TD WIDTH="47%" VALIGN="MIDDLE">
<PRE>
01234</PRE></TD>
</TR>
<TR><TD WIDTH="24%" VALIGN="MIDDLE">
<PRE>
"I"</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<PRE>
10___</PRE></TD>
<TD WIDTH="47%" VALIGN="MIDDLE">
<PRE>
01000</PRE></TD>
</TR>
<TR><TD WIDTH="24%" VALIGN="MIDDLE">
<PRE>
"I"</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<PRE>
1234_</PRE></TD>
<TD WIDTH="47%" VALIGN="MIDDLE">
<PRE>
ERRO: Mais de 3 inteiros</PRE></TD>
</TR>
<TR><TD WIDTH="24%" VALIGN="MIDDLE">
<PRE>
"V"</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<PRE>
10,</PRE></TD>
<TD WIDTH="47%" VALIGN="MIDDLE">
<PRE>
01000</PRE></TD>
</TR>
<TR><TD WIDTH="24%" VALIGN="MIDDLE">
<PRE>
"V"</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<PRE>
10,1</PRE></TD>
<TD WIDTH="47%" VALIGN="MIDDLE">
<PRE>
01010</PRE></TD>
</TR>
<TR><TD WIDTH="24%" VALIGN="MIDDLE">
<PRE>
"V"</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<PRE>
0,10</PRE></TD>
<TD WIDTH="47%" VALIGN="MIDDLE">
<PRE>
01010</PRE></TD>
</TR>
<TR><TD WIDTH="24%" VALIGN="MIDDLE">
<PRE>
"V"</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<PRE>
1,000</PRE></TD>
<TD WIDTH="47%" VALIGN="MIDDLE">
<PRE>
ERRO: Mais de 2 decimais </PRE></TD>
</TR>
<TR><TD WIDTH="24%" VALIGN="MIDDLE">
<PRE>
"V"</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<PRE>
1</PRE></TD>
<TD WIDTH="47%" VALIGN="MIDDLE">
<PRE>
ERRO: Informar v&iacute;rgula</PRE></TD>
</TR>
<TR><TD WIDTH="24%" VALIGN="MIDDLE">
<PRE>
"N"</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<PRE>
__101</PRE></TD>
<TD WIDTH="47%" VALIGN="MIDDLE">
<PRE>
00101</PRE></TD>
</TR>
<TR><TD WIDTH="24%" VALIGN="MIDDLE">
<PRE>
"N"</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<PRE>
101__</PRE></TD>
<TD WIDTH="47%" VALIGN="MIDDLE">
<PRE>
ERRO: N&atilde;o num&eacute;rico</PRE></TD>
</TR>
<TR><TD WIDTH="24%" VALIGN="MIDDLE">
<PRE>
" "/"I"</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<PRE>
10,1_</PRE></TD>
<TD WIDTH="47%" VALIGN="MIDDLE">
<PRE>
01010</PRE></TD>
</TR>
<TR><TD WIDTH="24%" VALIGN="MIDDLE">
<PRE>
" "/"I"</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<PRE>
12345</PRE></TD>
<TD WIDTH="47%" VALIGN="MIDDLE">
<PRE>
12345</PRE></TD>
</TR>
<TR><TD WIDTH="24%" VALIGN="MIDDLE">
<PRE>
" "/"I"</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<PRE>
1234,</PRE></TD>
<TD WIDTH="47%" VALIGN="MIDDLE">
<PRE>
ERRO: Mais de 3 inteiros</PRE></TD>
</TR>
<TR><TD WIDTH="24%" VALIGN="MIDDLE">
<PRE>
" "/"I"</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<PRE>
10,__</PRE></TD>
<TD WIDTH="47%" VALIGN="MIDDLE">
<PRE>
01000</PRE></TD>
</TR>
<TR><TD WIDTH="24%" VALIGN="MIDDLE">
<PRE>
" "/"I"</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<PRE>
1,234</PRE></TD>
<TD WIDTH="47%" VALIGN="MIDDLE">
<PRE>
ERRO: Mais de 2 decimais</PRE></TD>
</TR>
<TR><TD WIDTH="24%" VALIGN="MIDDLE">
<PRE>
" "/"I"</PRE></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<PRE>
,1___</PRE></TD>
<TD WIDTH="47%" VALIGN="MIDDLE">
<PRE>
00010</PRE></TD>
</TR>
</TABLE>
<DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SIN </B>- Sinal aritm&eacute;tico para um atributo num&eacute;rico.</FONT> </P>
<FONT SIZE=2><P>Pode assumir o seguinte valor: </P><DIR>

</FONT><P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"S" - Neste caso o atributo ser&aacute; sinalizado e poder&aacute; ter os valores "+" ou "-" informado &agrave; esquerda de seu primeiro algarismo. Se o sinal n&atilde;o for informado, o atributo ser&aacute; considerado como positivo.</FONT> </P></DIR>

<FONT SIZE=2><P>Cumpre ressaltar que, para os atributos que s&atilde;o informados com sinal, este ocupar&aacute; uma (1) posi&ccedil;&atilde;o na tela. Portanto, atributos definidos no reposit&oacute;rio perder&atilde;o uma (1) uma posi&ccedil;&atilde;o para o sinal, caso este seja informado. Se necess&aacute;rio, o tamanho do atributo deve ser acrescido de 1 (um) nas estruturas de tela e consist&ecirc;ncia ("TAM").</FONT> </P>
<FONT SIZE=2><P>Caso o campo SIN n&atilde;o seja informado, ser&aacute; assumida a sinaliza&ccedil;&atilde;o definida para o atributo em seu cadastramento.</FONT> </P>
<FONT SIZE=2><P>Caso seja informado, a sinaliza&ccedil;&atilde;o definida no cadastramento do atributo ser&aacute; desprezada.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>DEC</B> - N&uacute;mero de casas decimais de um atributo num&eacute;rico. </P>
<P>Pode assumir os valores de 01 a 23. </P>
<P>Caso o n&uacute;mero de casas decimais n&atilde;o seja informado, ser&aacute; assumido o n&uacute;mero de casas decimais definido para o atributo em seu cadastramento.</FONT> </P>
<FONT SIZE=2><P>Caso seja informado, o n&uacute;mero de casas decimais definido no cadastramento do atributo ser&aacute; desprezado.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>PAD</B> - Teste padr&atilde;o predefinido.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"AMD" (Data) - Para data no formato ano/m&ecirc;s/dia. <BR>
Se o tamanho do atributo for igual a seis, o teste do ano ser&aacute; feito com duas posi&ccedil;&otilde;es, ou seja, o ano poder&aacute; assumir os valores de "00" a "99". Caso seu tamanho seja oito, o teste do ano ser&aacute; feito com quatro posi&ccedil;&otilde;es e, neste caso, o ano poder&aacute; assumir os valores de "0000" a "9999".</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"DMA" (Data) - Para data no formato dia/m&ecirc;s/ano. <BR>
Se o tamanho do atributo for igual a seis, o teste do ano ser&aacute; feito com duas posi&ccedil;&otilde;es, ou seja, o ano poder&aacute; assumir os valores de "00" a "99". Caso seu tamanho seja oito, o teste do ano ser&aacute; feito com quatro posi&ccedil;&otilde;es e, neste caso, o ano poder&aacute; assumir os valores de "0000" a "9999".</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"INV" (Data) - Para data no formato dia/m&ecirc;s/ano com invers&atilde;o para ano/m&ecirc;s/dia.<BR>
Se o tamanho do atributo for igual a seis, o teste do ano ser&aacute; feito com duas posi&ccedil;&otilde;es, ou seja, o ano poder&aacute; assumir os valores de "00" a "99". Caso seu tamanho seja oito, o teste do ano ser&aacute; feito com quatro posi&ccedil;&otilde;es e, neste caso, o ano poder&aacute; assumir os valores de "0000" a "9999".</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"D/M" (Data) - Para data no formato dia/m&ecirc;s.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"M/D" (Data) - Para data no formato m&ecirc;s/dia.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"M/A" (Data) - Para data no formato m&ecirc;s/ano. <BR>
Se o tamanho do atributo for igual a quatro, o teste do ano ser&aacute; feito com duas posi&ccedil;&otilde;es, ou seja, o ano poder&aacute; assumir os valores de "00" a "99". Caso seu tamanho seja seis, o teste do ano ser&aacute; feito com quatro posi&ccedil;&otilde;es e, neste caso, o ano poder&aacute; assumir os valores de "0000" a "9999".</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"A/M" (Data) - Para data no formato ano/m&ecirc;s. <BR>
Se o tamanho do atributo for igual a quatro, o teste do ano ser&aacute; feito com duas posi&ccedil;&otilde;es, ou seja, o ano poder&aacute; assumir os valores de "00" a "99". Caso seu tamanho seja seis, o teste do ano ser&aacute; feito com quatro posi&ccedil;&otilde;es, e neste caso o ano poder&aacute; assumir os valores de "0000" a "9999".</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"C10" (Calc.10) - Para c&aacute;lculo de d&iacute;gito m&oacute;dulo 10.<BR>
A consist&ecirc;ncia ir&aacute; calcular o d&iacute;gito verificador do atributo no padr&atilde;o M&Oacute;DULO 10 e ir&aacute; coloc&aacute;-lo na posi&ccedil;&atilde;o mais &agrave; direita. A posi&ccedil;&atilde;o correspondente ao d&iacute;gito deve ser preenchida com zero. Ap&oacute;s o c&aacute;lculo, a consist&ecirc;ncia retornar&aacute; para o aplicativo o atributo com o d&iacute;gito calculado. </P>
<P>Cumpre lembrar que este teste padr&atilde;o n&atilde;o pode ser definido no momento do cadastramento do atributo.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"C11" (Calc.11) - Para c&aacute;lculo de d&iacute;gito m&oacute;dulo 11.<BR>
A consist&ecirc;ncia ir&aacute; calcular o d&iacute;gito verificador do atributo no padr&atilde;o M&Oacute;DULO 11 e ir&aacute; coloc&aacute;-lo na posi&ccedil;&atilde;o mais &agrave; direita. A posi&ccedil;&atilde;o correspondente ao d&iacute;gito deve ser preenchida com zero. Ap&oacute;s o c&aacute;lculo, a consist&ecirc;ncia retornar&aacute; para o aplicativo o atributo com o d&iacute;gito calculado.</FONT> </P>
<FONT SIZE=2><P>Cumpre lembrar que este teste padr&atilde;o n&atilde;o pode ser definido no momento do cadastramento do atributo.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"CPF" (CPF) - Para CPF.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"CGC" (CGC) - Para CGC, abrangendo CPF.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"EST" (Esta&ccedil;&atilde;o) - Para teste de esta&ccedil;&atilde;o v&aacute;lida na rede.</FONT> </P>
<FONT SIZE=2><P>Antes de efetuar a valida&ccedil;&atilde;o de um c&oacute;digo de impressora na rede, &eacute; verificado se tal c&oacute;digo est&aacute; cadastrado na tabela SBPM5024 - Tabela de Impressoras em outra m&aacute;quina. Caso positivo, tal c&oacute;digo &eacute; aceito como v&aacute;lido. </P>
<P>Este teste tamb&eacute;m efetua corretamente a valida&ccedil;&atilde;o de impressoras ligadas ao sistema atrav&eacute;s de linhas que utilizam o protocolo TCP/IP.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"HOR" (Hora) - Para hora.<BR>
Se o tamanho do atributo for igual a quatro, ser&aacute; consistido horas e minutos e se o tamanho for igual a seis ser&aacute; consistido horas, minutos e segundos.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"ICG" (CGC) - Para CGC, n&atilde;o abrangendo CPF.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"M10" (M&oacute;d. 10) - Para teste de d&iacute;gito usando m&oacute;dulo 10.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"M11" (M&oacute;d. 11) - Para teste de d&iacute;gito usando m&oacute;dulo 11.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"S/N" - ("S" ou "N") - Para teste de resposta "S" (sim) ou "N" (n&atilde;o).</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"NEZ" (<I>Not equal zero</I>) - Para teste de atributo num&eacute;rico diferente de zero.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"PPO" (Primeira posi&ccedil;&atilde;o obrigat&oacute;ria) - Para teste do preenchimento da primeira posi&ccedil;&atilde;o do atributo alfab&eacute;tico ou alfanum&eacute;rico em branco.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"BRA" (Exist&ecirc;ncia de v&aacute;rios brancos entre palavras) - Para teste do preenchimento de mais do que um espa&ccedil;o em branco entre as palavras informadas em um campo alfab&eacute;tico ou alfanum&eacute;rico.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"RPT" (Reprints) - Para teste de impressora ou grupo de impressoras v&aacute;lidas, quando o <I>Reprints</I> for utilizado.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"SEX" (Sexo) - Para valida&ccedil;&atilde;o de atributo alfab&eacute;tico ou alfanum&eacute;rico com informa&ccedil;&atilde;o de sexo. Ser&aacute; verificado se o atributo foi preenchido com um dos seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"M" - Masculino;</P>
</FONT><P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"F" - Feminino.</FONT> </P></DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"CIV" (Estado civil) - Para valida&ccedil;&atilde;o de atributo alfab&eacute;tico ou alfanum&eacute;rico com informa&ccedil;&atilde;o de estado civil. Ser&aacute; verificado se o atributo foi preenchido com um dos seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"S" - Solteiro</P>
</FONT><P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"C" - Casado;</P>
</FONT><P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"V" - Vi&uacute;vo;</P>
</FONT><P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"D" - Divorciado; ou</P>
</FONT><P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"O" - Outros. </P></DIR>

<P>Os testes de consist&ecirc;ncia de data, opcionalmente, aceitam que uma data seja totalmente preenchida com o algarismo 9. </P>
<P>Para fazer op&ccedil;&atilde;o por este modo de funcionamento, o campo "DATA C/ 9's", da tabela SBPM5004, deve ser preenchido com "S", para um sistema espec&iacute;fico ou para o sistema "SBC" quando se desejar configurar para todos os sistemas da instala&ccedil;&atilde;o.</P>
<P>Ap&oacute;s isto, deve-se liberar as consist&ecirc;ncias das telas, tabelas e jobs, a fim de que eles passem a aceitar a nova forma de preenchimento.</P>
<P>Maiores detalhes sobre esta parametriza&ccedil;&atilde;o podem ser pesquisadas neste Manual de Refer&ecirc;ncia do SADS, na Se&ccedil;&atilde;o V, "Parametriza&ccedil;&otilde;es do SADS", item "Consist&ecirc;ncia", t&oacute;pico "Datas preenchidas com noves (999999)". </P></DIR>

<P>Se o atributo possuir teste padr&atilde;o "M10", "M11", "C10", "C11", "CPF" ou "CGC", seu tamanho n&atilde;o poder&aacute; ser superior a 23 posi&ccedil;&otilde;es.</FONT> </P>
<FONT SIZE=2><P>Maiores informa&ccedil;&otilde;es sobre os algoritmos utilizados nos padr&otilde;es "M10","M11","C10" e "C11", encontram-se descritos no t&oacute;pico "Interface com aplicativos", neste item.</FONT> </P>
<FONT SIZE=2><P>Se o atributo possuir teste padr&atilde;o "SEX", "CIV" ou "S/N", seu tamanho dever&aacute; ser igual a uma posi&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Para consist&ecirc;ncia de tela paginada, o resultado dos testes "INV", "C10" e "C11" s&oacute; ser&atilde;o passados para o programa aplicativo caso este tenha sido definido para retornar dados tratados pela consist&ecirc;ncia - campo RETORNO DA CONSISTENCIA = "S", na defini&ccedil;&atilde;o da l&oacute;gica de processamento do programa.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPC</B> - Identificador de opcionalidade de preenchimento do atributo no momento da entrada de dados na tela ou tabela.</FONT> </P>
<FONT SIZE=2><P>Pode assumir o seguinte valor:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"S" - Para preenchimento opcional do atributo.</FONT> </P></DIR>

<FONT SIZE=2><P>Caso este campo n&atilde;o seja informado, ser&aacute; assumida a obrigatoriedade do preenchimento do atributo.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OCCURS</B> - Quantidade de ocorr&ecirc;ncias do atributo na estrutura.<BR>
S&oacute; podem ser informados valores no campo OCCURS para itens grupo.</FONT> </P>
<FONT SIZE=2><P>Itens grupo s&atilde;o atributos que se subdividem em outros atributos, cujos n&iacute;veis hier&aacute;rquicos (campo NDEF) s&atilde;o inferiores ao seu. Por exemplo, NDEF = 15 &eacute; inferior ao NDEF = 10.</FONT> </P>
<FONT SIZE=2><P>Dentro de um atributo com ocorr&ecirc;ncias s&oacute; poder&aacute; ser definido mais um atributo com ocorr&ecirc;ncias, ou seja, somente podem ser cadastradas tabelas bidimensionais. Entretanto, dentro de um atributo com ocorr&ecirc;ncias, n&atilde;o poder&aacute; ser definido um outro item grupo. </P>
<P>N&atilde;o &eacute; permitido teste em n&iacute;vel de estrutura de consist&ecirc;ncia para atributo definido com OCCURS na estrutura da mesma.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPERACAO</B> - Opera&ccedil;&atilde;o que est&aacute; sendo efetuada na estrutura da consist&ecirc;ncia.<BR>
Este campo vir&aacute; preenchido com a opera&ccedil;&atilde;o informada no menu e pode assumir os seguintes valores: </P><DIR>

</FONT><P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"I" - Inclus&atilde;o;</P>
</FONT><P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"A - Altera&ccedil;&atilde;o;</P>
</FONT><P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"E - Exclus&atilde;o; </P>
</FONT><P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"C - Consulta.</FONT> </P></DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>PROXIMA TRANSACAO (S/N)</B> - Indicador de encadeamento de transa&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores: </P><DIR>

</FONT><P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"S" - Ser&aacute; atualizada a estrutura e ser&aacute; encadeada a tela de "Valida&ccedil;&atilde;o em n&iacute;vel de estrutura da consist&ecirc;ncia".<BR>
Neste caso &eacute; necess&aacute;rio transmitir a tela de valida&ccedil;&atilde;o em n&iacute;vel de estrutura, mesmo que n&atilde;o seja desej&aacute;vel efetuar alguma altera&ccedil;&atilde;o. Caso a tela de valida&ccedil;&atilde;o n&atilde;o seja transmitida, n&atilde;o ser&aacute; poss&iacute;vel liberar a consist&ecirc;ncia para testes.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"N" - N&atilde;o ser&aacute; encadeada a tela de "Valida&ccedil;&atilde;o em n&iacute;vel de estrutura da consist&ecirc;ncia".<BR>
Se "CONTINUA" for igual a "N", ser&aacute; retornado ao menu e se "CONTINUA" for igual a "S" ser&aacute; apresentada a p&aacute;gina informada em "PROXIMA PAG." e a estrutura da consist&ecirc;ncia n&atilde;o ser&aacute; atualizada.</FONT> </P></DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>CONTINUA(S/N)</B> - Indicador de continua&ccedil;&atilde;o da opera&ccedil;&atilde;o sobre a estrutura da consist&ecirc;ncia.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores: </P><DIR>

</FONT><P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"S" - Para prosseguir a opera&ccedil;&atilde;o sobre a estrutura da consist&ecirc;ncia.<BR>
A pr&oacute;xima p&aacute;gina a ser exibida ser&aacute; a indicada no campo "PROXIMA PAG.". </P>
</FONT><P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"N" - Para encerrar a opera&ccedil;&atilde;o sobre a estrutura da consist&ecirc;ncia.</FONT> </P>
<FONT SIZE=2><P>Para "CONTINUA" igual a "N" o conte&uacute;do de "PROXIMA PAG." deve ser "99". </P></DIR>

</FONT><P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>PROXIMA PAG</B>. - Sequ&ecirc;ncia da p&aacute;gina que ser&aacute; exibida ao se transmitir a p&aacute;gina corrente.</FONT> </P>
<FONT SIZE=2><P>Pode variar de 01 a 50. </P>
<P>Para terminar a opera&ccedil;&atilde;o sobre a estrutura da consist&ecirc;ncia, deve-se informar "99". </P></DIR>

</FONT><B><FONT SIZE=5><P><A NAME="Cadtes">Cadastramento de testes de valida&ccedil;&atilde;o em n&iacute;vel de estrutura</A></B></FONT> </P>
<FONT SIZE=2><P>Cadastrar valida&ccedil;&otilde;es em n&iacute;vel de estrutura de consist&ecirc;ncia significa cadastrar os testes que devem ser efetuados para valida&ccedil;&atilde;o das entradas de dados especificamente para a consist&ecirc;ncia que est&aacute; sendo definida.</FONT> </P>
<FONT SIZE=2><P>A utiliza&ccedil;&atilde;o efetiva dos testes em n&iacute;vel de estrutura da consist&ecirc;ncia elimina a necessidade de codific&aacute;-los internamente aos programas chamados, o que permite maior flexibilidade e agilidade no desenvolvimento e manuten&ccedil;&atilde;o dos sistemas aplicativos.</FONT> </P>
<FONT SIZE=2><P>A consist&ecirc;ncia herda as informa&ccedil;&otilde;es dos atributos cadastradas no reposit&oacute;rio como: tamanho, formato, casas decimais, sinal, valor <I>default</I>, testes padr&otilde;es, teste contra sub-rotina espec&iacute;fica, teste contra tabela e validades pr&eacute;-definidas. Portanto n&atilde;o &eacute; necess&aacute;rio recadastrar estas informa&ccedil;&otilde;es ou testes especificamente para a consist&ecirc;ncia, caso o atributo j&aacute; os possuam cadastrados no RD.</FONT> </P>
<FONT SIZE=2><P>Por&eacute;m, caso necess&aacute;rio, &eacute; permitido que algumas dessas informa&ccedil;&otilde;es possam ser alteradas, tais como tamanho, formato, casas decimais, sinal, valor <I>default</I> e teste padr&atilde;o, desde que n&atilde;o gere testes incoerentes com os j&aacute; cadastrados. Por exemplo: um atributo com formato num&eacute;rico que possui validades definidas, n&atilde;o deve ter seu formato alterado para alfab&eacute;tico na estrutura da consist&ecirc;ncia.</FONT> </P>
<FONT SIZE=2><P>Testes espec&iacute;ficos para um atributo podem ser inclu&iacute;dos, e n&atilde;o somente alterados, para atender a uma determinada consist&ecirc;ncia.</FONT> </P>
<FONT SIZE=2><P>Alguns testes definidos no atributo n&atilde;o podem ser inibidos, tais como: teste contra uma tabela, teste contra uma sub-rotina espec&iacute;fica e teste padr&atilde;o. Isto significa dizer que, independente dos testes cadastrados em n&iacute;vel de estrutura, se algum destes testes acima citados tiver sido cadastrado na defini&ccedil;&atilde;o de algum atributo da consist&ecirc;ncia, ele ser&aacute; efetuado.</FONT> </P>
<FONT SIZE=2><P>Se um atributo "x" possui outro atributo "y" como sin&ocirc;nimo ou possui dom&iacute;nio "z", as informa&ccedil;&otilde;es de "y" e "z" ser&atilde;o herdadas pelas consist&ecirc;ncias que possuem o atributo "x" em sua estrutura.</FONT> </P>
<FONT SIZE=2><P>Os testes oferecidos pelo SADS para serem utilizados na valida&ccedil;&atilde;o dos dados de entrada, s&atilde;o os seguintes:</FONT> </P><DIR>
<DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de atributo contra constante;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de atributo contra outro atributo;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de atributo contra tabela;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de atributo contra sub-rotina da aplica&ccedil;&atilde;o;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de atributo contra empresa, estabelecimento ou unidade do<I> logon</I>;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de atributo contra n&uacute;mero ou n&iacute;vel de acesso do usu&aacute;rio "logado";</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de atributo contra a seguran&ccedil;a de acesso aos dados (elementos habilitados);</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de atributo contra dia, m&ecirc;s, ano, data completa ou hora do sistema;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de atributo contra duplicidade;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de atributo contra desigualdade;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de atributo contra acumulador;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Teste de acumulador contra constante;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Opera&ccedil;&otilde;es aritm&eacute;ticas entre atributo e acumulador;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Incrementa&ccedil;&atilde;o de acumulador a cada ocorr&ecirc;ncia de atributo;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Movimenta&ccedil;&atilde;o de valor <I>default</I> de atributo;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Defini&ccedil;&atilde;o de grupo opcional;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Testes condicionais entre atributos.</FONT> </P></DIR>
</DIR>

<FONT SIZE=2><P>Para cadastrar os testes de valida&ccedil;&atilde;o em n&iacute;vel de estrutura, &eacute; necess&aacute;rio que a estrutura da consist&ecirc;ncia esteja cadastrada no reposit&oacute;rio de dados do SADS e que os atributos referenciados nos testes perten&ccedil;am &agrave; sua estrutura.</FONT> </P>
<B><FONT SIZE=2><P>CAMPOS DA TELA</B></FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>CONSISTENCIA</B> - C&oacute;digo da consist&ecirc;ncia no padr&atilde;o SADS (sssCnnnn ou sssQxxxx).</FONT> </P>
<P>Os testes para as valida&ccedil;&otilde;es da estrutura da consist&ecirc;ncia devem ser informados nos campos de ocorr&ecirc;ncia - grupos que ocorrem v&aacute;rias vezes na tela -, descritos a seguir: </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SEQ</B> - N&uacute;mero sequencial para posicionamento do teste.</FONT> </P>
<FONT SIZE=2><P>Este campo j&aacute; vem informado, sendo o primeiro n&uacute;mero igual a 10 e os demais, acrescidos de 10.</FONT> </P>
<FONT SIZE=2><P>Para incluir um teste entre dois outros j&aacute; existentes, este teste deve ser inclu&iacute;do em uma linha que esteja em branco e seu n&uacute;mero sequencial deve ser alterado para um n&uacute;mero entre os j&aacute; existentes. O SADS reorganizar&aacute; automaticamente a estrutura. Na pr&oacute;xima opera&ccedil;&atilde;o, os testes j&aacute; ser&atilde;o apresentados na ordem devida.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SE/EN</B> - Indicador de condi&ccedil;&otilde;es SE/ENTAO.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"SE" - Para discriminar os testes condicionais para realiza&ccedil;&atilde;o dos testes da cl&aacute;usula ENTAO;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"EN" (Ent&atilde;o) - Para discriminar os testes a serem realizados caso as condi&ccedil;&otilde;es da cl&aacute;usula SE sejam satisfeitas.</FONT> </P></DIR>

<FONT SIZE=2><P>A condi&ccedil;&atilde;o para realiza&ccedil;&atilde;o dos testes da cl&aacute;usula ENTAO ("EN") pode ser definida atrav&eacute;s de uma ou mais sequ&ecirc;ncias de testes, limitados a 99, onde cada um deles pode se referir a um operando diferente.</FONT> </P>
<FONT SIZE=2><P>Se os testes da cl&aacute;usula "SE" estiverem relacionados ao mesmo atributo, s&oacute; se deve inform&aacute;-lo ("TIP1" e "OPERANDO1") na primeira sequ&ecirc;ncia destes testes. Desta forma, estes campos s&oacute; devem ser informados nas demais sequ&ecirc;ncias dos testes caso se refiram a atributos diferentes.</FONT> </P>
<FONT SIZE=2><P>O indicador de teste condicional SE s&oacute; aparece na primeira sequ&ecirc;ncia dos testes, conforme o exemplo a seguir: </P>
</FONT><PRE>
SEQ SE/EN E/O FUN TIP1 OPERANDO1 SUF1 OPE TIP2 OPER2   SUF2ERRO
010  SE             C  ARTCOD          GE  K  00000001     017 
020                 C  ARTQTD          LE  K  00000005
030  EN             C  LOJCOD          EQ  C  SHOCOD</PRE>
<FONT SIZE=2><P>Neste exemplo, a condi&ccedil;&atilde;o para realiza&ccedil;&atilde;o do teste da cl&aacute;usula EN, teste de sequ&ecirc;ncia 30, &eacute; composta pelos testes cadastrados nas sequ&ecirc;ncias 10 e 20, sendo que seus dois operandos ("OPERANDO1"), que s&atilde;o dois atributos diferentes - "ARTCOD" e "ARTQTD" -, est&atilde;o sendo testados contra duas constantes.</FONT> </P>
<FONT SIZE=2><P>O c&oacute;digo da mensagem de erro deve ser cadastrado na sequ&ecirc;ncia do teste relativa a qual atributo se queira emitir tal mensagem de erro. Ou seja, a mensagem de erro se refere ao OPERANDO1 cadastrado na sequ&ecirc;ncia onde o c&oacute;digo de erro foi cadastrado. Este c&oacute;digo da mensagem de erro pode ser informado para o atributo com teste na cl&aacute;usula SE, ou para o atributo com teste na cl&aacute;usula EN, ou para todos os atributos com teste na cl&aacute;usula EN.</FONT> </P>
<FONT SIZE=2><P>A cl&aacute;usula SE deve estar sempre relacionada a uma, e somente uma, cl&aacute;usula EN (e vice-versa), que deve ser informada em alguma sequ&ecirc;ncia posterior.</FONT> </P>
<FONT SIZE=2><P>Para os casos em que as condi&ccedil;&otilde;es da cl&aacute;usula SE sejam verdadeiras, podem ser definidos, a fim de que sejam realizados, um ou mais testes pertencentes &agrave; cl&aacute;usula EN, limitados a 99, onde cada um deles pode se referir a um operando diferente, conforme exemplo:</FONT> </P>
<PRE>
SEQ SE/EN E/O FUN TIP1 OPERANDO1 SUF1 OPE TIP2 OPER2    SUF2ERRO
010  SE                ARTCOD          GE  K   00000001     017 
020        E                           LE  K   00000005 
030  EN                ARTQTD          GE  K   00000100
040        E           LOJCOD          EQ  K   00000010
050        O                           EQ  C   SHOCOD</PRE>
<FONT SIZE=2><P>Neste exemplo, os testes a serem realizados caso as condi&ccedil;&otilde;es definidas na cl&aacute;usula SE sejam verdadeiras est&atilde;o cadastrados nas sequ&ecirc;ncias 30, 40 e 50, sendo que seus tr&ecirc;s "OPERANDO2", que s&atilde;o duas constantes e um atributo, referem-se aos atributos "ARTQTD" e "LOJCOD".</FONT> </P>
<FONT SIZE=2><P>N&atilde;o existem limites para os testes SE/ENTAO a serem realizados, sendo tamb&eacute;m que podem se referir a diferentes atributos.</FONT> </P>
<FONT SIZE=2><P>O indicador "EN" s&oacute; deve aparecer na primeira sequ&ecirc;ncia dos testes.</FONT> </P>
<FONT SIZE=2><P>A cl&aacute;usula "EN" deve estar sempre relacionada a uma, e somente uma, cl&aacute;usula SE (e vice-versa), que deve ter sido informada em alguma sequ&ecirc;ncia anterior.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>E/O </B>- Operador l&oacute;gico.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"E" - Para conex&otilde;es do tipo "E" ("AND");</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"O" - Para conex&otilde;es do tipo "OU" ("OR").</FONT> </P></DIR>

<FONT SIZE=2><P>O operador l&oacute;gico s&oacute; deve ser informado a partir da segunda sequ&ecirc;ncia de testes a serem concatenados, pertencentes ou n&atilde;o &agrave; cl&aacute;usula SE/ENTAO.</FONT> </P>
<FONT SIZE=2><P>Quando a conec&ccedil;&atilde;o &eacute; estabelecida entre dois testes referentes ao mesmo atributo informado em "OPERANDO1", n&atilde;o &eacute; necess&aacute;rio inform&aacute;-lo novamente a partir do segundo teste. Basta cadastrar o teste desejado.</FONT> </P>
<FONT SIZE=2><P>A conec&ccedil;&atilde;o com operadores l&oacute;gicos entre testes referentes a diferentes atributos s&oacute; &eacute; permitida dentro dos testes condicionais "SE/ENTAO".</FONT> </P>
<FONT SIZE=2><P>Na figura 6, sequ&ecirc;ncias 30 e 40, s&atilde;o estabelecidos, atrav&eacute;s do operador l&oacute;gico "O", os valores do atributo "ELECODRESU" para os quais o atributo "ELECODDIF" deve assumir um valor espec&iacute;fico dentro de um intervalo, determinado atrav&eacute;s do operador l&oacute;gico "E" nas sequ&ecirc;ncias 50 e 60.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>FUN</B> - Fun&ccedil;&atilde;o a ser executada em um determinado teste.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"ACM" - Teste de acumulador.</FONT> </P>
<FONT SIZE=2><P>Esta fun&ccedil;&atilde;o consiste em acumular os valores informados para um determinado atributo em um acumulador.</FONT> </P>
<FONT SIZE=2><P>As opera&ccedil;&otilde;es permitidas com acumuladores s&atilde;o: adicionar, subtrair, dividir, multiplicar e incrementar o acumulador a cada ocorr&ecirc;ncia informada de um atributo da tela. Para isto o campo OPE dever&aacute; ter os seguintes valores, respectivamente: "+", "-", "/", "*" ou "#".</FONT> </P>
<FONT SIZE=2><P>Para utilizar a fun&ccedil;&atilde;o "ACM", os seguintes campos devem ser informados: "ACM" em FUN, "C" em TIP1, atributo da tela em OPERANDO1, operador aritm&eacute;tico em OPE, "A" em TIP2 e um acumulador em OPERANDO2.</FONT> </P>
<FONT SIZE=2><P>A fun&ccedil;&atilde;o "ACM" n&atilde;o pode ser concatenada com outros testes.</FONT> </P>
<FONT SIZE=2><P>Na figura 6, sequ&ecirc;ncias 110 e 120, &eacute; feito um teste de fechamento de total de um atributo que ocorre quatro vezes contra um outro atributo. Na sequ&ecirc;ncia 110, &agrave; cada ocorr&ecirc;ncia do atributo "TOTPROD", seu conte&uacute;do &eacute; somado ao acumulador "1". Na sequ&ecirc;ncia 120, o conte&uacute;do do atributo "TOTVENDA" &eacute; comparado ao acumulador "1". Se ambos n&atilde;o forem iguais, ser&aacute; enviada uma mensagem de erro - erro 020. </P>
<P>Na figura 7, sequ&ecirc;ncias 130 a 150, &eacute; testado se pelo menos uma ocorr&ecirc;ncia do atributo "CODPROD" foi informada. &Agrave; cada ocorr&ecirc;ncia preenchida do atributo "CODPROD", &eacute; somado uma unidade ao acumulador "2". Nas sequ&ecirc;ncias 140 e 150 &eacute; feito o teste para verificar o valor do acumulador. Neste teste foi utilizada a fun&ccedil;&atilde;o "MSG", pois, como ele &eacute; referente a um acumulador, &eacute; necess&aacute;rio indicar para qual atributo dever&aacute; ser enviada a mensagem de erro.</FONT> </P>
<FONT SIZE=2><P>Na figura 8, sequ&ecirc;ncias 310 e 320, &eacute; feito um teste para verificar quantas vezes o atributo "TIPVENDA" foi informado. Na sequ&ecirc;ncia 310, &agrave; cada ocorr&ecirc;ncia do atributo "TIPVENDA", &eacute; somada uma unidade no acumulador "3". Na sequ&ecirc;ncia 320, o conte&uacute;do do atributo "QTDOCCTIPV" tem de ser igual ao n&uacute;mero de ocorr&ecirc;ncias de "TIPVENDA". Caso contr&aacute;rio, ser&aacute; enviada a mensagem de erro "020".</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"DSI" - Desigualdade.</FONT> </P>
<FONT SIZE=2><P>Esta fun&ccedil;&atilde;o tem o objetivo de verificar se todos os valores informados para um atributo que ocorre mais de uma vez s&atilde;o iguais. Caso n&atilde;o sejam, ser&aacute; apresentada a mensagem de erro.</FONT> </P>
<FONT SIZE=2><P>Esta fun&ccedil;&atilde;o &eacute; inversa &agrave; fun&ccedil;&atilde;o "DUP". </P>
<P>Para utilizar a fun&ccedil;&atilde;o "DSI", os seguintes campos devem ser informados: "DSI" em FUN e o atributo a ser testado em OPERANDO1. O campo ERRO &eacute; opcional; se n&atilde;o informado assumir&aacute; o valor "026" ("em desigualdade"). </P>
<P>Na figura 7, sequ&ecirc;ncia 160, os valores informados para o atributo "TIPVENDA" tem de ser igual em todas as ocorr&ecirc;ncias.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"DUP" - Duplicidade.</FONT> </P>
<FONT SIZE=2><P>O teste de duplicidade tem o objetivo de verificar se todos os valores de um atributo que ocorre mais de uma vez s&atilde;o diferentes. Caso n&atilde;o sejam, haver&aacute; um erro.</FONT> </P>
<FONT SIZE=2><P>Esta fun&ccedil;&atilde;o &eacute; inversa &agrave; fun&ccedil;&atilde;o "DSI". </P>
<P>Para utilizar a fun&ccedil;&atilde;o "DUP", os seguintes campos devem ser informados: "DUP" em FUN e o atributo a ser testado em OPERANDO1. O campo ERRO &eacute; opcional; se n&atilde;o informado assumir&aacute; o valor "009" ("em duplicata"). </P>
<P>Na figura 7, sequ&ecirc;ncia 170, os valores informados para o atributo "CODPROD" tem de ser diferente em todas as ocorr&ecirc;ncias.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"GOP" - Grupo opcional.</FONT> </P>
<FONT SIZE=2><P>Esta fun&ccedil;&atilde;o determina o intervalo de atributos que comp&otilde;em um grupo opcional. Ao determinar um atributo inicial e um atributo final, ambos pertencentes &agrave; estrutura da consist&ecirc;ncia, &eacute; definido um intervalo de atributos que se relacionam da seguinte forma: se nenhum deles for informado, n&atilde;o ser&aacute; executado nenhum teste de consist&ecirc;ncia para todos os atributos pertencentes ao grupo; se algum for informado, todos os demais ser&atilde;o consistidos normalmente.</FONT> </P>
<FONT SIZE=2><P>O atributo inicial e final dever&atilde;o ter o mesmo n&iacute;vel hier&aacute;rquico ("NIV") na estrutura da consist&ecirc;ncia e, no caso de serem itens elementares, dever&atilde;o pertencer ao mesmo item grupo.</FONT> </P>
<FONT SIZE=2><P>Pode ser definido um outro grupo opcional internamente a um grupo opcional, onde tamb&eacute;m ser&aacute; utilizado o teste de "GOP". </P>
<P>Para utilizar a fun&ccedil;&atilde;o "GOP", os seguintes campos devem ser informados: "GOP" em FUN, atributo inicial do grupo opcional em OPERANDO1 e atributo final do grupo opcional em OPERANDO2. </P>
<P>Na figura 7, sequ&ecirc;ncia 180, o grupo tem in&iacute;cio no atributo "CODPROD" e t&eacute;rmino no atributo "TOTPROD". Isto significa que, caso "CODPROD" e/ou "QTDPROD" e/ou "PRCPROD" e/ou "TOTPROD" forem informados, todos os demais atributos ser&atilde;o consistidos normalmente.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"MSG" - Envio de mensagem de erro.</FONT> </P>
<FONT SIZE=2><P>Esta fun&ccedil;&atilde;o &eacute; utilizada para envio de mensagem de erro referente a um atributo. </P>
<P>Esta fun&ccedil;&atilde;o deve ser cadastrada dentro de um teste condicional (SE/EN) com o objetivo de indicar o atributo para o qual deve ser enviada a mensagem de erro, caso a condi&ccedil;&atilde;o definida (SE ...) n&atilde;o seja satisfeita.</FONT> </P>
<FONT SIZE=2><P>Para utilizar a fun&ccedil;&atilde;o "MSG", os seguintes campos devem ser informados: "EN" em SE/EN, "MSG" em FUN, "C" em TIP1, atributo para o qual se deseja enviar a mensagem de erro em OPERANDO1 e c&oacute;digo da mensagem de erro em ERRO.</FONT> </P>
<FONT SIZE=2><P>Na figura 7, sequ&ecirc;ncia 130, &agrave; cada ocorr&ecirc;ncia informada do atributo "CODPROD" &eacute; acrescido 1 ao acumulador "2". Nas sequ&ecirc;ncias 140 e 150, se o acumulador "2" contiver um valor igual a "0" (nenhuma ocorr&ecirc;ncia de "CODPROD" foi informada) ent&atilde;o ser&aacute; enviada uma mensagem de erro (campo ERRO = "001" - NAO INFORMADA) junto ao atributo "CODPROD". </P>
</FONT><P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"SEG" - Seguran&ccedil;a em n&iacute;vel de elemento</FONT> </P>
<FONT SIZE=2><P>Esta fun&ccedil;&atilde;o &eacute; encarregada por verificar se o usu&aacute;rio que disparou a consist&ecirc;ncia est&aacute; habilitado a trabalhar com o valor informado em um determinado atributo. </P>
<P>Este valor &eacute; consistido, em n&iacute;vel de elemento, pelo Sistema de Seguran&ccedil;a do SADS. Por isso, os usu&aacute;rios do aplicativo devem estar devidamente habilitados, no Sistema de Seguran&ccedil;a, a trabalhar com o elemento especificado.</FONT> </P>
<FONT SIZE=2><P>Pode ser definida uma parametriza&ccedil;&atilde;o na tabela SBPM5000, a fim de que somente os usu&aacute;rios autorizados com "S" na lista de elementos "MENUSEG" do cadastro de seguran&ccedil;a, possam excluir um teste "SEG" ou "SGA" j&aacute; cadastrado ou excluir um atributo que possua algum destes testes. Detalhes sobre esta parametriza&ccedil;&atilde;o est&atilde;o descritos na Se&ccedil;&atilde;o V, "Parametriza&ccedil;&otilde;es do SADS", neste manual.</FONT> </P>
<FONT SIZE=2><P>Para utilizar a fun&ccedil;&atilde;o "SEG", os seguintes campos devem ser informados: "SEG" em FUN, atributo a ser validado em OPERANDO1 e, opcionalmente, o aplicativo ou lista de elementos para o qual deve ser feita a valida&ccedil;&atilde;o no Sistema de Seguran&ccedil;a em OPERANDO2. Caso este n&atilde;o seja informado, ser&aacute; assumido, para o aplicativo, o c&oacute;digo da transa&ccedil;&atilde;o referente &agrave; consist&ecirc;ncia, como mostrado a seguir:</FONT> </P><DIR>

<P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>C&oacute;digo da consist&ecirc;ncia: sssCnnnn</FONT> </P>
<P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>C&oacute;digo do aplicativo: sssnnnn</FONT> </P></DIR>

<FONT SIZE=2><P>Na figura 7, sequ&ecirc;ncia 190, o conte&uacute;do do atributo "SISCOD" ser&aacute; verificado pelo Sistema de Seguran&ccedil;a em n&iacute;vel de elemento. Se n&atilde;o for permitido ao usu&aacute;rio trabalhar com o valor por ele informado no atributo "SISCOD", ser&aacute; enviada uma mensagem de erro.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"SGA" - Seguran&ccedil;a para atualiza&ccedil;&atilde;o em n&iacute;vel de elemento</FONT> </P>
<FONT SIZE=2><P>Esta fun&ccedil;&atilde;o &eacute; encarregada por verificar se o usu&aacute;rio que disparou a consist&ecirc;ncia est&aacute; habilitado a atualizar um determinado valor do atributo. </P>
<P>O valor &eacute; consistido, em n&iacute;vel de elemento, pelo Sistema de Seguran&ccedil;a do SADS. Por isso, os usu&aacute;rios do aplicativo devem estar devidamente habilitados, no Sistema de Seguran&ccedil;a, a atualizar o elemento especificado (HAB = 2).</FONT> </P>
<FONT SIZE=2><P>Pode ser definida uma parametriza&ccedil;&atilde;o na tabela SBPM5000, a fim de que somente os usu&aacute;rios autorizados com "S" na lista de elementos "MENUSEG" do cadastro de seguran&ccedil;a possam excluir um teste "SEG" ou "SGA" j&aacute; cadastrado ou excluir um atributo que possua algum destes testes. Detalhes sobre esta parametriza&ccedil;&atilde;o est&atilde;o descritos na Se&ccedil;&atilde;o V, "Parametriza&ccedil;&otilde;es do SADS", neste manual.</FONT> </P>
<FONT SIZE=2><P>Para utilizar a fun&ccedil;&atilde;o "SGA", os seguintes campos devem ser informados: "SGA" em FUN, atributo a ser validado em OPERANDO1 e, opcionalmente, o aplicativo ou lista de elementos para o qual deve ser feita a valida&ccedil;&atilde;o no Sistema de Seguran&ccedil;a em OPERANDO2. Caso este n&atilde;o seja informado, ser&aacute; assumido, para o aplicativo, o c&oacute;digo da transa&ccedil;&atilde;o referente &agrave; consist&ecirc;ncia, como mostrado a seguir:</FONT> </P>
<FONT SIZE=2><P>C&oacute;digo da consist&ecirc;ncia: sssCnnnn</FONT> </P>
<FONT SIZE=2><P>C&oacute;digo do aplicativo: sssnnnn</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"SUB" - Sub-rotina para valida&ccedil;&atilde;o espec&iacute;fica.</FONT> </P>
<FONT SIZE=2><P>Atrav&eacute;s desta fun&ccedil;&atilde;o, a consist&ecirc;ncia passa os conte&uacute;dos de determinados atributos da tela para uma sub-rotina da aplica&ccedil;&atilde;o e dispara-a, a fim de que os mesmos possam ser validados de acordo com necessidades espec&iacute;ficas.</FONT> </P>
<FONT SIZE=2><P>Os atributos a serem validados podem ser passados para a sub-rotina isoladamente ou agrupados, no m&aacute;ximo 3 atributos com no m&aacute;ximo 23 <I>bytes</I> cada. Caso seja necess&aacute;rio passar mais de 3 atributos como par&acirc;metros para a sub-rotina, deve-se utilizar itens grupo ou redefini&ccedil;&otilde;es, a fim de agrupar dois ou mais atributos em apenas um. Assim, dentro da sub-rotina, estes atributos poder&atilde;o ser tratados isoladamente.</FONT> </P>
<FONT SIZE=2><P>Se o teste com a fun&ccedil;&atilde;o "SUB" estiver cadastrado dentro de um teste condicional SE/EN, a mensagem de erro que ser&aacute; enviada pela consist&ecirc;ncia &eacute; aquela composta pela sub-rotina espec&iacute;fica e n&atilde;o aquela informada no campo ERRO. </P>
<P>Para utilizar a fun&ccedil;&atilde;o "SUB", os seguintes campos devem ser informados: "SUB" em FUN, atributo que ser&aacute; passado para a sub-rotina em OPERANDO1, c&oacute;digo da sub-rotina no padr&atilde;o SADS (sssSnn) em OPERANDO2 e, opcionalmente, um sufixo ("A","B" ou "C") em SUF2. Se este n&atilde;o for informado ser&aacute; assumido "C". Quando forem passados mais de um atributo como par&acirc;metro para a sub-rotina, deve-se informar, na linha subsequente, os seguintes campos: "E" em E/O, atributo que ser&aacute; passado para a sub-rotina em OPERANDO1 e um sufixo diferente do anterior em "SUF2". </P>
<P>Na figura 7, sequ&ecirc;ncia 240, o atributo "ENTDATA" e na figura 8, sequ&ecirc;ncias 250 e 260, os atributos "CODENT" e "CTANUM" ser&atilde;o passados como par&acirc;metros A, B e C respectivamente para a sub-rotina "SXYS01", que ser&aacute; chamada pela consist&ecirc;ncia. </P>
<P>Para maiores detalhes em como cadastrar e utilizar uma sub-rotina espec&iacute;fica da aplica&ccedil;&atilde;o, deve-se consultar o t&oacute;pico "Sub-rotina espec&iacute;fica da aplica&ccedil;&atilde;o a ser chamada pela consist&ecirc;ncia", neste mesmo item.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"TAB" - Tabela para valida&ccedil;&atilde;o de exist&ecirc;ncia de itens.</FONT> </P>
<FONT SIZE=2><P>Esta fun&ccedil;&atilde;o &eacute; respons&aacute;vel por verificar se o conte&uacute;do informado em um atributo est&aacute; ou n&atilde;o cadastrado na tabela especificada.</FONT> </P>
<FONT SIZE=2><P>Informando "EQ" em OPE ser&aacute; verificada a exist&ecirc;ncia do item na tabela. Se n&atilde;o existir ser&aacute; apresentada uma mensagem de erro. Informando "NE", ser&aacute; verificada a n&atilde;o exist&ecirc;ncia do item na tabela. Se existir ser&aacute; apresentada uma mensagem de erro.</FONT> </P>
<FONT SIZE=2><P>A tabela cuja chave ser&aacute; validada deve estar definida no reposit&oacute;rio, desenhada e liberada para testes no Sistema de Tabelas do SADS.</FONT> </P>
<FONT SIZE=2><P>O c&oacute;digo da tabela deve ser informado conforme o padr&atilde;o SADS , "sssMnnnnx", onde "x" &eacute; o c&oacute;digo da chave da tabela, que deve ser informado somente quando se desejar obter acesso &agrave; tabela via chave secund&aacute;ria.</FONT> </P>
<FONT SIZE=2><P>O tamanho m&aacute;ximo do atributo a ser validado contra a tabela via chave principal &eacute; de 30 caracteres e via chave secundaria &eacute; de 50 caracteres.</FONT> </P>
<FONT SIZE=2><P>Se a chave da tabela, tanto a principal quanto a secund&aacute;ria, for composta por mais de um atributo, o atributo par&acirc;metro deve ser informado agrupado, ou seja, deve ser definido na consist&ecirc;ncia um atributo que seja item grupo ou redefini&ccedil;&atilde;o e que contenha os atributos da tela na mesma ordem da chave.</FONT> </P>
<FONT SIZE=2><P>Se o teste com a fun&ccedil;&atilde;o "TAB" pertencer a uma consist&ecirc;ncia de tabela, n&atilde;o &eacute; permitido cadastr&aacute;-lo para o atributo definido como chave em teste contra a sua pr&oacute;pria tabela.</FONT> </P>
<FONT SIZE=2><P>Para utilizar a fun&ccedil;&atilde;o "TAB", os seguintes campos devem ser informados: "TAB" em FUN, atributo a ser testado em OPERANDO1, opcionalmente "EQ" ou "NE" em OPE (<I>default</I> = "EQ") e o c&oacute;digo da tabela no padr&atilde;o SADS ("sssMnnnnx") em OPERANDO2. A informa&ccedil;&atilde;o do ERRO &eacute; opcional: se n&atilde;o informado, ser&aacute; assumido o valor "025" ("NAO CAD. NA TABELA") para OPE igual a "EQ" ou "006" ("JA EXISTENTE") para OPE igual a "NE".</FONT> </P>
<FONT SIZE=2><P>Na figura 7, sequ&ecirc;ncia 200, ser&aacute; verificado, atrav&eacute;s da chave principal, se o conte&uacute;do do atributo "SISCOD" est&aacute; cadastrado na tabela "SXYM5012". Se n&atilde;o estiver, ser&aacute; enviada uma mensagem de erro. Na figura 7, sequ&ecirc;ncia 210, ser&aacute; verificado, via chave secund&aacute;ria "B", se o conte&uacute;do do atributo "ELECODRESU" n&atilde;o est&aacute; cadastrado na tabela "SXYM5012". Se estiver, ser&aacute; enviada uma mensagem de erro.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"VDF" - Defini&ccedil;&atilde;o de valor <I>default</I>.</FONT> </P>
<FONT SIZE=2><P>Com esta fun&ccedil;&atilde;o torna-se posss&iacute;vel determinar o valor que ser&aacute; assumido por um atributo da tela caso o mesmo n&atilde;o seja informado pelo usu&aacute;rio.</FONT> </P>
<FONT SIZE=2><P>Para utilizar esta fun&ccedil;&atilde;o, &eacute; obrigat&oacute;rio que o atributo esteja cadastrado na estrutura da consist&ecirc;ncia como opcional. Caso seja retirada a opcionalidade ("OPC") do atributo na estrutura, n&atilde;o ser&aacute; poss&iacute;vel liberar a consist&ecirc;ncia para teste at&eacute; que seja exclu&iacute;do este teste.</FONT> </P>
<FONT SIZE=2><P>O valor <I>default</I> pode ter tamanho m&aacute;ximo de 10 caracteres.</FONT> </P>
<FONT SIZE=2><P>Se o atributo estiver definido no reposit&oacute;rio com valor <I>default</I>, este valor ser&aacute; utilizado pela consist&ecirc;ncia. Por&eacute;m, se for definido outro valor <I>default</I> para o mesmo atributo na consist&ecirc;ncia, este &uacute;ltimo substituir&aacute; o primeiro.</FONT> </P>
<FONT SIZE=2><P>Para utilizar a fun&ccedil;&atilde;o "VDF", os seguintes campos devem ser informados: "VDF" em FUN, atributo em OPERANDO1 e o valor <I>default</I> a ser assumido pelo atributo em OPERANDO2.</FONT> </P>
<FONT SIZE=2><P>Na figura 8, sequ&ecirc;ncia 300, se o atributo "USURESP" n&atilde;o for informado, a consist&ecirc;ncia ir&aacute; atribuir a constante "DEPTO-DTSS" para este atributo, que ser&aacute; passado para o aplicativo.</FONT> </P></DIR>

<FONT SIZE=2><P>Nem todos os testes com fun&ccedil;&atilde;o - que utilizam o campo FUN - podem ser executados dentro das cl&aacute;usulas "SE" ou "ENTAO". A seguir, ser&aacute; exibida uma tabela com as fun&ccedil;&otilde;es que podem ser cadastradas nas cl&aacute;usulas "SE" ou "EN": </P></DIR>
</FONT>
<TABLE BORDER CELLSPACING=1 BORDERCOLOR="#000000" WIDTH=236>
<TR><TD WIDTH="45%" VALIGN="MIDDLE">
<P><B><FONT SIZE=2>FUN&Ccedil;&Atilde;O </B></FONT></TD>
<TD WIDTH="25%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P>"SE"</B></FONT> </TD>
<TD WIDTH="30%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P>"EN" </B></FONT></TD>
</TR>
<TR><TD WIDTH="45%" VALIGN="MIDDLE">
<P>ACM</TD>
<TD WIDTH="25%" VALIGN="MIDDLE">
<P>Sim </TD>
<TD WIDTH="30%" VALIGN="MIDDLE">
<P>Sim </TD>
</TR>
<TR><TD WIDTH="45%" VALIGN="MIDDLE">
<P>DSI</TD>
<TD WIDTH="25%" VALIGN="MIDDLE">
<P>N&atilde;o </TD>
<TD WIDTH="30%" VALIGN="MIDDLE">
<P>Sim </TD>
</TR>
<TR><TD WIDTH="45%" VALIGN="MIDDLE">
<P>DUP</TD>
<TD WIDTH="25%" VALIGN="MIDDLE">
<P>N&atilde;o</TD>
<TD WIDTH="30%" VALIGN="MIDDLE">
<P>Sim </TD>
</TR>
<TR><TD WIDTH="45%" VALIGN="MIDDLE">
<P>GOP</TD>
<TD WIDTH="25%" VALIGN="MIDDLE">
<P>N&atilde;o </TD>
<TD WIDTH="30%" VALIGN="MIDDLE">
<P>N&atilde;o </TD>
</TR>
<TR><TD WIDTH="45%" VALIGN="MIDDLE">
<P>MSG</TD>
<TD WIDTH="25%" VALIGN="MIDDLE">
<P>N&atilde;o </TD>
<TD WIDTH="30%" VALIGN="MIDDLE">
<P>Sim </TD>
</TR>
<TR><TD WIDTH="45%" VALIGN="MIDDLE">
<P>SEG</TD>
<TD WIDTH="25%" VALIGN="MIDDLE">
<P>Sim </TD>
<TD WIDTH="30%" VALIGN="MIDDLE">
<P>Sim </TD>
</TR>
<TR><TD WIDTH="45%" VALIGN="MIDDLE">
<P>SGA</TD>
<TD WIDTH="25%" VALIGN="MIDDLE">
<P>Sim </TD>
<TD WIDTH="30%" VALIGN="MIDDLE">
<P>Sim </TD>
</TR>
<TR><TD WIDTH="45%" VALIGN="MIDDLE">
<P>SUB</TD>
<TD WIDTH="25%" VALIGN="MIDDLE">
<P>Sim </TD>
<TD WIDTH="30%" VALIGN="MIDDLE">
<P>Sim </TD>
</TR>
<TR><TD WIDTH="45%" VALIGN="MIDDLE">
<P>TAB</TD>
<TD WIDTH="25%" VALIGN="MIDDLE">
<P>Sim </TD>
<TD WIDTH="30%" VALIGN="MIDDLE">
<P>Sim </TD>
</TR>
<TR><TD WIDTH="45%" VALIGN="MIDDLE">
<P>VDF</TD>
<TD WIDTH="25%" VALIGN="MIDDLE">
<P>N&atilde;o </TD>
<TD WIDTH="30%" VALIGN="MIDDLE">
<P>N&atilde;o </TD>
</TR>
</TABLE>
<DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>TIP1</B> - Indica o tipo do OPERANDO1 a ser utilizado no teste. </P>
<P>Pode assumir os seguintes valores: </P><DIR>

</FONT><P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"A" - Para indicar que o OPERANDO1 &eacute; um acumulador;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"C" - Para indicar que o OPERANDO1 &eacute; um campo ou atributo;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"V" - Para indicar que o OPERANDO1 &eacute; uma vari&aacute;vel global.</FONT> </P></DIR>

<FONT SIZE=2><P>Vari&aacute;veis globais s&atilde;o atributos do SADS que est&atilde;o dispon&iacute;veis para testes na consist&ecirc;ncia e foram preenchidos de acordo com o ambiente operacional ou senha do usu&aacute;rio que efetuou o<I> logon</I> na esta&ccedil;&atilde;o. </P>
<P>As vari&aacute;veis globais que podem ser utilizadas em testes e suas descri&ccedil;&otilde;es est&atilde;o apresentadas a seguir:</FONT> </P></DIR>

<TABLE BORDER CELLSPACING=1 BORDERCOLOR="#000000" WIDTH=402>
<TR><TD WIDTH="32%" VALIGN="MIDDLE">
<P><B><FONT SIZE=2>VARIAVEL</B></FONT> </TD>
<TD WIDTH="68%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P>DESCRI&Ccedil;&Atilde;O</B></FONT> </TD>
</TR>
<TR><TD WIDTH="32%" VALIGN="MIDDLE">
<P>DATA </TD>
<TD WIDTH="68%" VALIGN="MIDDLE">
<P>Data atual do sistema. </TD>
</TR>
<TR><TD WIDTH="32%" VALIGN="MIDDLE">
<P>DIA </TD>
<TD WIDTH="68%" VALIGN="MIDDLE">
<P>Dia atual do sistema. </TD>
</TR>
<TR><TD WIDTH="32%" VALIGN="MIDDLE">
<P>MES </TD>
<TD WIDTH="68%" VALIGN="MIDDLE">
<P>Mes atual do sistema. </TD>
</TR>
<TR><TD WIDTH="32%" VALIGN="MIDDLE">
<P>ANO</TD>
<TD WIDTH="68%" VALIGN="MIDDLE">
<P>Ano atual do sistema com 2 posi&ccedil;&otilde;es. </TD>
</TR>
<TR><TD WIDTH="32%" VALIGN="MIDDLE">
<P>HORA-MINUTO</TD>
<TD WIDTH="68%" VALIGN="MIDDLE">
<P>Hora/minuto atual do sistema. </TD>
</TR>
<TR><TD WIDTH="32%" VALIGN="MIDDLE">
<P>HORA </TD>
<TD WIDTH="68%" VALIGN="MIDDLE">
<P>Hora atual do sistema. </TD>
</TR>
<TR><TD WIDTH="32%" VALIGN="MIDDLE">
<P>MINUTO </TD>
<TD WIDTH="68%" VALIGN="MIDDLE">
<P>Minuto atual do sistema. </TD>
</TR>
<TR><TD WIDTH="32%" VALIGN="MIDDLE">
<P>EMPCOD ou EMPRESA</TD>
<TD WIDTH="68%" VALIGN="MIDDLE">
<P>C&oacute;digo da empresa da senha do usu&aacute;rio. </TD>
</TR>
<TR><TD WIDTH="32%" VALIGN="MIDDLE">
<P>ESTABELEC ou ETBCOD</TD>
<TD WIDTH="68%" VALIGN="MIDDLE">
<P>C&oacute;digo do estabelecimento da senha do usu&aacute;rio. </TD>
</TR>
<TR><TD WIDTH="32%" VALIGN="MIDDLE">
<P>UNIDADE ou UNDCOD</TD>
<TD WIDTH="68%" VALIGN="MIDDLE">
<P>C&oacute;digo da unidade da senha do usu&aacute;rio. </TD>
</TR>
<TR><TD WIDTH="32%" VALIGN="MIDDLE">
<P>USUARIO ou USUNUM</TD>
<TD WIDTH="68%" VALIGN="MIDDLE">
<P>N&uacute;mero do usu&aacute;rio. </TD>
</TR>
<TR><TD WIDTH="32%" VALIGN="MIDDLE">
<P>NIVELACESSO ou USUNIVACES</TD>
<TD WIDTH="68%" VALIGN="MIDDLE">
<P>N&iacute;vel de acesso da senha do usu&aacute;rio. </TD>
</TR>
</TABLE>
<DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPERANDO1</B> - C&oacute;digo do acumulador, atributo ou vari&aacute;vel global a ser testada.</FONT> </P>
<FONT SIZE=2><P>Este operando a ser informado &eacute; dependente do seu tipo especificado no campo TIP1, a saber:</FONT> </P>
<FONT SIZE=2><P>Quando for informado "A" no campo TIP1, deve-se, obrigatoriamente, informar o n&uacute;mero do acumulador no campo OPERANDO1;</FONT> </P>
<FONT SIZE=2><P>Quando for informado "C" no campo TIP1, deve-se, obrigatoriamente, informar um atributo em OPERANDO1;</FONT> </P>
<FONT SIZE=2><P>Quando for informado "V" no campo TIP1, deve-se, obrigatoriamente, informar o c&oacute;digo de uma vari&aacute;vel global no campo OPERANDO1.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SUF1</B> - Sufixo do atributo.</FONT> </P>
<FONT SIZE=2><P>Deve ser informado um sufixo, caso o atributo o possua na estrutura da consist&ecirc;ncia.</FONT> </P>
<FONT SIZE=2><P>O sufixo &eacute; considerado parte integrante do atributo. Deste modo, apesar de poderem possuir o mesmo mnem&ocirc;nico, sufixos diferentes ir&atilde;o indicar atributos diferentes.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPE</B> - Operadores relacionais e aritm&eacute;ticos.</FONT> </P>
<FONT SIZE=2><P>Os operadores relacionais, que s&atilde;o utilizados nas compara&ccedil;&otilde;es e testes, s&atilde;o os seguintes:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"EQ" (<I>Equal</I>) - Igual a;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"NE" (<I>Not equal</I>) - Diferente de;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"GT" (<I>Greater than</I>) - Maior que;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"GE" (<I>Greater than or equal</I>) - Maior que ou igual a;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"LT" (<I>Less than</I>) - Menor que;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"LE" (<I>Less than or equal</I>) - Menor que ou igual a.</FONT> </P></DIR>

<FONT SIZE=2><P>Operadores aritm&eacute;ticos, que s&atilde;o utilizados em opera&ccedil;&otilde;es com acumuladores, s&atilde;o os seguintes:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"+ " - Para adicionar conte&uacute;do de atributo em acumulador;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"- " - Para subtrair conte&uacute;do de atributo de acumulador;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"* " - Para multiplicar o conte&uacute;do do acumulador pelo conte&uacute;do do atributo;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"/ " - Para dividir o conte&uacute;do do acumulador pelo conte&uacute;do do atributo;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"# " - Para somar 1 (um) ao acumulador a cada ocorr&ecirc;ncia preenchida do atributo.</FONT> </P>
<FONT SIZE=2><P>Os caracteres "+", "-", "*", "/" e "#" devem ser informados alinhados &agrave; esquerda.</FONT> </P></DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>TIP2</B> - Tipo de informa&ccedil;&atilde;o contida no campo OPERANDO2.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"A" - Quando o OPERANDO2 for um acumulador;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"C" - Quando o OPERANDO2 for um campo ou atributo;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"K" - Quando o OPERANDO2 for uma constante;</FONT> </P></DIR>

<FONT SIZE=2><P>Quando se desejar fazer compara&ccedil;&otilde;es de um atributo contra um determinado valor espec&iacute;fico, deve-se informar "K" em TIP2 e o valor em OPERANDO2.</FONT> </P>
<FONT SIZE=2><P>O valor da constante deve ser coerente com o formato e o tamanho do atributo informado em OPERANDO1.</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"S" - Quando o OPERANDO2 for uma sub-rotina;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"T" - Quando o OPERANDO2 for uma tabela;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"V" - Quando o OPERANDO2 for uma vari&aacute;vel global.</FONT> </P></DIR>

<FONT SIZE=2><P>Vari&aacute;veis globais s&atilde;o atributos do SADS que est&atilde;o dispon&iacute;veis para testes na consist&ecirc;ncia e foram preenchidos de acordo com o ambiente operacional ou senha do usu&aacute;rio que efetuou o<I> logon</I> na esta&ccedil;&atilde;o. </P>
<P>As vari&aacute;veis globais que podem ser utilizadas em testes e suas descri&ccedil;&otilde;es est&atilde;o apresentadas a seguir:</FONT> </P></DIR>

<TABLE BORDER CELLSPACING=1 BORDERCOLOR="#000000" WIDTH=449>
<TR><TD WIDTH="34%" VALIGN="MIDDLE">
<PRE>
<B>VARIAVEL</PRE></B></TD>
<TD WIDTH="66%" VALIGN="MIDDLE">
<PRE>
<B>DESCRI&Ccedil;&Atilde;O</PRE></B></TD>
</TR>
<TR><TD WIDTH="34%" VALIGN="MIDDLE">
<PRE>
DATA </PRE></TD>
<TD WIDTH="66%" VALIGN="MIDDLE">
<PRE>
Data atual do sistema.</PRE></TD>
</TR>
<TR><TD WIDTH="34%" VALIGN="MIDDLE">
<PRE>
DIA</PRE></TD>
<TD WIDTH="66%" VALIGN="MIDDLE">
<PRE>
Dia atual do sistema</PRE></TD>
</TR>
<TR><TD WIDTH="34%" VALIGN="MIDDLE">
<PRE>
MES</PRE></TD>
<TD WIDTH="66%" VALIGN="MIDDLE">
<PRE>
Mes atual do sistema</PRE></TD>
</TR>
<TR><TD WIDTH="34%" VALIGN="MIDDLE">
<PRE>
ANO</PRE></TD>
<TD WIDTH="66%" VALIGN="MIDDLE">
<PRE>
Ano atual do sistema com 2 posi&ccedil;&otilde;es</PRE></TD>
</TR>
<TR><TD WIDTH="34%" VALIGN="MIDDLE">
<PRE>
HORA-MINUTO</PRE></TD>
<TD WIDTH="66%" VALIGN="MIDDLE">
<PRE>
Hora/minuto atual do sistema.</PRE></TD>
</TR>
<TR><TD WIDTH="34%" VALIGN="MIDDLE">
<PRE>
HORA</PRE></TD>
<TD WIDTH="66%" VALIGN="MIDDLE">
<PRE>
Hora atual do sistema</PRE></TD>
</TR>
<TR><TD WIDTH="34%" VALIGN="MIDDLE">
<PRE>
MINUTO </PRE></TD>
<TD WIDTH="66%" VALIGN="MIDDLE">
<PRE>
Minuto atual do sistema.</PRE></TD>
</TR>
<TR><TD WIDTH="34%" VALIGN="MIDDLE">
<PRE>
EMPCOD ou EMPRESA</PRE></TD>
<TD WIDTH="66%" VALIGN="MIDDLE">
<PRE>
C&oacute;digo da empresa da senha do usu&aacute;rio.</PRE></TD>
</TR>
<TR><TD WIDTH="34%" VALIGN="MIDDLE">
<PRE>
ESTABELEC ou ETBCOD</PRE></TD>
<TD WIDTH="66%" VALIGN="MIDDLE">
<PRE>
C&oacute;digo do estabelecimento da senha do usu&aacute;rio</PRE></TD>
</TR>
<TR><TD WIDTH="34%" VALIGN="MIDDLE">
<PRE>
UNIDADE ou UNDCOD</PRE></TD>
<TD WIDTH="66%" VALIGN="MIDDLE">
<PRE>
C&oacute;digo da unidade da senha do usu&aacute;rio</PRE></TD>
</TR>
<TR><TD WIDTH="34%" VALIGN="MIDDLE">
<PRE>
USUARIO ou USUNUM</PRE></TD>
<TD WIDTH="66%" VALIGN="MIDDLE">
<PRE>
N&uacute;mero do usu&aacute;rio</PRE></TD>
</TR>
<TR><TD WIDTH="34%" VALIGN="MIDDLE">
<PRE>
NIVELACESSO ou USUNIVACES</PRE></TD>
<TD WIDTH="66%" VALIGN="MIDDLE">
<PRE>
N&iacute;vel de acesso da senha do usu&aacute;rio.</PRE></TD>
</TR>
</TABLE>
<DIR>

<P>Quando for informado "+ ", "- ", "* ", "/ " ou " " no campo OPE, deve-se, obrigatoriamente, informar "A" no campo TIP2. </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPERANDO2 </B>- Segundo operando a ser utilizado no teste.</FONT> </P>
<FONT SIZE=2><P>Conforme o teste que est&aacute; sendo cadastrado, o OPERANDO2 pode ser:</FONT> </P>
<FONT SIZE=2><P>o n&uacute;mero de um acumulador;</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>o c&oacute;digo de um atributo;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>o c&oacute;digo de uma vari&aacute;vel global;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>o valor ou literal de uma constante;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>o c&oacute;digo de uma tabela ou</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>o c&oacute;digo de uma sub-rotina.</FONT> </P></DIR>

<FONT SIZE=2><P>A informa&ccedil;&atilde;o do OPERANDO2 depende da informa&ccedil;&atilde;o do campo TIP2, a saber:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Quando for informado "A" no campo TIP2, deve-se, obrigatoriamente, informar o n&uacute;mero do acumulador no campo OPERANDO2;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Quando for informado "C" no campo TIP2, deve-se, obrigatoriamente, informar um atributo/campo em OPERANDO2;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Quando for informado "K" no campo TIP2, deve-se, obrigatoriamente, informar um valor ou literal no campo OPERANDO2;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Quando for informado "T" no campo TIP2, deve-se, obrigatoriamente, informar o c&oacute;digo da tabela no campo OPERANDO2;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Quando for informado "S" no campo TIP2, deve-se, obrigatoriamente, informar o c&oacute;digo da sub-rotina no campo OPERANDO2;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Quando for informado "V" no campo TIP2, deve-se, obrigatoriamente, informar o c&oacute;digo de uma vari&aacute;vel global no campo OPERANDO2.</FONT> </P></DIR>

<FONT SIZE=2><P>Em casos de constante alfanum&eacute;rica ou alfab&eacute;tica, deve ser informado o valor alinhado &agrave; esquerda; em caso de constante num&eacute;rica, n&atilde;o &eacute; necess&aacute;rio que seja informado o valor alinhado &agrave; direita: pode-se inform&aacute;-lo na primeira posi&ccedil;&atilde;o &agrave; esquerda que a consist&ecirc;ncia far&aacute; o ajuste.</FONT> </P>
<FONT SIZE=2><P>O tamanho m&aacute;ximo para uma constante &eacute; de dez caracteres.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SUF2</B> - Sufixo do OPERANDO2.</FONT> </P>
<FONT SIZE=2><P>Este campo deve ser informado somente se o OPERANDO2 for um atributo ou campo e possuir sufixo na estrutura da consist&ecirc;ncia.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>ERRO</B> - C&oacute;digo da mensagem de erro.</FONT> </P>
<FONT SIZE=2><P>Este c&oacute;digo identifica o erro cuja descri&ccedil;&atilde;o deve ser enviada ao usu&aacute;rio quando o teste detectar um preenchimento incorreto na entrada dos dados.</FONT> </P>
<FONT SIZE=2><P>As mensagens de erros podem ser gen&eacute;ricas ou espec&iacute;ficas por sistema.</FONT> </P>
<FONT SIZE=2><P>Se for pedido o <I>help </I>para este atributo, ser&atilde;o apresentadas as descri&ccedil;&otilde;es das mensagens de erro gen&eacute;ricas e os c&oacute;digos correspondentes. </P>
<P>Os c&oacute;digos de mensagens de erro gen&eacute;ricas e suas respectivas descri&ccedil;&otilde;es s&atilde;o as seguintes:</FONT> </P></DIR>

<TABLE BORDER CELLSPACING=1 BORDERCOLOR="#000000" WIDTH=284>
<TR><TD WIDTH="37%" VALIGN="MIDDLE">
<PRE>
<B>C&Oacute;DIGO </PRE></B></TD>
<TD WIDTH="63%" VALIGN="MIDDLE">
<PRE>
<B>DESCRI&Ccedil;&Atilde;O</PRE></B></TD>
</TR>
<TR><TD WIDTH="37%" VALIGN="MIDDLE">
<PRE>
001</PRE></TD>
<TD WIDTH="63%" VALIGN="MIDDLE">
<PRE>
NAO INFORMADO</PRE></TD>
</TR>
<TR><TD WIDTH="37%" VALIGN="MIDDLE">
<PRE>
002</PRE></TD>
<TD WIDTH="63%" VALIGN="MIDDLE">
<PRE>
NAO INFORMADA</PRE></TD>
</TR>
<TR><TD WIDTH="37%" VALIGN="MIDDLE">
<PRE>
003</PRE></TD>
<TD WIDTH="63%" VALIGN="MIDDLE">
<PRE>
NAO NUMERICO</PRE></TD>
</TR>
<TR><TD WIDTH="37%" VALIGN="MIDDLE">
<PRE>
004</PRE></TD>
<TD WIDTH="63%" VALIGN="MIDDLE">
<PRE>
NAO ALFABETICO</PRE></TD>
</TR>
<TR><TD WIDTH="37%" VALIGN="MIDDLE">
<PRE>
005</PRE></TD>
<TD WIDTH="63%" VALIGN="MIDDLE">
<PRE>
INEXISTENTE</PRE></TD>
</TR>
<TR><TD WIDTH="37%" VALIGN="MIDDLE">
<PRE>
006</PRE></TD>
<TD WIDTH="63%" VALIGN="MIDDLE">
<PRE>
JA EXISTENTE</PRE></TD>
</TR>
<TR><TD WIDTH="37%" VALIGN="MIDDLE">
<PRE>
007</PRE></TD>
<TD WIDTH="63%" VALIGN="MIDDLE">
<PRE>
FORA DE FAIXA</PRE></TD>
</TR>
<TR><TD WIDTH="37%" VALIGN="MIDDLE">
<PRE>
008</PRE></TD>
<TD WIDTH="63%" VALIGN="MIDDLE">
<PRE>
FORA DE SEQUENCIA</PRE></TD>
</TR>
<TR><TD WIDTH="37%" VALIGN="MIDDLE">
<PRE>
009</PRE></TD>
<TD WIDTH="63%" VALIGN="MIDDLE">
<PRE>
EM DUPLICATA</PRE></TD>
</TR>
<TR><TD WIDTH="37%" VALIGN="MIDDLE">
<PRE>
010</PRE></TD>
<TD WIDTH="63%" VALIGN="MIDDLE">
<PRE>
DIGITO NAO CONFERE</PRE></TD>
</TR>
<TR><TD WIDTH="37%" VALIGN="MIDDLE">
<PRE>
011</PRE></TD>
<TD WIDTH="63%" VALIGN="MIDDLE">
<PRE>
LETRA NAO CONFERE</PRE></TD>
</TR>
<TR><TD WIDTH="37%" VALIGN="MIDDLE">
<PRE>
012</PRE></TD>
<TD WIDTH="63%" VALIGN="MIDDLE">
<PRE>
NAO CONFERE</PRE></TD>
</TR>
<TR><TD WIDTH="37%" VALIGN="MIDDLE">
<PRE>
013</PRE></TD>
<TD WIDTH="63%" VALIGN="MIDDLE">
<PRE>
INCORRETO</PRE></TD>
</TR>
<TR><TD WIDTH="37%" VALIGN="MIDDLE">
<PRE>
014</PRE></TD>
<TD WIDTH="63%" VALIGN="MIDDLE">
<PRE>
INCORRETA;</PRE></TD>
</TR>
<TR><TD WIDTH="37%" VALIGN="MIDDLE">
<PRE>
015</PRE></TD>
<TD WIDTH="63%" VALIGN="MIDDLE">
<PRE>
NAO CADASTRADO</PRE></TD>
</TR>
<TR><TD WIDTH="37%" VALIGN="MIDDLE">
<PRE>
016</PRE></TD>
<TD WIDTH="63%" VALIGN="MIDDLE">
<PRE>
NAO CADASTRADA</PRE></TD>
</TR>
<TR><TD WIDTH="37%" VALIGN="MIDDLE">
<PRE>
017</PRE></TD>
<TD WIDTH="63%" VALIGN="MIDDLE">
<PRE>
INVALIDO</PRE></TD>
</TR>
<TR><TD WIDTH="37%" VALIGN="MIDDLE">
<PRE>
018</PRE></TD>
<TD WIDTH="63%" VALIGN="MIDDLE">
<PRE>
INVALIDA</PRE></TD>
</TR>
<TR><TD WIDTH="37%" VALIGN="MIDDLE">
<PRE>
019</PRE></TD>
<TD WIDTH="63%" VALIGN="MIDDLE">
<PRE>
DIFERENTE DE S E N</PRE></TD>
</TR>
<TR><TD WIDTH="37%" VALIGN="MIDDLE">
<PRE>
020</PRE></TD>
<TD WIDTH="63%" VALIGN="MIDDLE">
<PRE>
NAO FECHA</PRE></TD>
</TR>
<TR><TD WIDTH="37%" VALIGN="MIDDLE">
<PRE>
021</PRE></TD>
<TD WIDTH="63%" VALIGN="MIDDLE">
<PRE>
NAO INFORMAR</PRE></TD>
</TR>
<TR><TD WIDTH="37%" VALIGN="MIDDLE">
<PRE>
022</PRE></TD>
<TD WIDTH="63%" VALIGN="MIDDLE">
<PRE>
IGUAL A ZERO</PRE></TD>
</TR>
<TR><TD WIDTH="37%" VALIGN="MIDDLE">
<PRE>
023</PRE></TD>
<TD WIDTH="63%" VALIGN="MIDDLE">
<PRE>
INVALIDO P/ OPCAO</PRE></TD>
</TR>
<TR><TD WIDTH="37%" VALIGN="MIDDLE">
<PRE>
024</PRE></TD>
<TD WIDTH="63%" VALIGN="MIDDLE">
<PRE>
INCOMPATIVEL</PRE></TD>
</TR>
<TR><TD WIDTH="37%" VALIGN="MIDDLE">
<PRE>
025</PRE></TD>
<TD WIDTH="63%" VALIGN="MIDDLE">
<PRE>
NAO CAD. NA TABELA</PRE></TD>
</TR>
<TR><TD WIDTH="37%" VALIGN="MIDDLE">
<PRE>
026</PRE></TD>
<TD WIDTH="63%" VALIGN="MIDDLE">
<PRE>
EM DESIGUALDADE</PRE></TD>
</TR>
<TR><TD WIDTH="37%" VALIGN="MIDDLE">
<PRE>
027</PRE></TD>
<TD WIDTH="63%" VALIGN="MIDDLE">
<PRE>
NAO AUTORIZADA</PRE></TD>
</TR>
<TR><TD WIDTH="37%" VALIGN="MIDDLE">
<PRE>
028</PRE></TD>
<TD WIDTH="63%" VALIGN="MIDDLE">
<PRE>
NAO AUTORIZADO</PRE></TD>
</TR>
</TABLE>
<DIR>

<P>Caso estas mensagens n&atilde;o atendam a um teste espec&iacute;fico, ou seja, se for necess&aacute;rio enviar uma mensagem ao usu&aacute;rio diferente destas j&aacute; padronizadas, &eacute; poss&iacute;vel cadastrar uma tabela de mensagens pr&oacute;prias por sistema. Para obter maiores informa&ccedil;&otilde;es sobre como definir esta tabela, consulte o t&oacute;pico "Interface com aplicativos", neste item. </P>
<P>A mensagem de erro se refere ao OPERANDO1 cadastrado na mesma sequ&ecirc;ncia onde foi definido o c&oacute;digo de erro. </P>
<P>Quando houver uma sequ&ecirc;ncia de testes referentes ao mesmo OPERANDO1, dentro ou fora de teste condicional - "SE/EN"-, concatenados pelos operadores l&oacute;gicos E/O, o c&oacute;digo de erro pode ser cadastrado no primeiro teste da sequ&ecirc;ncia. </P>
<P>Para exemplificar, observe o cadastramento a seguir: </P>
<PRE>
SEQ SE/EN E/O FUN TIP1 OPERANDO1 SUF1 OPE TIP2 OPER2   SUF2ERRO
010  SE            C   EMPNUMDEP      GE   K  00000001
020  EN                EMPSALFAM      NE   K               001</PRE>
<FONT SIZE=2><P>De acordo com estes testes cadastrados e o que foi anteriormente explicado, a mensagem de erro se refere ao atributo "EMPSALFAM", ao inv&eacute;s do atributo "EMPNUMDEP", e ser&aacute; emitida seguindo o algoritmo a seguir:</FONT> </P>
<PRE>
SE  Num. de dependentes do empregado for maior ou igual a um
ENTAO
 Sal&aacute;rio-fam&iacute;lia deve ser diferente de zero
 Caso o sal&aacute;rio-fam&iacute;lia n&atilde;o seja diferente de zero
   Exiba descri&ccedil;&atilde;o da mensagem de erro 001 junto ao c&oacute;digo
   do atributo "EMPSALFAM", da seguinte forma: 
   EMPSALFAM (Sal&aacute;rio-fam&iacute;lia) NAO INFORMADO.</PRE>
<FONT SIZE=2><P>&Eacute; importante ressaltar algumas considera&ccedil;&otilde;es entre OPERANDO1 e OPERANDO2, quais sejam:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>As compara&ccedil;&otilde;es permitidas entre operandos, OPERANDO1 e OPERANDO2, s&atilde;o:</FONT> </P></DIR>
</DIR>

<TABLE BORDER CELLSPACING=1 BORDERCOLOR="#000000" WIDTH=449>
<TR><TD WIDTH="18%" VALIGN="MIDDLE">
<P ALIGN="CENTER"><B><FONT SIZE=2>TIP1</B></FONT></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P>OPERANDO1</B></FONT> </TD>
<TD WIDTH="10%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P ALIGN="CENTER">X</B></FONT></TD>
<TD WIDTH="13%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P ALIGN="CENTER">TIP2</B></FONT></TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P>OPERANDO2 </B></FONT></TD>
</TR>
<TR><TD WIDTH="18%" VALIGN="MIDDLE">
<P ALIGN="CENTER">C</TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<P>Campo</TD>
<TD WIDTH="10%" VALIGN="MIDDLE">
<P ALIGN="CENTER">X</TD>
<TD WIDTH="13%" VALIGN="MIDDLE">
<P ALIGN="CENTER">C</TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<P>Campo </TD>
</TR>
<TR><TD WIDTH="18%" VALIGN="MIDDLE">
<P ALIGN="CENTER">C</TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<P>Campo </TD>
<TD WIDTH="10%" VALIGN="MIDDLE">
<P ALIGN="CENTER">X</TD>
<TD WIDTH="13%" VALIGN="MIDDLE">
<P ALIGN="CENTER">K</TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<P>Constante</TD>
</TR>
<TR><TD WIDTH="18%" VALIGN="MIDDLE">
<P ALIGN="CENTER">C</TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<P>Campo </TD>
<TD WIDTH="10%" VALIGN="MIDDLE">
<P ALIGN="CENTER">X</TD>
<TD WIDTH="13%" VALIGN="MIDDLE">
<P ALIGN="CENTER">A</TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<P>Acumulador</TD>
</TR>
<TR><TD WIDTH="18%" VALIGN="MIDDLE">
<P ALIGN="CENTER">A</TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<P>Acumulador </TD>
<TD WIDTH="10%" VALIGN="MIDDLE">
<P ALIGN="CENTER">X</TD>
<TD WIDTH="13%" VALIGN="MIDDLE">
<P ALIGN="CENTER">K</TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<P>Constante</TD>
</TR>
<TR><TD WIDTH="18%" VALIGN="MIDDLE">
<P ALIGN="CENTER">C</TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<P>Campo</TD>
<TD WIDTH="10%" VALIGN="MIDDLE">
<P ALIGN="CENTER">X</TD>
<TD WIDTH="13%" VALIGN="MIDDLE">
<P ALIGN="CENTER">V</TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<P>Global</TD>
</TR>
<TR><TD WIDTH="18%" VALIGN="MIDDLE">
<P ALIGN="CENTER">V</TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<P>Var. global </TD>
<TD WIDTH="10%" VALIGN="MIDDLE">
<P ALIGN="CENTER">X</TD>
<TD WIDTH="13%" VALIGN="MIDDLE">
<P ALIGN="CENTER">C</TD>
<TD WIDTH="29%" VALIGN="MIDDLE">
<P>Campo </TD>
</TR>
</TABLE>
<DIR>
<DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12>As compara&ccedil;&otilde;es entre campos (atributos) s&oacute; s&atilde;o permitidas quando ambos pertencerem ao mesmo n&iacute;vel hier&aacute;rquico ("NDEF") na estrutura da consist&ecirc;ncia. </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12>As compara&ccedil;&otilde;es entre acumuladores (em OPERANDO1) e constantes (em OPERANDO2) s&oacute; s&atilde;o permitidas quando no teste for utilizada a fun&ccedil;&atilde;o "MSG" (FUN = "MSG"). </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12>Numa compara&ccedil;&atilde;o de um atributo data contra uma constante, esta deve ser informada invertida, nos formatos "AAMMDD" ou "AAAAMMDD", em OPERANDO2. </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12>O tamanho m&aacute;ximo permitido para uma constante &eacute; de 10 posi&ccedil;&otilde;es. </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12>Na compara&ccedil;&atilde;o de um atributo cadastrado com ajuste "V" - AJU = "V" - contra uma constante, esta deve ser informada com v&iacute;rgula. </P></DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPERACAO</B> - Opera&ccedil;&atilde;o que est&aacute; sendo efetuada sobre os testes em n&iacute;vel de estrutura da consist&ecirc;ncia.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores: </P><DIR>

</FONT><P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"INC" (Inclus&atilde;o);</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"ALT" (Altera&ccedil;&atilde;o);</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"EXC" (Exclus&atilde;o);</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"CON" (Consulta).</FONT> </P></DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>CONTINUA(S/N)</B> - Indicador de continua&ccedil;&atilde;o da opera&ccedil;&atilde;o sobre os testes de valida&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores: </P><DIR>

</FONT><P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"S" - Para prosseguir na opera&ccedil;&atilde;o sobre os testes em n&iacute;vel de estrutura da consist&ecirc;ncia e a pr&oacute;xima p&aacute;gina a ser exibida ser&aacute; a indicada no campo PROXIMA PAG.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"N" - Para encerrar a opera&ccedil;&atilde;o sobre os testes em n&iacute;vel de estrutura da consist&ecirc;ncia.</FONT> </P>
<FONT SIZE=2><P>Quando o campo CONTINUA for igual a "N", o campo PROXIMA PAG. deve ser "99".</FONT> </P></DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>PROXIMA PAG</B>. - Sequ&ecirc;ncia da p&aacute;gina que ser&aacute; exibida. </P>
<P>Pode variar de 01 a 50. </P>
<P>Para terminar deve ser informado 99. </P></DIR>

<P>A seguir, ser&aacute; explicado detalhadamente como efetuar o cadastramento de cada um dos testes dispon&iacute;veis, as regras a serem seguidas, quais campos da tela dever&atilde;o ser informados e exemplos de cadastramentos dos respectivos testes.</FONT> </P>
<P><A NAME="Consta"><IMG SRC="Bullet8.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Teste de atributo contra constante</A></B></FONT> </P>
<FONT SIZE=2><P>Cadastrar testes de um atributo contra constantes &eacute; definir e verificar quais valores este atributo poder&aacute; assumir.</FONT> </P>
<FONT SIZE=2><P>Um atributo pode ser testado contra um valor ou uma lista de valores concatenados por operadores l&oacute;gicos e, inclusive, com operadores relacionais diferentes.</FONT> </P>
<FONT SIZE=2><P>Para o cadastramento deste tipo de teste, os campos da tela que devem ser informados s&atilde;o:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SEQ</B> - N&uacute;mero sequencial para posicionamento do teste.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>E/O</B> - Operador l&oacute;gico.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os valores "E" ou "O".</FONT> </P>
<FONT SIZE=2><P>O operador l&oacute;gico n&atilde;o pode ser informado no primeiro teste. Ele &eacute; utilizado para concatena&ccedil;&atilde;o com outros testes.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>TIP1</B> - Tipo de dado do OPERANDO1, que deve ser "C", para indicar que o OPERANDO1 &eacute; um atributo.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPERANDO1</B> - Mnem&ocirc;nico do atributo a ser testado.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SUF1</B> - Sufixo do atributo a ser testado, caso ele o possua na estrutura da consist&ecirc;ncia.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPE</B> - Operador relacional para o teste.</FONT> </P>
<FONT SIZE=2><P>Pode assumir um dos seguintes valores: "EQ", "NE", "GT", "GE", "LT" ou "LE".</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>TIP2</B> - Tipo de dado do OPERANDO2, que deve ser "K", para indicar que o OPERANDO2 &eacute; uma constante.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPERANDO2 </B>- Constante atrav&eacute;s da qual ser&aacute; feita a valida&ccedil;&atilde;o do atributo.</FONT> </P>
<FONT SIZE=2><P>A constante alfanum&eacute;rica ou alfab&eacute;tica deve sempre ser informada alinhada &agrave; esquerda. No entanto, a constante num&eacute;rica pode ser informada alinhada &agrave; direita ou &agrave; esquerda.</FONT> </P>
<FONT SIZE=2><P>Uma constante pode ter no m&aacute;ximo dez caracteres. </P>
<P>Se for feita uma compara&ccedil;&atilde;o de um atributo com uma constante de tamanho maior do que o deste atributo, na gera&ccedil;&atilde;o dos par&acirc;metros da consist&ecirc;ncia, ser&aacute; enviada uma mensagem de erro.</FONT> </P>
<FONT SIZE=2><P>No caso de teste envolvendo atributo do tipo DATA - atributo que possui padr&atilde;o "DMA", "AMD" ou "INV" -, &eacute; necess&aacute;rio que a constante contra a qual ser&aacute; validada seja informada no formato ano/m&ecirc;s/dia (AAMMDD ou AAAAMMDD).</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>ERRO</B> - C&oacute;digo da mensagem de erro.</FONT> </P>
<FONT SIZE=2><P>Exemplos de testes de atributo contra constante:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Atributo "EMPIDADE" (Idade do Empregado) tem de ser maior ou igual a 14 e menor ou igual a 65.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Atributo "TLAOPCAO" (Op&ccedil;&atilde;o da tela) tem de ser maior que 11 e menor que 18, ou igual a 20.</FONT> </P></DIR>
</DIR>

<P><A NAME="Atritri"><IMG SRC="Bullet8.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Teste de um atributo contra outro atributo</A></B></FONT> </P>
<FONT SIZE=2><P>Cadastrar testes de um atributo contra outros atributos &eacute; definir quais valores um atributo pode assumir de acordo com os valores assumidos pelos demais atributos. Semelhantemente ao teste contra constante, podem ser efetuados testes contra um &uacute;nico atributo ou uma lista de atributos, concatenados por operadores l&oacute;gicos e, inclusive, com operadores relacionais diferentes.</FONT> </P>
<FONT SIZE=2><P>Para o cadastramento deste tipo de teste, os campos da tela que devem ser informados s&atilde;o:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SEQ</B> - N&uacute;mero sequencial para posicionamento do teste.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>E/O</B> - Operador l&oacute;gico.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os valores "E" ou "O".</FONT> </P>
<FONT SIZE=2><P>O operador l&oacute;gico n&atilde;o pode ser informado no primeiro teste. Ele &eacute; utilizado para concatena&ccedil;&atilde;o com outros testes.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>TIP1</B> - Tipo de dado do OPERANDO1, que deve ser "C", para indicar que o OPERANDO1 &eacute; um campo/atributo.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPERANDO1</B> - Mnem&ocirc;nico do atributo a ser testado.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SUF1</B> - Sufixo do atributo, caso ele o possua na estrutura da consist&ecirc;ncia.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPE</B> - Operador relacional para o teste.</FONT> </P>
<FONT SIZE=2><P>Pode assumir um dos seguintes valores: "EQ", "NE", "GT", "GE", "LT" ou "LE".</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>TIP2</B> - Tipo de dado do ATRIBUTO, que deve ser "C" para indicar que o OPERANDO2 &eacute; um campo/atributo.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPERANDO2</B> - Mnem&ocirc;nico do atributo contra o qual o atributo informado em OPERANDO1 ser&aacute; testado.</FONT> </P>
<FONT SIZE=2><P>Os atributos a serem comparados entre si devem possuir formatos compat&iacute;veis, ou seja, num&eacute;rico X num&eacute;rico, num&eacute;rico X alfanum&eacute;rico, alfab&eacute;tico X alfab&eacute;tico, alfab&eacute;tico X alfanum&eacute;rico ou alfanum&eacute;rico X alfanum&eacute;rico.</FONT> </P>
<FONT SIZE=2><P>No caso de teste envolvendo atributo do tipo DATA - atributo que possui padr&atilde;o "DMA", "AMD" ou "INV" - contra atributo tamb&eacute;m do tipo DATA, n&atilde;o &eacute; necess&aacute;rio que os dois atributos possuam o mesmo padr&atilde;o, pois a consist&ecirc;ncia efetua automaticamente as convers&otilde;es necess&aacute;rias, a fim de compatibiliz&aacute;-los, antes de efetuar o teste. Por&eacute;m, &eacute; necess&aacute;rio que ambos possuam o mesmo tamanho.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SUF2</B> - Sufixo do atributo informado em OPERANDO2.</FONT> </P>
<FONT SIZE=2><P>Este campo s&oacute; dever&aacute; ser informado caso o atributo informado em OPERANDO2 possua sufixo na estrutura da consist&ecirc;ncia.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>ERRO</B> - C&oacute;digo da mensagem de erro.</FONT> </P></DIR>

<P><A NAME="Atrita"><IMG SRC="Bullet8.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Teste de um atributo contra tabela</A></B></FONT> </P>
<FONT SIZE=2><P>Testar um atributo contra uma tabela &eacute; verificar se nela existe ou n&atilde;o um item cuja chave tenha valor igual ao informado para o atributo.</FONT> </P>
<FONT SIZE=2><P>Informando "EQ" no operando relacional (OPE), ser&aacute; verificada a exist&ecirc;ncia do item na tabela. Caso o item n&atilde;o existir na tabela, ser&aacute; apresentada uma mensagem de erro. Informando "NE", ser&aacute; verificada a inexist&ecirc;ncia do item na tabela. Se existir, ser&aacute; apresentada uma mensagem de erro.</FONT> </P>
<FONT SIZE=2><P>A tabela que ter&aacute; a sua chave validada deve estar definida no reposit&oacute;rio de dados, desenhada e liberada para o ambiente em que ser&atilde;o feitos os testes, no Sistema de Tabelas do SADS.</FONT> </P>
<FONT SIZE=2><P>O c&oacute;digo da tabela deve ser informado conforme o padr&atilde;o SADS , "sssMnnnnx", onde "x" &eacute; o c&oacute;digo da chave da tabela, que deve ser informado somente quando se desejar obter acesso &agrave; tabela via chave secund&aacute;ria.</FONT> </P>
<FONT SIZE=2><P>O tamanho m&aacute;ximo do atributo a ser validado contra a tabela via chave principal &eacute; de 30 caracteres; via chave secund&aacute;ria, &eacute; de 50 caracteres.</FONT> </P>
<FONT SIZE=2><P>Se a chave da tabela, tanto a principal quanto a secund&aacute;ria, for composta por mais de um atributo, o atributo par&acirc;metro deve ser informado agrupado, ou seja, deve ser definido na consist&ecirc;ncia um atributo que seja item grupo ou redefini&ccedil;&atilde;o e que contenha os atributos da tela na mesma ordem da chave.</FONT> </P>
<FONT SIZE=2><P>Se o teste com a fun&ccedil;&atilde;o "TAB" pertencer a uma consist&ecirc;ncia de tabela, n&atilde;o &eacute; permitido cadastr&aacute;-lo para o atributo definido como chave (CLAS = "C") em teste contra a sua pr&oacute;pria tabela.</FONT> </P>
<FONT SIZE=2><P>&Eacute; poss&iacute;vel determinar o teste de um atributo contra uma tabela no momento de defini&ccedil;&atilde;o do atributo. Neste caso, se for relacionado um segundo teste contra tabela nos testes em n&iacute;vel de estrutura, a consist&ecirc;ncia verificar&aacute; a exist&ecirc;ncia do atributo em ambas as tabelas, isto &eacute;, na tabela informada em sua defini&ccedil;&atilde;o e na tabela informada nas validades em n&iacute;vel de estrutura.</FONT> </P>
<FONT SIZE=2><P>Um atributo pode ser testado contra uma tabela ou lista de tabelas.</FONT> </P>
<FONT SIZE=2><P>Para o cadastramento deste tipo de teste, os campos da tela que devem ser informados s&atilde;o:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SEQ</B> - N&uacute;mero sequencial para posicionamento do teste.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>E/O</B> - Operador l&oacute;gico.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os valores "E" ou "O". </P>
<P>O operador l&oacute;gico n&atilde;o pode ser informado no primeiro teste, pois ele &eacute; utilizado somente para concatena&ccedil;&atilde;o l&oacute;gica do teste em quest&atilde;o com os demais testes anteriores.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>FUN</B> - Fun&ccedil;&atilde;o a ser efetuada sobre o atributo, campo que obrigatoriamente deve ser informado com "TAB".</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPERANDO1</B> - Mnem&ocirc;nico do atributo a ser testado.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SUF1</B> - Sufixo do atributo a ser testado, caso ele o possua na estrutura da consist&ecirc;ncia.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPE</B> - Operador relacional, que deve ser informado com "EQ", para testar se o item existe na tabela, ou "NE", para testar se o item n&atilde;o existe na tabela. </P>
<P>Se o operador relacional n&atilde;o for informado, ser&aacute; assumido o valor "EQ".</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPERANDO2</B> - C&oacute;digo da tabela contra a qual deve ser feito o teste de exist&ecirc;ncia ou inexist&ecirc;ncia do atributo, no padr&atilde;o SADS (sssMnnnnx).</FONT> </P>
<FONT SIZE=2><P>O c&oacute;digo da tabela deve ser informado conforme o padr&atilde;o SADS: "sssMnnnnx" - onde: "sss" &eacute; o c&oacute;digo do sistema; "M" &eacute; a constante de tabelas; "nnnn" &eacute; o n&uacute;mero sequencial da tabela e "x" &eacute; o c&oacute;digo da chave da tabela, que deve ser informado somente para obter acesso &agrave; tabela via chave secund&aacute;ria.</FONT> </P>
<FONT SIZE=2><P>A tabela informada no campo OPERANDO2 deve estar cadastrada no reposit&oacute;rio de dados do SADS.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>ERRO</B> - C&oacute;digo da mensagem de erro. </P>
<P>Se o c&oacute;digo do erro n&atilde;o for informado, ser&aacute; assumido o valor "025" ("NAO CAD. NA TABELA") para OPE igual a "EQ" ou "006" ("JA EXISTENTE") para OPE igual a "NE".</FONT> </P></DIR>

<FONT SIZE=2><P>- Atributo contra tabela - Atributo "EMPCODDEP" (C&oacute;digo do Departamento do Empregado) tem de estar cadastrado na tabela SRHM5001, que &eacute; a tabela de departamentos da companhia.</FONT> </P>
<P><A NAME="Atriap"><IMG SRC="Bullet8.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Teste de um atributo contra sub-rotina da aplica&ccedil;&atilde;o</A></B></FONT> </P>
<FONT SIZE=2><P>O teste de atributo contra sub-rotina pr&oacute;pria da aplica&ccedil;&atilde;o &eacute; um recurso oferecido pela consist&ecirc;ncia com o objetivo de permitir que sejam efetuados testes necess&aacute;rios &agrave; aplica&ccedil;&atilde;o que n&atilde;o tenham sido disponibilizados pela consist&ecirc;ncia geral.</FONT> </P>
<FONT SIZE=2><P>Nesta sub-rotina podem ser codificados testes contra cadastro (integridade referencial), ou seja, testes espec&iacute;ficos de determinada aplica&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>A sub-rotina de consist&ecirc;ncia geral - SSCS01-, quando em execu&ccedil;&atilde;o, dispara esta sub-rotina, passando-lhe como par&acirc;metros os atributos cadastrados na consist&ecirc;ncia (no m&aacute;ximo tr&ecirc;s). Em caso de erro, &eacute; exibida ao usu&aacute;rio a mensagem composta pela sub-rotina da aplica&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>&Eacute; poss&iacute;vel determinar o teste de um atributo contra uma sub-rotina no momento de defini&ccedil;&atilde;o do atributo. Neste caso, se for relacionado um segundo teste contra uma sub-rotina, nos testes em n&iacute;vel de estrutura, a consist&ecirc;ncia ir&aacute; disparar as duas sub-rotinas.</FONT> </P>
<FONT SIZE=2><P>A sub-rotina da aplica&ccedil;&atilde;o, utilizada para integra&ccedil;&atilde;o com a consist&ecirc;ncia geral, pode ser totalmente gerada pelo SADS, e se codificada manualmente, deve seguir algumas regras. Todas essas regras est&atilde;o descritas detalhadamente no t&oacute;pico "Interface com aplicativos", nesta se&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>N&atilde;o &eacute; permitida a concatena&ccedil;&atilde;o deste teste com quaisquer outros testes atrav&eacute;s de operadores l&oacute;gicos.</FONT> </P>
<FONT SIZE=2><P>Para cadastramento de teste contra sub-rotina pr&oacute;pria da aplica&ccedil;&atilde;o, os campos da tela que devem ser informados s&atilde;o os seguintes:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SEQ</B> - N&uacute;mero sequencial para posicionamento do teste.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>E/O</B> - Operador l&oacute;gico E/OU utilizado para concatenar os testes quando for necess&aacute;rio passar mais de um atributo como par&acirc;metro para a sub-rotina. </P>
<P>Neste caso deve-se obrigatoriamente informar "E" como operador l&oacute;gico.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>FUN</B> - Fun&ccedil;&atilde;o a ser efetuada sobre o atributo, que deve ser obrigatoriamente informado com "SUB".</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPERANDO1</B> - Mnem&ocirc;nico do atributo a ser passado &agrave; sub-rotina como par&acirc;metro.</FONT> </P>
<FONT SIZE=2><P>Este atributo pode ser um item grupo, composto de v&aacute;rios atributos, sendo que o tamanho total do atributo ou do item grupo deve ser de 23 caracteres, no m&aacute;ximo.</FONT> </P>
<FONT SIZE=2><P>N&atilde;o pode ser informada uma vari&aacute;vel global no campo OPERANDO1.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SUF1</B> - Sufixo do atributo a ser passado como par&acirc;metro, caso ele o possua na estrutura da consist&ecirc;ncia.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPERANDO2</B> - C&oacute;digo da sub-rotina da aplica&ccedil;&atilde;o, no padr&atilde;o SADS (sssSxn).</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SUF2</B> - Sufixo A, B ou C para identificar o atributo par&acirc;metro a ser testado.</FONT> </P>
<FONT SIZE=2><P>Este campo deve ser informado da seguinte forma:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Se for passado apenas um atributo como par&acirc;metro, deve-se informar um sufixo A ou B ou C;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Se forem passados dois atributos como par&acirc;metros para a sub-rotina, deve-se informar sufixo A ou B ou C, um para cada atributo informado.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Se forem passados tr&ecirc;s atributos como par&acirc;metros para a sub-rotina, deve-se informar "A" para o primeiro atributo, "B" para o segundo e "C" para o terceiro.</FONT> </P></DIR>

<FONT SIZE=2><P>Quando for detectado um erro pela sub-rotina da aplica&ccedil;&atilde;o, a mensagem de erro a ser exibida ao usu&aacute;rio &eacute; aquela composta internamente &agrave; sub-rotina da aplica&ccedil;&atilde;o, mesmo quando o teste contra a sub-rotina for cadastrado internamente a um teste condicional (teste SE/ENTAO). </P>
<P>Este exemplo considera que o cadastro de &oacute;rg&atilde;os da empresa est&aacute; armazenado em um <I>dataset</I> e que, para incluir um empregado, &eacute; necess&aacute;rio informar um c&oacute;digo de &oacute;rg&atilde;o cadastrado. Pela tela, vemos que o atributo "EMPCODORG" (C&oacute;digo do &Oacute;rg&atilde;o do Empregado) &eacute; passado como par&acirc;metro para a sub-rotina SRHS01, que testa a exist&ecirc;ncia do &oacute;rg&atilde;o informado.</FONT> </P></DIR>

<P><A NAME="Atrilo"><IMG SRC="Bullet8.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Teste de um atributo contra dados do sistema ou do</B> <B>logon do</B> <B>usu&aacute;rio</A></B></FONT> </P>
<FONT SIZE=2><P>O teste de atributo contra dados do sistema &eacute; utilizado quando se tem necessidade de testar a data e a hora em que a transa&ccedil;&atilde;o est&aacute; sendo efetuada.</FONT> </P>
<FONT SIZE=2><P>O teste de um atributo contra dados do<I> logon</I> &eacute; utilizado quando se deseja garantir que determinados dados, informados pelo usu&aacute;rio na transa&ccedil;&atilde;o, sejam semelhantes &agrave;queles por ele informados no momento do<I> logon</I>.</FONT> </P>
<FONT SIZE=2><P>As vari&aacute;veis globais s&atilde;o os atributos do SADS que tornam dispon&iacute;veis estes testes pela consist&ecirc;ncia. Elas foram preenchidas de acordo com os dados do sistema ou senha do usu&aacute;rio que efetuou o <I>logon</I> na esta&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Para efetuar o cadastramento deste tipo de teste, os campos da tela que devem ser informados s&atilde;o:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SEQ</B> - N&uacute;mero sequencial para posicionamento do teste.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>E/O</B> - Operador l&oacute;gico.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os valores "E" ou "O".</FONT> </P>
<FONT SIZE=2><P>O operador l&oacute;gico n&atilde;o pode ser informado no primeiro teste, pois ele &eacute; utilizado somente para concatena&ccedil;&atilde;o l&oacute;gica do teste em quest&atilde;o com os demais testes anteriores.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>TIP1</B> - Tipo do OPERANDO1, que deve ser "C", para indicar que o mesmo &eacute; um campo/atributo.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPERANDO1</B> - Mnem&ocirc;nico do atributo a ser testado.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SUF1</B> - Sufixo do atributo a ser testado, caso ele o possua na estrutura da consist&ecirc;ncia.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPE</B> - Operador relacional para o teste.</FONT> </P>
<FONT SIZE=2><P>Pode assumir um dos seguintes valores: "EQ", "NE", "GT", "GE", "LT" ou "LE".</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>TIP2</B> - Tipo do OPERANDO2, que deve ser "V", para indicar que o mesmo &eacute; uma vari&aacute;vel global.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPERANDO2</B> - Mnem&ocirc;nico de uma das seguintes vari&aacute;veis globais:</FONT> </P></DIR>

<TABLE BORDER CELLSPACING=1 BORDERCOLOR="#000000" WIDTH=484>
<TR><TD WIDTH="34%" VALIGN="MIDDLE">
<P><B><FONT SIZE=2>VARIAVEL</B></FONT> </TD>
<TD WIDTH="66%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P>DESCRI&Ccedil;&Atilde;O</B></FONT> </TD>
</TR>
<TR><TD WIDTH="34%" VALIGN="MIDDLE">
<P>DATA </TD>
<TD WIDTH="66%" VALIGN="MIDDLE">
<P>Data atual do sistema. </TD>
</TR>
<TR><TD WIDTH="34%" VALIGN="MIDDLE">
<P>DIA </TD>
<TD WIDTH="66%" VALIGN="MIDDLE">
<P>Dia atual do sistema. </TD>
</TR>
<TR><TD WIDTH="34%" VALIGN="MIDDLE">
<P>MES </TD>
<TD WIDTH="66%" VALIGN="MIDDLE">
<P>Mes atual do sistema. </TD>
</TR>
<TR><TD WIDTH="34%" VALIGN="MIDDLE">
<P>ANO</TD>
<TD WIDTH="66%" VALIGN="MIDDLE">
<P>Ano atual do sistema com 2 posi&ccedil;&otilde;es. </TD>
</TR>
<TR><TD WIDTH="34%" VALIGN="MIDDLE">
<P>HORA-MINUTO</TD>
<TD WIDTH="66%" VALIGN="MIDDLE">
<P>Hora/minuto atual do sistema. </TD>
</TR>
<TR><TD WIDTH="34%" VALIGN="MIDDLE">
<P>HORA </TD>
<TD WIDTH="66%" VALIGN="MIDDLE">
<P>Hora atual do sistema. </TD>
</TR>
<TR><TD WIDTH="34%" VALIGN="MIDDLE">
<P>MINUTO </TD>
<TD WIDTH="66%" VALIGN="MIDDLE">
<P>Minuto atual do sistema. </TD>
</TR>
<TR><TD WIDTH="34%" VALIGN="MIDDLE">
<P>EMPCOD ou EMPRESA</TD>
<TD WIDTH="66%" VALIGN="MIDDLE">
<P>C&oacute;digo da empresa da senha do usu&aacute;rio. </TD>
</TR>
<TR><TD WIDTH="34%" VALIGN="MIDDLE">
<P>ESTABELEC ou ETBCOD</TD>
<TD WIDTH="66%" VALIGN="MIDDLE">
<P>C&oacute;digo do estabelecimento da senha do usu&aacute;rio. </TD>
</TR>
<TR><TD WIDTH="34%" VALIGN="MIDDLE">
<P>UNIDADE ou UNDCOD</TD>
<TD WIDTH="66%" VALIGN="MIDDLE">
<P>C&oacute;digo da unidade da senha do usu&aacute;rio. </TD>
</TR>
<TR><TD WIDTH="34%" VALIGN="MIDDLE">
<P>USUARIO ou USUNUM</TD>
<TD WIDTH="66%" VALIGN="MIDDLE">
<P>N&uacute;mero do usu&aacute;rio. </TD>
</TR>
<TR><TD WIDTH="34%" VALIGN="MIDDLE">
<P>NIVELACESSO ou USUNIVACES</TD>
<TD WIDTH="66%" VALIGN="MIDDLE">
<P>N&iacute;vel de acesso da senha do usu&aacute;rio. </TD>
</TR>
</TABLE>
<DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>ERRO</B> - C&oacute;digo da mensagem de erro.</FONT> </P></DIR>

<FONT SIZE=2><P>Este exemplo considera a situa&ccedil;&atilde;o em que uma <I>holding</I> de empresas possui um sistema automatizado de recursos humanos &uacute;nico para todas as empresas do grupo e um setor de pessoal para cada uma delas. Com isso, um funcion&aacute;rio do setor de pessoal s&oacute; pode admitir (incluir) empregados para a empresa na qual trabalha, ou seja, s&oacute; pode incluir empregados cujo c&oacute;digo da empresa &eacute; igual ao c&oacute;digo da empresa para a qual o funcion&aacute;rio do setor de pessoal efetuou o <I>logon</I>. Isto pode ser visto na consist&ecirc;ncia, onde o atributo "EMPCODEMP" (C&oacute;digo da Empresa do Empregado) deve ser igual ao c&oacute;digo da empresa do <I>logon</I> (EMPCOD).</FONT> </P>
<P><A NAME="Atrida"><IMG SRC="Bullet8.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Teste de um atributo para seguran&ccedil;a de acesso aos dados</A></B></FONT> </P>
<FONT SIZE=2><P>Testar um atributo para seguran&ccedil;a de acesso aos dados &eacute; validar se o usu&aacute;rio est&aacute; habilitado a trabalhar com o conte&uacute;do do atributo por ele informado.</FONT> </P>
<FONT SIZE=2><P>Um usu&aacute;rio, para que possa trabalhar com determinados valores de um atributo, deve possuir estes valores cadastrados em suas habilita&ccedil;&otilde;es de elemento no Sistema de Seguran&ccedil;a.</FONT> </P>
<FONT SIZE=2><P>A habilita&ccedil;&atilde;o de elementos para um usu&aacute;rio &eacute; definida em n&iacute;vel de aplicativo e pode ser definida levando-se em considera&ccedil;&atilde;o a empresa, o estabelecimento e a unidade em que o usu&aacute;rio pode efetuar <I>logon</I>.</FONT> </P>
<FONT SIZE=2><P>As habilita&ccedil;&otilde;es de elementos de um usu&aacute;rio est&atilde;o descritas detalhadamente na Se&ccedil;&atilde;o VI, "Sistema de Seguran&ccedil;a", item "Usu&aacute;rios e habilita&ccedil;&otilde;es", neste manual.</FONT> </P>
<FONT SIZE=2><P>&Eacute; importante ressaltar que, os cadastramentos no Sistema de Seguran&ccedil;a s&atilde;o de responsabilidade do administrador de seguran&ccedil;a.</FONT> </P>
<FONT SIZE=2><P>Existem dois tipos de testes de seguran&ccedil;a que podem ser disparados pela consist&ecirc;ncia: o teste "SEG" e o "SGA".</FONT> </P>
<FONT SIZE=2><P>O teste de seguran&ccedil;a "SEG" aciona a sub-rotina de seguran&ccedil;a - SBTS03 -, que verifica se o usu&aacute;rio que efetuou<I> logon</I> na esta&ccedil;&atilde;o est&aacute; habilitado a trabalhar com o conte&uacute;do por ele informado para o atributo (elemento) em um determinado aplicativo. Caso o usu&aacute;rio n&atilde;o tenha habilita&ccedil;&atilde;o para este elemento, a sub-rotina retornar&aacute; uma mensagem de erro.</FONT> </P>
<FONT SIZE=2><P>Para este teste, a consist&ecirc;ncia verifica apenas se o valor (elemento) est&aacute; ou n&atilde;o cadastrado nas habilita&ccedil;&otilde;es do usu&aacute;rio para o aplicativo, desconsiderando o tipo desta habilita&ccedil;&atilde;o. Deste modo, o usu&aacute;rio ser&aacute; considerado habilitado ao elemento, mesmo estando apenas habilitado para consulta (HAB = 0) ou atualiza&ccedil;&atilde;o (HAB = 2).</FONT> </P>
<FONT SIZE=2><P>O teste de seguran&ccedil;a "SGA" aciona a sub-rotina SBTS03 para efetuar o mesmo teste de habilita&ccedil;&atilde;o de elemento. No entanto, obriga que o usu&aacute;rio tenha habilita&ccedil;&atilde;o igual a 2 (Atualizar e consultar) para este elemento. Caso contr&aacute;rio, a sub-rotina retornar&aacute; uma mensagem de erro.</FONT> </P>
<FONT SIZE=2><P>Estes testes garantem ao usu&aacute;rio o direito de trabalhar com um atributo somente com valores para os quais esteja habilitado. </P>
<P>N&atilde;o &eacute; poss&iacute;vel haver concatena&ccedil;&atilde;o dos testes de seguran&ccedil;a com outros testes. </P>
<P>Para cadastramento de um teste de seguran&ccedil;a, os campos da tela que devem ser informados s&atilde;o os seguintes:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SEQ</B> - N&uacute;mero sequencial para posicionamento do teste.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>FUN</B> - Fun&ccedil;&atilde;o a ser efetuada sobre o atributo, que deve ser informado com "SEG" ou "SGA".</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPERANDO1</B> - Mnem&ocirc;nico do atributo a ser testado.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SUF1</B> - Sufixo do atributo a ser testado, caso ele o possua na estrutura da consist&ecirc;ncia.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPERANDO2</B> - C&oacute;digo do aplicativo para o qual dever&aacute; ser verificada a lista de elementos habilitados. </P>
<P>A informa&ccedil;&atilde;o deste c&oacute;digo &eacute; opcional; se n&atilde;o informado, ser&aacute; assumido o aplicativo cujo c&oacute;digo seja igual ao c&oacute;digo da consist&ecirc;ncia (menos o identificador de tipo de elemento "C"), como mostrado a seguir:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>C&oacute;digo da consist&ecirc;ncia: sssCnnnn</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>C&oacute;digo do aplicativo: sssnnnn</FONT> </P></DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>ERRO</B> - C&oacute;digo da mensagem de erro. </P>
<P>&Eacute; opcional; se n&atilde;o for informado ser&aacute; assumido o valor "028" (NAO AUTORIZADO). </P></DIR>

<P>O atributo "EMPCODEMP" (C&oacute;digo da Empresa do Empregado) deve ser validado contra o Sistema de Seguran&ccedil;a. Isto pode significar que o usu&aacute;rio que executou o <I>logon</I> s&oacute; pode executar o acesso aos dados dos empregados lotados nas empresas as quais ele est&aacute; autorizado.</FONT> </P>
<P><A NAME="Atridu"><IMG SRC="Bullet8.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Teste de um atributo contra duplicidade</A></B></FONT> </P>
<FONT SIZE=2><P>Testar duplicidade de atributo &eacute; verificar, nas telas que possuem grupo de ocorr&ecirc;ncias, se foi informado o mesmo valor mais de uma vez para um determinado atributo que faz parte das ocorr&ecirc;ncias. Caso isto seja verdade, a consist&ecirc;ncia enviar&aacute; mensagem de erro.</FONT> </P>
<FONT SIZE=2><P>Para teste de duplicidade de dois ou mais atributos simultaneamente, a facilidade de redefini&ccedil;&atilde;o de atributos deve ser utilizada. Isto porque n&atilde;o &eacute; poss&iacute;vel testar duplicidade de atributos que s&atilde;o itens grupo. Na redefini&ccedil;&atilde;o, os atributos devem estar adjacentes na estrutura.</FONT> </P>
<FONT SIZE=2><P>Este teste pode ser executado para um grupo que cont&eacute;m, no m&aacute;ximo, 99 ocorr&ecirc;ncias.</FONT> </P>
<FONT SIZE=2><P>N&atilde;o &eacute; poss&iacute;vel haver concatena&ccedil;&atilde;o deste teste com outros. </P>
<P>Para cadastramento do teste de duplicidade de atributo, os campos da tela que devem ser informados s&atilde;o:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SEQ</B> - N&uacute;mero sequencial para posicionamento do teste.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>FUN</B> - Fun&ccedil;&atilde;o a ser efetuada sobre o OPERANDO1, que deve ser obrigatoriamente informada "DUP".</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPERANDO1</B> - Mnem&ocirc;nico do atributo a ser testado. </P>
</FONT><P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SUF1</B> - Sufixo do atributo a ser testado, caso ele o possua na estrutura da consist&ecirc;ncia.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>ERRO</B> - C&oacute;digo de mensagem de erro. </P>
<P>&Eacute; opcional; se n&atilde;o informado assumir&aacute; o valor "009" ("EM DUPLICATA").</FONT> </P>
<FONT SIZE=2><P>O atributo "EMPNOMDEPEN" (Nome do dependente do empregado) que ocorre dez vezes na tela n&atilde;o pode estar duplicado, ou seja, n&atilde;o poder&aacute; haver dois ou mais dependentes com o mesmo nome.</FONT> </P></DIR>

<P><A NAME="Atride"><IMG SRC="Bullet8.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Teste de um atributo contra desigualdade</A></B></FONT> </P>
<FONT SIZE=2><P>Testar desigualdade de atributo &eacute; verificar, nas telas que possuem grupo de ocorr&ecirc;ncias, se todas as ocorr&ecirc;ncias preenchidas de um determinado atributo deste grupo cont&eacute;m a mesma informa&ccedil;&atilde;o. Caso isto n&atilde;o seja verdade, a consist&ecirc;ncia enviar&aacute; uma mensagem de erro.</FONT> </P>
<FONT SIZE=2><P>Para teste de desigualdade de dois ou mais atributos simultaneamente, a facilidade de redefini&ccedil;&atilde;o de atributos deve ser utilizada. Isto porque n&atilde;o &eacute; poss&iacute;vel testar desigualdade de atributos que s&atilde;o itens grupo. Na redefini&ccedil;&atilde;o, os atributos devem estar adjacentes na estrutura.</FONT> </P>
<FONT SIZE=2><P>Este teste pode ser executado para um grupo que cont&eacute;m, no m&aacute;ximo, 99 ocorr&ecirc;ncias.</FONT> </P>
<FONT SIZE=2><P>N&atilde;o &eacute; poss&iacute;vel haver concatena&ccedil;&atilde;o deste teste com outros. </P>
<P>Para cadastramento do teste de desigualdade de atributo, os campos da tela que devem ser informados s&atilde;o:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SEQ</B> - N&uacute;mero sequencial para posicionamento do teste.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>FUN</B> - Fun&ccedil;&atilde;o a ser efetuada sobre o OPERANDO1, que deve ser obrigatoriamente informada "DSI".</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPERANDO1</B> - Mnem&ocirc;nico do atributo a ser testado. </P>
</FONT><P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SUF1</B> - Sufixo do atributo a ser testado, caso ele o possua na estrutura da consist&ecirc;ncia.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>ERRO</B> - C&oacute;digo de mensagem de erro. </P>
<P>&Eacute; opcional; se n&atilde;o informado assumir&aacute; o valor "026" ("EM DESIGUALDADE").</FONT> </P></DIR>

<P><A NAME="Atricu"><IMG SRC="Bullet8.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Teste de um atributo contra acumulador</A></B></FONT> </P>
<FONT SIZE=2><P>Testar atributo contra acumulador &eacute; comparar o conte&uacute;do de um atributo da tela com o conte&uacute;do de um acumulador, cujo resultado foi obtido atrav&eacute;s de uma ou v&aacute;rias opera&ccedil;&otilde;es aritm&eacute;ticas com as ocorr&ecirc;ncias de outros atributos da tela.</FONT> </P>
<FONT SIZE=2><P>Para definir este tipo de teste, dever&atilde;o ser preenchidas pelo menos duas sequ&ecirc;ncias de cadastramentos. Na primeira, deve ser definida a opera&ccedil;&atilde;o aritm&eacute;tica a ser efetuada sobre o atributo, a fim de que o resultado seja armazenado no acumulador; na segunda, deve ser definido o teste comparativo de outro atributo da tela contra esse acumulador. Portanto, deve-se definir as opera&ccedil;&otilde;es aritm&eacute;ticas a serem efetuadas sobre um acumulador para que posteriormente seu conte&uacute;do seja validado.</FONT> </P>
<FONT SIZE=2><P>N&atilde;o &eacute; obrigat&oacute;rio, entretanto, que essas duas sequ&ecirc;ncias de cadastramentos sejam sucessivas e nem que o teste contra o acumulador seja definido ap&oacute;s a opera&ccedil;&atilde;o aritm&eacute;tica no acumulador, pois estes testes (testes de conte&uacute;do de acumuladores) s&atilde;o sempre executados por &uacute;ltimo.</FONT> </P>
<FONT SIZE=2><P>Somente atributos com formato num&eacute;rico podem ser utilizados nas opera&ccedil;&otilde;es com acumuladores. Deste modo, n&atilde;o &eacute; permitido efetuar este tipo de teste com itens grupo.</FONT> </P>
<FONT SIZE=2><P>As opera&ccedil;&otilde;es aritm&eacute;ticas a serem executadas em rela&ccedil;&atilde;o ao acumulador n&atilde;o podem ser concatenadas com outros testes e devem ser preenchidas de acordo com as orienta&ccedil;&otilde;es descritas a seguir:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SEQ</B> - N&uacute;mero sequencial para posicionamento do teste.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>FUN</B> - Fun&ccedil;&atilde;o a ser utilizada no teste, que deve ser informada "ACM".</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>TIP1</B> - Tipo do OPERANDO1, que deve ser "C" (Campo/Atributo).</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPERANDO1</B> - Mnem&ocirc;nico do atributo que sofrer&aacute; uma opera&ccedil;&atilde;o aritm&eacute;tica, cujo resultado ser&aacute; armazenado no acumulador.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SUF1</B> - Sufixo do atributo da opera&ccedil;&atilde;o aritm&eacute;tica, caso ele o possua na estrutura da consist&ecirc;ncia.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPE</B> - Operador aritm&eacute;tico.</FONT> </P>
<FONT SIZE=2><P>Pode assumir um dos seguintes valores: "+ ", "- ", "* " ou "/ ".</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>TIP2</B> - Tipo do OPERANDO2, que deve ser "A" (Acumulador).</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPERANDO2 </B>- N&uacute;mero do acumulador, que deve ser informado alinhado &agrave; direita.</FONT> </P>
<FONT SIZE=2><P>Os n&uacute;meros v&aacute;lidos para acumuladores s&atilde;o de 1 a 17.</FONT> </P>
<FONT SIZE=2><P>A valida&ccedil;&atilde;o do conte&uacute;do do acumulador deve ser preenchida de acordo com as orienta&ccedil;&otilde;es a seguir:</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SEQ</B> - N&uacute;mero sequencial para posicionamento do teste.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>TIP1</B> - Tipo do OPERANDO1, que deve ser "C" (Campo/Atributo).</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPERANDO1</B> - Mnem&ocirc;nico do atributo cujo conte&uacute;do ser&aacute; comparado com o do acumulador.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SUF1</B> - Sufixo do atributo a ser comparado, caso ele o possua sufixo na estrutura da consist&ecirc;ncia.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPE</B> - Operador relacional para o teste.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores: "EQ", "NE", "GT", "GE", "LT" e "LE".</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>TIP2</B> - Tipo do OPERANDO2, que deve ser "A" (Acumulador).</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPERANDO2</B> - N&uacute;mero do acumulador a ser validado.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>ERRO</B> - C&oacute;digo da mensagem de erro.</FONT> </P></DIR>

<FONT SIZE=2><P>Neste exemplo, &eacute; apresentada a tela de defini&ccedil;&atilde;o da estrutura da consist&ecirc;ncia e, em seguida, a de valida&ccedil;&atilde;o em n&iacute;vel de estrutura.</FONT> </P>
<FONT SIZE=2><P>A partir da an&aacute;lise da estrutura da consist&ecirc;ncia, pode-se concluir que:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>O atributo "EMPVALDESC" (Valor dos Descontos do Empregado) pertence ao item grupo "EMPITEM", que ocorre 15 vezes;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>O atributo "EMPTOTDESC" (Valor Total de Descontos do Empregado) n&atilde;o pertence ao item grupo "EMPITEM" e est&aacute; definido ap&oacute;s o mesmo.</FONT> </P></DIR>

<FONT SIZE=2><P>Assim, o teste de valida&ccedil;&atilde;o significa que:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>A cada ocorr&ecirc;ncia do atributo "EMPVALDESC", o seu conte&uacute;do ser&aacute; acumulado no acumulador 1;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>O conte&uacute;do do atributo "EMPTOTDESC" deve ser igual ao conte&uacute;do do acumulador 1.</FONT> </P></DIR>

<FONT SIZE=2><P>Isso significa que a soma dos Descontos do Empregado deve ser igual ao Total de Descontos. </P>
<P><A NAME="Quano"><IMG SRC="Bullet8.gif" WIDTH=12 HEIGHT=12><B>Teste de quantidade de ocorr&ecirc;ncias</A></B></FONT> </P>
<FONT SIZE=2><P>Testar quantidade de ocorr&ecirc;ncias &eacute; incrementar uma unidade a um determinado acumulador a cada ocorr&ecirc;ncia de um ou mais atributos.</FONT> </P>
<FONT SIZE=2><P>Este tipo de teste funciona da seguinte forma: pode-se definir, em v&aacute;rias sequ&ecirc;ncias de cadastramentos, os atributos, pertencentes ou n&atilde;o a grupo de ocorr&ecirc;ncia da tela, cujas ocorr&ecirc;ncias ser&atilde;o contadas. Deste modo, em tempo de execu&ccedil;&atilde;o, cada vez que o usu&aacute;rio informar um valor para qualquer um destes atributos, ser&aacute; adicionado 1 (um) ao acumulador determinado. Depois, pode-se ent&atilde;o definir testes do referido acumulador contra uma constante, um campo/atributo ou outro acumulador. </P>
<P>Para definir este tipo de teste contra o mesmo acumulador, dever&atilde;o ser preenchidas pelo menos duas sequ&ecirc;ncias de cadastramentos. A primeira sequ&ecirc;ncia, com a fun&ccedil;&atilde;o "ACM", deve ser preenchida para determinar o campo/atributo a ser testado e o acumulador a ser incrementado em cada uma de suas ocorr&ecirc;ncias. A segunda, para testar o conte&uacute;do deste acumulador.</FONT> </P>
<FONT SIZE=2><P>Um mesmo acumulador pode ser utilizado para testar ocorr&ecirc;ncia de v&aacute;rios atributos cujas ocorr&ecirc;ncias ser&atilde;o nele contabilizadas.</FONT> </P>
<FONT SIZE=2><P>As primeiras sequ&ecirc;ncias, para determinar o incremento do acumulador, devem ser preenchidas de acordo com as orienta&ccedil;&otilde;es a seguir:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SEQ</B> - N&uacute;mero sequencial para posicionamento do teste.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>FUN </B>- Fun&ccedil;&atilde;o a ser efetuada no teste, que deve ser "ACM" (Acumulador).</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>TIP1</B> - Tipo do OPERANDO1, que deve ser "C" (Campo/Atributo).</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPERANDO1</B> - Mnem&ocirc;nico do atributo cujas ocorr&ecirc;ncias ser&atilde;o contabilizadas no acumulador.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SUF1</B> - Sufixo do atributo a ser contabilizado, caso ele o possua na estrutura da consist&ecirc;ncia.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPE</B> - Operador aritm&eacute;tico, que deve ser "#", para incrementar 1 (um) a cada ocorr&ecirc;ncia informada do atributo. </P>
</FONT><P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>TIP2</B> - Tipo do OPERANDO2, que deve ser "A" (Acumulador).</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPERANDO2</B> - N&uacute;mero do acumulador, que deve ser informado alinhado &agrave; direita.</FONT> </P>
<FONT SIZE=2><P>Os n&uacute;meros v&aacute;lidos para acumuladores variam de 1 a 17.</FONT> </P>
<FONT SIZE=2><P>Para testar o conte&uacute;do do acumulador, pode ser definido um teste SE/ENTAO utilizando a fun&ccedil;&atilde;o "MSG".</FONT> </P>
<FONT SIZE=2><P>A primeira sequ&ecirc;ncia do teste SE/ENTAO, utilizando a fun&ccedil;&atilde;o "MSG", deve ser preenchida da seguinte forma:</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SEQ </B>- N&uacute;mero sequencial para posicionamento do teste.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SE/EN</B> - Teste condicional, que deve ser "SE".</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>FUN</B> - Fun&ccedil;&atilde;o a ser efetuada no teste, que deve ser "ACM" (Acumulador).</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>TIP1</B> - Tipo do OPERANDO1, que deve ser "A" (Acumulador).</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPERANDO1</B> - N&uacute;mero do acumulador a ser testado.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPE</B> - Operador aritm&eacute;tico, que deve ser um dos seguintes valores: "EQ", "NE", "GT", "GE", "LT" ou "LE". </P>
</FONT><P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>TIP2</B> - Tipo do OPERANDO2, que deve ser "K" (Constante).</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPERANDO2</B> - Constante contra a qual o acumulador ser&aacute; testado.</FONT> </P>
<FONT SIZE=2><P>A segunda sequ&ecirc;ncia do teste SE/ENTAO, utilizando a fun&ccedil;&atilde;o "MSG", deve ser preenchida da seguinte forma:</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SEQ</B> - N&uacute;mero sequencial para posicionamento do teste.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SE/EN</B> - Teste condicional, que deve ser "EN".</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>FUN</B> - Fun&ccedil;&atilde;o a ser efetuada no teste, que pode ser "MSG" (Mensagem).</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>TIP1</B> - Tipo do OPERANDO1, que deve ser "C" (Campo/atributo).</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPERANDO1</B> - Mnem&ocirc;nico do atributo referente ao qual se deseja enviar a mensagem de erro.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SUF1</B> - Sufixo do atributo, caso ele o possua na estrutura da consist&ecirc;ncia.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>ERRO</B> - C&oacute;digo da mensagem de erro. </P>
<P>Outra forma de testar o conte&uacute;do do acumulador, que foi anteriormente incrementado de acordo com as ocorr&ecirc;ncias de determinado atributo, &eacute; da seguinte forma:</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SEQ</B> - N&uacute;mero sequencial para posicionamento do teste.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>TIP1</B> - Tipo do OPERANDO1, que deve ser "C" (Campo/atributo).</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPERANDO1</B> - Mnem&ocirc;nico do atributo referente ao qual se deseja enviar a mensagem de erro.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SUF1</B> - Sufixo do atributo, caso ele o possua na estrutura da consist&ecirc;ncia.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPE</B> - Operador aritm&eacute;tico, que deve ser um dos seguintes valores: "EQ", "NE", "GT", "GE", "LT" ou "LE". </P>
</FONT><P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>TIP2</B> - Tipo do OPERANDO2, que deve ser "A" (Acumulador).</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPERANDO2</B> - N&uacute;mero do acumulador que ser&aacute; testado.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>ERRO</B> - C&oacute;digo da mensagem de erro. </P></DIR>

<P>Neste exemplo, &eacute; apresentada a tela com a estrutura da consist&ecirc;ncia e, em seguida, a tela de valida&ccedil;&atilde;o em n&iacute;vel de estrutura. Para se entender os testes de valida&ccedil;&atilde;o descritos a seguir, &eacute; necess&aacute;rio entender a estrutura da consist&ecirc;ncia a qual ela se refere.</FONT> </P>
<FONT SIZE=2><P>Da an&aacute;lise da estrutura da consist&ecirc;ncia, conclui-se que:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>O atributo "EMPCODVERBA" (C&oacute;digo da Verba do Empregado) pertence ao item grupo "EMPITEM", que ocorre 15 vezes.</FONT> </P></DIR>

<FONT SIZE=2><P>O teste de valida&ccedil;&atilde;o significa que pelo menos uma verba do empregado tem de ser informada.</FONT> </P>
<FONT SIZE=2><P>A mensagem de erro ser&aacute; apresentada para a ocorr&ecirc;ncia "01" do atributo que est&aacute; sendo testado. Exemplo: "EMPCODVERBA-01 (CODIGO DA VERBA DO EMPREGADO) NAO INFORMADO".</FONT> </P>
<P><A NAME="Defgru"><IMG SRC="Bullet8.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Defini&ccedil;&atilde;o de grupo opcional</A></B></FONT> </P>
<FONT SIZE=2><P>Definir grupo opcional &eacute; identificar o conjunto de atributos cont&iacute;guos que tenham entre si depend&ecirc;ncia de obrigatoriedade, ou seja, se algum atributo do grupo for informado, os que forem obrigat&oacute;rios tamb&eacute;m dever&atilde;o s&ecirc;-lo. Por&eacute;m, se nenhum dos atributos do grupo forem informados, at&eacute; os obrigat&oacute;rios poder&atilde;o ser deixados em branco.</FONT> </P>
<FONT SIZE=2><P>A defini&ccedil;&atilde;o de um grupo opcional &eacute; efetuada a partir da identifica&ccedil;&atilde;o dos atributos lim&iacute;trofes do conjunto.</FONT> </P>
<FONT SIZE=2><P>&Eacute; poss&iacute;vel criar um grupo opcional dentro de outro grupo, ou seja, &eacute; poss&iacute;vel criar testes com fun&ccedil;&otilde;es GOP englobando atributos de um mesmo intervalo de outro teste GOP.</FONT> </P>
<FONT SIZE=2><P>O resultado da defini&ccedil;&atilde;o de um grupo opcional &eacute; o seguinte:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Se nenhum dos atributos pertencentes ao intervalo do grupo for informado, n&atilde;o ser&aacute; executado nenhum teste de consist&ecirc;ncia em todos eles; </P>
</FONT><P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Se pelo menos um deles for informado, todos ser&atilde;o consistidos normalmente.</FONT> </P></DIR>

<FONT SIZE=2><P>Desta forma, mesmo se houver atributos obrigat&oacute;rios no grupo, se nenhum deles for informado, o grupo estar&aacute; v&aacute;lido e a consist&ecirc;ncia n&atilde;o acusar&aacute; erro.</FONT> </P>
<FONT SIZE=2><P>Para definir grupos opcionais, os campos da tela que devem ser preenchidos s&atilde;o:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SEQ</B> - N&uacute;mero sequencial para posicionamento do teste.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>FUN</B> - Fun&ccedil;&atilde;o a ser efetuada no teste, que deve ser informada "GOP".</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPERANDO1</B> - Mnem&ocirc;nico do primeiro atributo que comp&otilde;e o grupo opcional.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SUF1</B> - Sufixo do primeiro atributo que comp&otilde;e o grupo, se ele o possuir na estrutura da consist&ecirc;ncia.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPERANDO2</B> - Mnem&ocirc;nico do &uacute;ltimo atributo que comp&otilde;e o grupo opcional.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SUF2</B> - Sufixo do &uacute;ltimo atributo que comp&otilde;e o grupo, se ele o possuir na estrutura da consist&ecirc;ncia.</FONT> </P></DIR>

<FONT SIZE=2><P>O exemplo a seguir ilustra este tipo de teste:</FONT> </P>
<FONT SIZE=2><P>Considerando que o endere&ccedil;o residencial do empregado &eacute; composto dos seguintes atributos:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>"EMPRUARES" (Nome da Rua da Resid&ecirc;ncia do Empregado) (Obrigat&oacute;rio);</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>"EMPNUMRES" (N&uacute;mero da Resid&ecirc;ncia do Empregado) (Obrigat&oacute;rio) e</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>"EMPAPTRES" (N&uacute;mero do Apartamento da Resid&ecirc;ncia do Empregado) (Opcional), pode-se definir um grupo opcional para assegurar que:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Se o atributo "EMPRUARES" for informado, o atributo "EMPNUMRES" tamb&eacute;m ter&aacute; de ser informado;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Se o atributo "EMPNUMRES" for informado, o atributo "EMPRUARES" tamb&eacute;m ter&aacute; de ser informado;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Se o atributo "EMPAPTRES" for informado, os atributos "EMPRUARES" e "EMPNUMRES" tamb&eacute;m ter&atilde;o de ser informados;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Se nenhum atributo for informado, n&atilde;o ser&aacute; exigido informar qualquer um deles.</FONT> </P></DIR>
</DIR>

<P><A NAME="Conatri"><IMG SRC="Bullet8.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Testes condicionais entre atributos</A></B></FONT> </P>
<FONT SIZE=2><P>Definir teste condicional entre atributos &eacute; validar o conte&uacute;do de um atributo ou mais atributos de acordo com o conte&uacute;do de outros atributos.</FONT> </P>
<FONT SIZE=2><P>Este condicionamento &eacute; definido a partir das cl&aacute;usulas SE e ENTAO, da seguinte forma:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Na cl&aacute;usula SE se define as condi&ccedil;&otilde;es sob as quais devem ser testados os atributos definidos na cl&aacute;usula ENTAO;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>A cl&aacute;usula ENTAO, portanto, define os testes pelos quais os outros atributos t&ecirc;m de ser avaliados, caso a condi&ccedil;&atilde;o definida na cl&aacute;usula SE seja verdadeira.</FONT> </P></DIR>

<FONT SIZE=2><P>Assim, se a cl&aacute;usula SE for verdadeira e os atributos n&atilde;o passarem pelos testes para eles definidos na cl&aacute;usula ENTAO, ser&aacute; enviada uma mensagem de erro. Esta ser&aacute; enviada para o atributo que estiver informado no campo OPERANDO1 da linha onde for preenchido o c&oacute;digo do erro.</FONT> </P>
<FONT SIZE=2><P>A defini&ccedil;&atilde;o de testes condicionais requer que se efetuem pelo menos dois testes - um para a cl&aacute;usula SE e outro para a cl&aacute;usula ENTAO. Podem ser informados at&eacute; 99 testes nas cl&aacute;usulas SE e 99 nas cl&aacute;usulas ENTAO, onde cada um pode se referir a um atributo distinto.</FONT> </P>
<FONT SIZE=2><P>Para o cadastramento dos testes condicionais, os campos da tela que devem ser informados s&atilde;o:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SEQ</B> - N&uacute;mero sequencial para posicionamento do teste.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SE/EN</B> - Indicador de teste condicional.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"SE" - Para discriminar as condi&ccedil;&otilde;es de realiza&ccedil;&atilde;o dos testes condicionais;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"EN" - Para discriminar os testes a serem realizados caso as condi&ccedil;&otilde;es sejam verdadeiras.</FONT> </P></DIR>

<FONT SIZE=2><P>No caso de um dos atributos da cl&aacute;usula "SE" pertencer a um grupo de ocorr&ecirc;ncias, mesmo que os atributos da cl&aacute;usula "EN" estejam fora das ocorr&ecirc;ncias, o teste ser&aacute; executado para todas as ocorr&ecirc;ncias dos atributos da cl&aacute;usula "SE", e vice-versa.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>E/O</B> - Operador l&oacute;gico.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os valores "E" ou "O". </P>
<P>O operador l&oacute;gico n&atilde;o pode ser informado no primeiro teste, ele &eacute; utilizado para a concatena&ccedil;&atilde;o de outros testes.</FONT> </P>
<FONT SIZE=2><P>O operador l&oacute;gico deve ser informado nos seguintes casos:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Quando o atributo tiver de ser testado contra um conjunto de valores, sejam eles tabelas, sub-rotinas, constantes ou outros atributos, ou </P>
</FONT><P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Quando os testes da cl&aacute;usula SE ou ENTAO sejam referentes a diferentes atributos.</FONT> </P></DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>TIP1</B> - Tipo do OPERANDO1.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os valores "A" (Acumulador) ou "C" (Campo/atributo).</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPERANDO1</B> - Mnem&ocirc;nico do atributo ou acumulador a ser testado.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SUF1</B> - Sufixo do atributo a ser testado, caso o OPERANDO1 seja um atributo ou campo e possua sufixo na estrutura da consist&ecirc;ncia.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPE</B> - Operador relacional para o teste.</FONT> </P>
<FONT SIZE=2><P>Pode assumir um dos seguintes valores: "EQ", "NE", "GT", "GE", "LT" ou "LE".</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>TIP2</B> - Tipo do OPERANDO2.</FONT> </P>
<FONT SIZE=2><P>Pode assumir um dos seguintes valores: "A" (Acumulador), "C" (Campo/Atributo), "K" (Constante) ou "V" (Vari&aacute;vel Global).</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>OPERANDO2</B> - Operando do teste.</FONT> </P>
<FONT SIZE=2><P>Este campo &eacute; informado de acordo com o tipo do operando, da seguinte forma:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Para tipo "A" - Um acumulador;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Para tipo "K" - Uma constante;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Para tipo "C" - Um campo ou atributo;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Para tipo "V" - Uma vari&aacute;vel global.</FONT> </P></DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SUF2</B> - Sufixo do atributo a ser testado, caso o OPERANDO2 seja um atributo ou campo e possua sufixo na estrutura da consist&ecirc;ncia.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>ERRO</B> - C&oacute;digo da mensagem de erro. A mensagem de erro ser&aacute; enviada referente ao atributo em cuja sequ&ecirc;ncia o c&oacute;digo de erro foi informado .Este c&oacute;digo da mensagem de erro pode ser informado para o atributo com teste na cl&aacute;usula SE, ou para o atributo com teste na cl&aacute;usula EN, ou para todos os atributos com teste na cl&aacute;usula EN.</FONT> </P></DIR>

<B><FONT SIZE=5><P><A NAME="Libcon">Libera&ccedil;&atilde;o de consist&ecirc;ncia</A></B></FONT> </P>
<FONT SIZE=2><P>Liberar a consist&ecirc;ncia &eacute; torn&aacute;-la dispon&iacute;vel para utiliza&ccedil;&atilde;o no ambiente para o qual est&aacute; sendo liberada, teste ou produ&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>A consist&ecirc;ncia deve ser liberada nos seguintes momentos:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Ap&oacute;s ter sido cadastrada;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Ap&oacute;s terem sido efetuadas manuten&ccedil;&otilde;es no seu cadastro, em sua estrutura ou em seus testes em n&iacute;vel de estrutura;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Ap&oacute;s terem sido alteradas as defini&ccedil;&otilde;es e/ou validades dos atributos que fazem parte de sua estrutura.</FONT> </P></DIR>

<FONT SIZE=2><P>As consist&ecirc;ncias s&atilde;o feitas de forma interpretativa, de tal forma que uma nova libera&ccedil;&atilde;o n&atilde;o implica em gera&ccedil;&atilde;o e compila&ccedil;&atilde;o de programa.</FONT> </P>
<FONT SIZE=2><P>Para liberar uma consist&ecirc;ncia para a produ&ccedil;&atilde;o, &eacute; necess&aacute;rio, primeiro, que ela esteja liberada para teste.</FONT> </P>
<FONT SIZE=2><P>Esta libera&ccedil;&atilde;o para produ&ccedil;&atilde;o torna a consist&ecirc;ncia dispon&iacute;vel para o ambiente de produ&ccedil;&atilde;o da mesma m&aacute;quina onde ela foi liberada.</FONT> </P>
<FONT SIZE=2><P>A libera&ccedil;&atilde;o de uma tela para produ&ccedil;&atilde;o implica na libera&ccedil;&atilde;o autom&aacute;tica da consist&ecirc;ncia a ela associada.</FONT> </P>
<FONT SIZE=2><P>Ao liberar uma consist&ecirc;ncia para a produ&ccedil;&atilde;o, s&atilde;o gerados par&acirc;metros com <I>status </I>de produ&ccedil;&atilde;o. Por&eacute;m, os par&acirc;metros de teste ainda permanecem dispon&iacute;veis para o ambiente de teste e simula&ccedil;&atilde;o. </P>
<P>Se se dispuser de um computador diferente para processamento dos sistemas em produ&ccedil;&atilde;o, os seguintes procedimentos devem ser efetuados para liberar a consist&ecirc;ncia para produ&ccedil;&atilde;o:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Executar o job SD/D/JB/70 na m&aacute;quina de desenvolvimento;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Copiar o arquivo SS/C/AF/71 para a m&aacute;quina de produ&ccedil;&atilde;o;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Executar o job SD/D/JB/72 na m&aacute;quina de produ&ccedil;&atilde;o.</FONT> </P></DIR>

<FONT SIZE=2><P>Estes jobs processam extra&ccedil;&atilde;o de consist&ecirc;ncias e telas liberadas para produ&ccedil;&atilde;o. Portanto, na execu&ccedil;&atilde;o do SD/D/JB/70, tamb&eacute;m ser&atilde;o gerados os arquivos SS/S/AF/70 e SS/S/AF/72, com as telas liberadas.</FONT> </P>
<FONT SIZE=2><P>Se alguma tela ou consist&ecirc;ncia tiver sido liberada indevidamente para produ&ccedil;&atilde;o e se houver um computador diferente para processamento dos sistemas em produ&ccedil;&atilde;o, sua transfer&ecirc;ncia para a m&aacute;quina de produ&ccedil;&atilde;o pode ser cancelada atrav&eacute;s do menu CANTRANSF. Maiores detalhes sobre esta transa&ccedil;&atilde;o est&atilde;o descritos na se&ccedil;&atilde;o III, "Fun&ccedil;&otilde;es de Apoio", neste manual.</FONT> </P>
<FONT SIZE=2><P>Para efetuar a libera&ccedil;&atilde;o da consist&ecirc;ncia para teste, &eacute; necess&aacute;rio que sua estrutura esteja cadastrada no reposit&oacute;rio de dados do SADS.</FONT> </P>
<FONT SIZE=2><P>A libera&ccedil;&atilde;o de consist&ecirc;ncia n&atilde;o est&aacute; associada a nenhuma tela de processamento. Portanto, para efetu&aacute;-la, basta transmitir os argumentos do menu de opera&ccedil;&atilde;o "LIBCON", cujos campos est&atilde;o explicados a seguir:</FONT> </P>
<B><FONT SIZE=2><P>CAMPOS DA TELA</B></FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Consistencia</B> - C&oacute;digo da consist&ecirc;ncia a ser liberada.</FONT> </P>
<FONT SIZE=2><P>O c&oacute;digo da consist&ecirc;ncia deve ser informado no padr&atilde;o SADS (sssCnnnn).</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Ambiente</B> - Ambiente para o qual a consist&ecirc;ncia ser&aacute; liberada.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"T" (Teste);</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"P" (Produ&ccedil;&atilde;o).</FONT> </P></DIR>

<FONT SIZE=2><P>Caso o ambiente n&atilde;o seja informado, ser&aacute; assumido o ambiente <I>default</I> do usu&aacute;rio. Detalhes sobre o cadastramento do ambiente <I>default</I> do usu&aacute;rio podem ser obtidos na se&ccedil;&atilde;o VI, "Sistema de Seguran&ccedil;a", item "Usu&aacute;rios e habilita&ccedil;&otilde;es".</FONT> </P></DIR>

<B><FONT SIZE=5><P><A NAME="Simcon">Simula&ccedil;&atilde;o de consist&ecirc;ncia</A></B></FONT> </P>
<FONT SIZE=2><P>Simular a consist&ecirc;ncia &eacute; disparar sua execu&ccedil;&atilde;o sem que seja disparado o processamento da transa&ccedil;&atilde;o a ela associada.</FONT> </P>
<FONT SIZE=2><P>&Eacute; poss&iacute;vel simular consist&ecirc;ncia apenas de telas - incluindo telas de par&acirc;metros de <I>jobs</I>-, visto que as consist&ecirc;ncias de tabelas, uma vez constru&iacute;das, j&aacute; podem ser testadas diretamente no Sistema de Tabelas.</FONT> </P>
<FONT SIZE=2><P>J&aacute; a partir da simula&ccedil;&atilde;o da consist&ecirc;ncia de uma tela &eacute; poss&iacute;vel test&aacute;-la sem que haja a necessidade de o programa associado &agrave; tela ter sido constru&iacute;do.</FONT> </P>
<FONT SIZE=2><P>O simulador de consist&ecirc;ncias, uma vez detectado um erro no preenchimento do dado pelo usu&aacute;rio, ir&aacute; apresentar a mensagem relativa ao erro encontrado e ir&aacute; posicionar o cursor no primeiro caractere do atributo da tela ao qual a mensagem se refere. Atrav&eacute;s da observa&ccedil;&atilde;o do posicionamento do cursor, quaisquer incompatibilidades entre o desenho da tela e a estrutura da consist&ecirc;ncia poder&atilde;o ser identificadas. </P>
<P>Caso o usu&aacute;rio tenha solicitado a simula&ccedil;&atilde;o com retorno dos dados, al&eacute;m da mensagem de erro, todos os dados que foram submetidos &agrave; consist&ecirc;ncia ser&atilde;o devolvidos, por&eacute;m, j&aacute; convertidos para o formato que os programas ir&atilde;o receb&ecirc;-los em tempo de execu&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>&Eacute; muito importante executar a simula&ccedil;&atilde;o toda vez que a consist&ecirc;ncia tiver sido alterada, a fim de efetuar uma checagem das validades do atributo. </P>
<P>A simula&ccedil;&atilde;o pode ser efetuada no ambiente de teste ou produ&ccedil;&atilde;o. O desenho da tela dispon&iacute;vel no ambiente de teste pode ser diferente daquele dispon&iacute;vel no ambiente de produ&ccedil;&atilde;o. O mesmo pode acontecer com os testes da consist&ecirc;ncia. Por&eacute;m, a consist&ecirc;ncia liberada para um determinado ambiente deve estar compat&iacute;vel com o desenho da tela associada a ela neste mesmo ambiente.</FONT> </P>
<FONT SIZE=2><P>O <I>help on-line</I> est&aacute; dispon&iacute;vel para apresentar as validades definidas para os atributos que forem preenchidos incorretamente na simula&ccedil;&atilde;o da consist&ecirc;ncia.</FONT> </P>
<FONT SIZE=2><P>Para simular consist&ecirc;ncia no ambiente de teste ou produ&ccedil;&atilde;o, a consist&ecirc;ncia e sua tela associada devem estar liberadas para o ambiente desejado.</FONT> </P>
<FONT SIZE=2><P>No momento da simula&ccedil;&atilde;o, ser&aacute; apresentada a tela associada &agrave; consist&ecirc;ncia para preenchimento dos campos. Estes devem ser preenchidos a fim de que a consist&ecirc;ncia valide todos os testes cadastrados.</FONT> </P>
<P>A simula&ccedil;&atilde;o de consist&ecirc;ncia n&atilde;o est&aacute; associada a nenhuma tela de processamento. Para efetu&aacute;-la, basta transmitir o menu de opera&ccedil;&atilde;o "SIMCON", cujos campos est&atilde;o explicados a seguir: </P>
<B><FONT SIZE=2><P>CAMPOS DA TELA</B></FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Consistencia</B> - C&oacute;digo da consist&ecirc;ncia a ser simulada, no padr&atilde;o SADS (sssCnnnn)</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Estado</B> - Ambiente da tela e da consist&ecirc;ncia na simula&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Os valores poss&iacute;veis s&atilde;o os seguintes: </P><DIR>

</FONT><P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"T" (Teste);</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"P"(Produ&ccedil;&atilde;o).</FONT> </P></DIR>

<FONT SIZE=2><P>Caso o ambiente n&atilde;o seja informado, ser&aacute; assumido o ambiente <I>default</I> do usu&aacute;rio. Detalhes sobre o cadastramento do ambiente <I>default</I> do usu&aacute;rio podem ser obtidos na se&ccedil;&atilde;o VI, "Sistema de Seguran&ccedil;a", item "Usu&aacute;rios e habilita&ccedil;&otilde;es".</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Retorno dos dados</B> - Indicador de que os dados, ap&oacute;s os ajustes efetuados na consist&ecirc;ncia, sejam novamente apresentados no momento da simula&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Pode-se informar "S", para haver retorno dos dados.</FONT> </P></DIR>

<B><FONT SIZE=5><P><A NAME="Funca">Fun&ccedil;&otilde;es de apoio</A></B></FONT> </P>
<P><HR></P>
<B><FONT SIZE=5><P><A NAME="Gener">Gen&eacute;ricas aplic&aacute;veis &agrave;s consist&ecirc;ncias</A></B></FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Utilit&aacute;rios:</B></FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Descri&ccedil;&atilde;o de elemento;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Duplica&ccedil;&atilde;o de elemento;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Ressequenciamento de estrutura de elemento;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Importa&ccedil;&atilde;o de descri&ccedil;&atilde;o de elemento;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Exporta&ccedil;&atilde;o de descri&ccedil;&atilde;o de elemento.</FONT> </P></DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Consultas:</B></FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Estrutura de dados de um determinado elemento;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Validades de atributos por estrutura.</FONT> </P></DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Informativos impressos:</B></FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Lista estrutura de dados;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Lista validades de atributos por estrutura.</FONT> </P></DIR>
</DIR>

<FONT SIZE=2><P>Todos estes utilit&aacute;rios, consultas e informativos impressos, encontram-se detalhadamente descritos na Se&ccedil;&atilde;o III, "Fun&ccedil;&otilde;es de apoio", neste manual.</FONT> </P>
<B><FONT SIZE=5><P><A NAME="Interf">Interface com aplicativos</A></B></FONT> </P>
<FONT SIZE=2><P>A interface dos aplicativos com a consist&ecirc;ncia geral do SADS pode ser efetuada pelo <I>host</I>, pelo programa chamado e tamb&eacute;m por sub-rotinas espec&iacute;ficas do aplicativo.</FONT> </P>
<FONT SIZE=2><P>Podem ser criados novos c&oacute;digos de mensagens de erros a serem enviados pela consist&ecirc;ncia, bem como pode-se tamb&eacute;m parametrizar como ser&aacute; composta todas as mensagens de erro a serem enviadas pela consist&ecirc;ncia. </P>
<P>A seguir, ser&atilde;o explicados os seguintes t&oacute;picos, para detalhamento da interface da consist&ecirc;ncia geral com os aplicativos: </P><DIR>

</FONT><P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><A HREF="#Dispco">Disparo da consist&ecirc;ncia</A><FONT SIZE=2>;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><A HREF="#Subapl">Sub-rotina espec&iacute;fica da aplica&ccedil;&atilde;o a ser chamada pela consist&ecirc;ncia</A><FONT SIZE=2>;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><A HREF="#Cadmen">Cadastramento de mensagens de erro pr&oacute;prias do aplicativo</A><FONT SIZE=2>;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><A HREF="#Forme">Formato das mensagens de erro</A><FONT SIZE=2>.</FONT> </P></DIR>

<B><FONT SIZE=4><P><A NAME="Dispco">Disparo da consist&ecirc;ncia</A></B></FONT> </P>
<FONT SIZE=2><P>As consist&ecirc;ncias das telas menu e de processamento da transa&ccedil;&atilde;o s&oacute; podem ser disparadas automaticamente pelo programa <I>host</I>. Para dispar&aacute;-las pelo programa chamado, devem ser utilizados os comandos de m&oacute;dulo, descritos no item "Programa", nesta se&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Caso seja informado "S" no campo "CONSISTE TRANSACAO" da tela de defini&ccedil;&atilde;o do menu, o pr&oacute;prio <I>host</I> ir&aacute; disparar a sub-rotina de consist&ecirc;ncia. Caso contr&aacute;rio, se informado "N" neste campo, a sub-rotina dever&aacute; ser disparada internamente ao aplicativo.</FONT> </P>
<FONT SIZE=2><P>O cadastramento do menu, onde se define se a consist&ecirc;ncia de uma transa&ccedil;&atilde;o ser&aacute; acionada pelo <I>host</I> ou pelo programa chamado, est&aacute; explicado detalhadamente no item "Menu", nesta se&ccedil;&atilde;o.</FONT> </P>
<B><FONT SIZE=2><P><A NAME="Dispho">Disparo da consist&ecirc;ncia pelo host</A></B></FONT> </P>
<FONT SIZE=2><P>Sempre que no cadastramento de um menu estiver declarado que a consist&ecirc;ncia geral ser&aacute; acionada pelo <I>host</I>, o SADS ir&aacute; gerar o <I>host</I> e o programa chamado da seguinte forma:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>No fonte do <I>host</I> ser&atilde;o gerados os controles necess&aacute;rios para o disparo da execu&ccedil;&atilde;o da consist&ecirc;ncia;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>No fonte do programa chamado ser&aacute; gerado um comando de movimenta&ccedil;&atilde;o dos dados que foram tratados pela consist&ecirc;ncia para a &aacute;rea de mensagem do programa:</FONT> </P>
<PRE>
MOVE SSC-AREACOM TO MENSAGEM.</PRE></DIR>

<FONT SIZE=2><P>Este comando pode ser gerado nos par&aacute;grafos TRATAR-MENU e/ou TRATAR-TRANSACAO, e esta gera&ccedil;&atilde;o depende do cadastramento do menu:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Quando a consist&ecirc;ncia da tela menu for disparada pelo <I>host</I>, este comando ser&aacute; gerado no m&oacute;dulo TRATAR-MENU, na fase de prepara&ccedil;&atilde;o da tela do programa.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Quando a consist&ecirc;ncia da tela da transa&ccedil;&atilde;o for disparada pelo <I>host</I>, este comando ser&aacute; gerado no m&oacute;dulo TRATAR-TRANSACAO, na fase de processamento dos dados da tela.</FONT> </P></DIR>

<FONT SIZE=2><P>No entanto, quando estiver declarado no menu que as consist&ecirc;ncias das telas de menu e de processamento de uma transa&ccedil;&atilde;o n&atilde;o ser&atilde;o acionadas pelo <I>host</I>, o SADS n&atilde;o gera nenhum comando para disparar a execu&ccedil;&atilde;o dessa consist&ecirc;ncia ou para recuperar dados. Neste caso, atrav&eacute;s de comandos de m&oacute;dulos, deve ser codificada a chamada &agrave; sub-rotina de consist&ecirc;ncia internamente ao programa chamado. Os comandos de m&oacute;dulos est&atilde;o detalhadamente descritos no item "Programa", nesta se&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>&Eacute; aconselh&aacute;vel que as consist&ecirc;ncias sejam sempre disparadas pelo<I> host </I>do sistema, pois isto acarretar&aacute; melhor performance, j&aacute; que, quando a consist&ecirc;ncia &eacute; acionada pelo programa chamado, &eacute; necess&aacute;rio fazer um <I>link</I> da sub-rotina de consist&ecirc;ncia com este programa.</FONT> </P>
<B><FONT SIZE=2><P><A NAME="Dispro">Disparo da consist&ecirc;ncia pelo programa chamado</A></B></FONT> </P>
<FONT SIZE=2><P>Quando estiver declarado no menu que as consist&ecirc;ncias das telas de menu e de processamento de uma transa&ccedil;&atilde;o n&atilde;o ser&atilde;o acionadas pelo <I>host</I>, o SADS n&atilde;o gera nenhum comando para disparar a execu&ccedil;&atilde;o dessa consist&ecirc;ncia. Neste caso, atrav&eacute;s de comandos de m&oacute;dulos, deve ser codificada a chamada &agrave; sub-rotina de consist&ecirc;ncia internamente ao programa chamado.</FONT> </P>
<FONT SIZE=2><P>Para a defini&ccedil;&atilde;o destes comandos, devem ser utilizados os comandos de m&oacute;dulos "COB" ou "EDIT", descritos detalhadamente no item "Programa", nesta se&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Os comandos que acionam a consist&ecirc;ncia s&atilde;o:</FONT> </P>
<PRE>
PERFORM 93000-00-CONSISTENCIA THRU 93000-99-EXIT.
IF  SSC-QTDERRO GREATER 0
    MOVE GBL-TELA-ERROS TO MENSAGEM
    GO TO 99000-99-EXIT-PROGRAM
ELSE
    MOVE SSC-AREACOM    TO MENSAGEM.</PRE>
<FONT SIZE=2><P>O par&aacute;grafo 93000-00-CONSISTENCIA est&aacute; codificado em uma library gen&eacute;rica do SADS, SB/P/PL/53, que est&aacute; dispon&iacute;vel para todos os programas <I>on-line</I> gerados pelo SADS.</FONT> </P>
<FONT SIZE=2><P>Atrav&eacute;s destes comandos, a consist&ecirc;ncia recebe os dados informados na tela, faz as convers&otilde;es e os testes definidos para os mesmos e os retorna convertidos para o programa em uma &aacute;rea global, SSC-AREACOM. O programa, ent&atilde;o, testa se foi detectado algum erro de preenchimento dos dados pela consist&ecirc;ncia. Caso afirmativo, ele envia a tela de erros ao usu&aacute;rio; caso contr&aacute;rio, ele movimenta os dados contidos na &aacute;rea global para a &aacute;rea de mensagem, para posterior tratamento dos mesmos.</FONT> </P>
<FONT SIZE=2><P>Para que os programas que chamam diretamente a consist&ecirc;ncia possam utilizar o <I>help</I> para um campo espec&iacute;fico, eles devem ter, ap&oacute;s a chamada da consist&ecirc;ncia, os seguintes comandos:</FONT> </P>
<PRE>
IF CS0102-PCGINDHLP EQUAL 1
   MOVE "HELP"    TO MENSAGEM
   MOVE 4      TO H-TAMANHO
   MOVE 9 TO GBL-STATUS
   GO TO 99000-99-EXIT-PROGRAM.</PRE>
<FONT SIZE=2><P>Detalhes sobre <I>help</I> para um campo espec&iacute;fico est&atilde;o descritos na se&ccedil;&atilde;o I, "Ajuda <I>on-line</I>" e na se&ccedil;&atilde;o V, "Parametriza&ccedil;&otilde;es do SADS", neste manual. </P>
<P>&Eacute; aconselh&aacute;vel que as consist&ecirc;ncias sejam sempre disparadas pelo <I>host</I> do sistema, pois isto acarretar&aacute; melhor performance, j&aacute; que, quando a consist&ecirc;ncia &eacute; acionada pelo programa chamado, &eacute; necess&aacute;rio fazer um <I>link </I>da sub-rotina de consist&ecirc;ncia com este programa.</FONT> </P>
<B><FONT SIZE=4><P><A NAME="Subapl">Sub-rotina espec&iacute;fica da aplica&ccedil;&atilde;o a ser chamada pela consist&ecirc;ncia</A></B></FONT> </P>
<FONT SIZE=2><P>A utiliza&ccedil;&atilde;o de uma sub-rotina espec&iacute;fica da aplica&ccedil;&atilde;o &eacute; um recurso que o SADS oferece a seus usu&aacute;rios. Atrav&eacute;s dele, torna-se poss&iacute;vel efetuar testes que n&atilde;o podem ser definidos na consist&ecirc;ncia geral. Desta forma, pode-se evitar que estes testes tenham de ser codificados em v&aacute;rios programas aplicativos.</FONT> </P>
<FONT SIZE=2><P>Os testes desta sub-rotina podem ser contra cadastro (integridade referencial), que s&atilde;o testes espec&iacute;ficos de uma determinada aplica&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Para utilizar este recurso, deve-se cadastrar, na defini&ccedil;&atilde;o do atributo ou nos testes em n&iacute;vel de estrutura da consist&ecirc;ncia, o teste do atributo contra sub-rotina pr&oacute;pria da aplica&ccedil;&atilde;o. O cadastramento deste teste encontra-se descrito no t&oacute;pico "Teste de atributo contra sub-rotina da aplica&ccedil;&atilde;o", neste item.</FONT> </P>
<FONT SIZE=2><P>Al&eacute;m disso, a sub-rotina da aplica&ccedil;&atilde;o, que ser&aacute; acionada pela sub-rotina de consist&ecirc;ncia, deve estar cadastrada no reposit&oacute;rio de dados e seu c&oacute;digo objeto deve residir no mesmo <I>pack</I> e <I>usercode</I> das sub-rotinas SADS.</FONT> </P>
<FONT SIZE=2><P>Para entendimento deste exemplo, considere que o cadastro de &oacute;rg&atilde;os da empresa est&aacute; armazenado em um <I>dataset</I> e que para incluir um empregado em um determinado cadastro seja necess&aacute;rio efetuar algumas valida&ccedil;&otilde;es.</FONT> </P>
<FONT SIZE=2><P>Pelo cadastramento exibido, v&ecirc;-se que os dois atributos, EMPDATADM (Data de Admiss&atilde;o do Empregado) e EMPCODORG (C&oacute;digo do &Oacute;rg&atilde;o do Empregado), s&atilde;o passados como par&acirc;metro para a sub-rotina SRHS01. Esta efetua os testes necess&aacute;rios, e, em caso de erro, retorna uma mensagem que &eacute; exibida ao usu&aacute;rio pela sub-rotina de consist&ecirc;ncia.</FONT> </P>
<FONT SIZE=2><P>Uma sub-rotina disparada pela consist&ecirc;ncia geral, gerada pelo SADS, segue algumas regras, que tamb&eacute;m devem ser seguidas, caso esta sub-rotina seja codificada manualmente. S&atilde;o elas:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>O Program-id da sub-rotina tem de ser SBPS99.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>O nome da sub-rotina tem de estar no padr&atilde;o SADS, sssSxx. Como exemplo, temos para o sistema SRH a sub-rotina SRHS01, relativa ao fonte SR/H/SF/01.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>A &aacute;rea de comunica&ccedil;&atilde;o com a consist&ecirc;ncia geral deve ser inserida no fonte desta sub-rotina atrav&eacute;s do comando:</FONT> </P>
<FONT SIZE=2><P>COPY "SB/P/SL/99" FROM 200000 THRU 299999.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>A library "SB/P/SL/99", que ser&aacute; inclu&iacute;da, possui as seguintes declara&ccedil;&otilde;es:</FONT> </P>
<PRE>
01  PS9901 RECEIVED BY REFERENCE.
    05  PS9901-OPCAO            PIC 9(01).
    05  PS9901-ELEMENTO         PIC X(08).
    05  PS9901-DADOS.
        10  PS9901-DADOSA       PIC X(23).
        10  PS9901-DADOSB       PIC X(23).
        10  PS9901-DADOSC       PIC X(23).
    05  PS9901-RESPOSTA         PIC X(18).
    05  PS9901-RESPOSTA-RED     REDEFINES PS9901-RESPOSTA.
        10  PS9901-EMPRESA      PIC 9(03).
        10  PS9901-ESTABELEC    PIC 9(03).
        10  PS9901-ESTABELEC2   PIC 9(03).
        10  PS9901-TRANSACAO.
            15  PS9901-SISTEMA  PIC X(03).
            15  PS9901-MENU     PIC X(02).
            15  PS9901-NUMTRANS PIC X(02).
        10  PS9901-USUAMBI      PIC X(01)
        10 FILLER               PIC 9(01).
   05   PS9901-ESTABELEC4        PIC 9(04).</PRE>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>A consist&ecirc;ncia passa, no m&aacute;ximo, tr&ecirc;s par&acirc;metros (atributos ou campos), que s&atilde;o definidos nos testes em n&iacute;vel de estrutura, para a sub-rotina espec&iacute;fica da aplica&ccedil;&atilde;o;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Cada par&acirc;metro pode ser um atributo ou um item grupo. Seu tamanho, no entanto, pode ser de, no m&aacute;ximo, 23 caracteres.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Se houver necessidade de se passar mais de tr&ecirc;s par&acirc;metros para a sub-rotina, deve-se utilizar a facilidade de cadastramento de itens grupos de redefini&ccedil;&otilde;es na estrutura da consist&ecirc;ncia.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>A consist&ecirc;ncia passa para a sub-rotina o conte&uacute;do dos atributos par&acirc;metros sempre alinhados &agrave; esquerda, independente se forem alfanum&eacute;ricos ou num&eacute;ricos.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Os campos EMPRESA, ESTABELECIMENTO,UNIDADE e AMBIENTE da senha do usu&aacute;rio e o campo TRANSACAO (formado pelo c&oacute;digo do sistema, c&oacute;digo do menu e n&uacute;mero da transa&ccedil;&atilde;o relativos ao c&oacute;digo da consist&ecirc;ncia para a qual foi cadastrado o teste) s&atilde;o passados automaticamente para a sub-rotina.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>O conte&uacute;do do atributo testado contra uma sub-rotina com sufixo A estar&aacute; armazenado em PS9901-DADOSA. O conte&uacute;do do atributo testado com sufixo B estar&aacute; armazenado em PS9901-DADOSB. O conte&uacute;do do atributo testado com sufixo C estar&aacute; armazenado em PS9901-DADOSC.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Os campos PS9901-DADOSA, PS9901-DADOSB e/ou PS9901-DADOSC assumir&atilde;o valores igual a NULL se aos sufixos A, B e/ou C, respectivamente, n&atilde;o forem associados atributos.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Na PROCEDURE DIVISION, a sub-rotina dever&aacute;:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Receber as informa&ccedil;&otilde;es contidas na &aacute;rea de comunica&ccedil;&atilde;o para as valida&ccedil;&otilde;es necess&aacute;rias;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Fazer os testes necess&aacute;rios;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Sempre que houver uma condi&ccedil;&atilde;o de erro, a sub-rotina dever&aacute;:</FONT> </P><DIR>

<P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Mover 9 para PS9901-OPCAO e</FONT> </P>
<P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Compor a mensagem do erro no campo PS9901-RESPOSTA da &aacute;rea de comunica&ccedil;&atilde;o.</FONT> </P></DIR>
</DIR>
</DIR>

<FONT SIZE=2><P>Se os campos acima forem compostos conforme descritos, a consist&ecirc;ncia geral, ao receber PS9901-OPCAO igual a 9, ir&aacute; exibir a mensagem de erro contida na PS9901-RESPOSTA na tela.<BR>
A seguir, &eacute; apresentado um exemplo de codifica&ccedil;&atilde;o de uma sub-rotina pr&oacute;pria da aplica&ccedil;&atilde;o - SR/H/SF/01 - que ser&aacute; acionada pela consist&ecirc;ncia geral:</FONT> </P>
<PRE>
$ FEDLEVEL = 5
$ SHARING = SHAREDBYALL
 IDENTIFICATION DIVISION.
 PROGRAM-ID.    SBPS99.
 AUTHOR.        ANALISTA DE SISTEMAS.
 DATE-WRITTEN.  20/01/93 @ 09:10:36.

 ENVIROMENT DIVISION.
 CONFIGURATION SECTION.
 SPECIAL-NAMES.
     DECIMAL-POINT IS COMMA.
 INPUT-OUTPUT SECTION.
 FILE-CONTROL.
 DATA DIVISION.
 DATA-BASE SECTION.
     COPY SR/H/BL/00 FROM 300000 THRU 399999.
 01  SRHB01
$ PAGE

 WORKING-STORAGE SECTION.
 77  CHV-OPEN                           PIC X(01) VA "N".

 01  AREA-WORK.
     05  WSG-DADOS-A.
         10  WSG-DADOS-A1              PIC 9(06).
         10  WSG-DADOS-A2              PIC X(17).
     05  WSG-DADOS-B.
         10  WSG-DADOS-B1              PIC 9(06).
         10  WSG-DADOS-B2              PIC X(17).
     05  WSG-DADOS-C.
         10  WSG-DADOS-C1              PIC 9(04).
         10  WSG-DADOS-C2              PIC X(19).

     COPY "SB/P/SL/99" FROM 200000 THRU 299999.
$ PAGE

 PROCEDURE DIVISION USING PS9901.

 10004-00-INICIO.

      IF  CHV-OPEN EQUAL "S"
          GO TO 10004-10-PROCESSAMENTO.

                *** ABRIR BANCO ***

      MOVE "S" TO CHV-OPEN.
      COPY "SR/H/BL/00" FROM 400000 THRU 499999.

 10004-10-PROCESSAMENTO.

      MOVE PS9901-DADOSA               TO WSG-DADOS-A.
      MOVE PS9901-DADOSB               TO WSG-DADOS-B.
      MOVE PS9901-DADOSC               TO WSG-DADOS-C.
      MOVE 0                           TO PS9901-OPCAO.

      IF  WSG-DADOS-A1 LESS 930101
          MOVE 9                       TO PS9901-OPCAO
          MOVE "DATA INICIO MENOR "    TO PS9901-RESPOSTA
      ELSE
      IF  WSG-DADOS-B1 GREATER 931231
          MOVE 9                       TO PS9901-OPCAO
          MOVE "DATA FIM MAIOR  "      TO PS9901-RESPOSTA
      ELSE
          FIND KEY OF FIRST SRHB01A AT
              H0100-ORGCOD = WSG-DADOS-C1
          ON  EXCEPTION
          IF  DMSTATUS(NOTFOUND)
              MOVE 9                   TO PS9901-OPCAO
              MOVE "ORG. N&Atilde;O EXISTE "  TO PS9901-RESPOSTA
          ELSE
              MOVE SPACES              TO CHV-OPEN
              DISPLAY "EXCECAO FATAL - DMS - SRHSF01"
              DISPLAY "CATEGORIA   "   DMSTATUS(DMCATEGORY)
              DISPLAY "SUBCATEGORIA"   DMSTATUS(DMERRORTYPE)
              DISPLAY "ESTRUTURA   "   DMSTATUS(DMSTRUTUCRE)
              SET MYSELF(STATUS) TO -1
              EXIT PROGRAM.

      EXIT PROGRAM.</PRE>
<B><FONT SIZE=4><P><A NAME="Cadmen">Cadastramento de mensagens de erro pr&oacute;prias do aplicativo</A></B></FONT> </P>
<FONT SIZE=2><P>A consist&ecirc;ncia oferece 28 (vinte e oito) mensagens de erro gen&eacute;ricas, que podem ser utilizadas nos cadastramentos dos testes em n&iacute;vel de estrutura. Estas mensagens est&atilde;o descritas no t&oacute;pico "Testes em n&iacute;vel de estrutura", neste item. Caso estas mensagens n&atilde;o atendam a uma situa&ccedil;&atilde;o espec&iacute;fica, pode-se cadastrar uma tabela com mensagens pr&oacute;prias do sistema.</FONT> </P>
<FONT SIZE=2><P>A tabela de mensagens a ser cadastrada deve obedecer as seguintes regras:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>O c&oacute;digo da tabela deve estar no seguinte padr&atilde;o:</FONT> </P>
<B><FONT SIZE=2><P>"sssM9900"</B> onde:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><B><FONT SIZE=2>"sss"</B> &eacute; o c&oacute;digo do sistema;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><B><FONT SIZE=2>"M"</B> &eacute; o elemento identificador de tabela "M" e</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><B><FONT SIZE=2>"9900"</B> &eacute; a constante identificadora de tabela de erros.</FONT> </P></DIR>

<FONT SIZE=2><P>Exemplo: SRHM9900.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>A tabela dever&aacute; conter dois campos de <I>input</I>, que s&atilde;o o c&oacute;digo e a descri&ccedil;&atilde;o da mensagem.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>A tabela n&atilde;o pode ser definida com crit&eacute;rio de unidade de armazenamento, ou seja, n&atilde;o pode ser armazenada por EMPRESA, ESTABELECIMENTO e/ou UNIDADE.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>O c&oacute;digo da mensagem, que &eacute; a chave da tabela, dever&aacute; ter tr&ecirc;s caracteres (tamanho 3) e dever&aacute; ser um n&uacute;mero maior que 50.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>A descri&ccedil;&atilde;o da mensagem deve ter 18 caracteres.</FONT> </P></DIR>

<B><FONT SIZE=4><P><A NAME="Forme">Formato das mensagens de erro</A></B></FONT> </P>
<FONT SIZE=2><P>Para cada <I>host</I> do sistema, a consist&ecirc;ncia de suas telas pode apresentar uma ou duas mensagens de erro ao usu&aacute;rio. Este n&uacute;mero de mensagens a serem apresentadas deve ser parametrizado no momento de cadastramento do <I>host</I>, no campo "LINHAS P/ MENSAGEM DE ERRO".</FONT> </P>
<FONT SIZE=2><P>Cada uma destas mensagens sempre se referem a um atributo da estrutra da consist&ecirc;ncia e pode ser composta pelas seguintes informa&ccedil;&otilde;es, nesta mesma ordem:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Mnem&ocirc;nico do atributo;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Sufixo do atributo;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>N&uacute;mero da ocorr&ecirc;ncia do atributo na primeira dimens&atilde;o da tabela, caso ele perten&ccedil;a a uma tabela;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>N&uacute;mero da ocorr&ecirc;ncia do atributo na segunda dimens&atilde;o da tabela, caso ele perten&ccedil;a a uma tabela bidimensional; </P>
</FONT><P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Nome do atributo;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Cabe&ccedil;alho do atributo;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Descri&ccedil;&atilde;o do erro.</FONT> </P></DIR>

<FONT SIZE=2><P>As informa&ccedil;&otilde;es necess&aacute;rias &agrave; identifica&ccedil;&atilde;o de atributos que aparecem mais de uma vez na tela s&atilde;o mostradas na mensagem de erro, como por exemplo, da seguinte forma:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>"FUNCOD-1 (13 , 6 ) (COD. FUNCIONARIO) INVALIDO"</B> onde:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><B><FONT SIZE=2>"FUNCOD"</B> &eacute; o Mnem&ocirc;nico do atributo;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><B><FONT SIZE=2>"-1"</B> &eacute; sufixo do atributo;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><B><FONT SIZE=2>"(13"</B> &eacute; N&uacute;mero da ocorr&ecirc;ncia na primeira dimens&atilde;o;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><B><FONT SIZE=2>"6)"</B> &eacute; o n&uacute;mero da ocorr&ecirc;ncia na segunda dimens&atilde;o;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><B><FONT SIZE=2>"(COD.FUNCIONARIO)"</B> &eacute; o nome do atributo e</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><B><FONT SIZE=2>"INV&Aacute;LIDO"</B> &eacute; a descri&ccedil;&atilde;o do erro.</FONT> </P></DIR>
</DIR>

<FONT SIZE=2><P>A descri&ccedil;&atilde;o do erro ("INVALIDO", no exemplo acima) sempre ser&aacute; apresentada na mensagem.</FONT> </P>
<FONT SIZE=2><P>Por&eacute;m, a forma de composi&ccedil;&atilde;o das mensagens de erro poder&atilde;o ser parametrizadas por sistema, distintamente para os ambientes de teste e produ&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Desta forma, o mnem&ocirc;nico, nome e cabe&ccedil;alho do atributo poder&atilde;o ser usados na forma&ccedil;&atilde;o das mensagens de erro, de acordo com uma das seguintes combina&ccedil;&otilde;es:</FONT> </P><DIR>

<FONT SIZE=2><P>MNEM&Ocirc;NICO + NOME</FONT> </P>
<FONT SIZE=2><P>MNEM&Ocirc;NICO + CABE&Ccedil;ALHO</FONT> </P>
<FONT SIZE=2><P>NOME ou</FONT> </P>
<FONT SIZE=2><P>CABE&Ccedil;ALHO</FONT> </P></DIR>

<FONT SIZE=2><P>Esta parametriza&ccedil;&atilde;o deve ser definida na tabela SBPM5004, especificando os seguintes campos:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>SISTEMA</B> - C&oacute;digo do sistema para o qual o formato das mensagens de erro de consist&ecirc;ncia ser&aacute; definido.</FONT> </P>
<FONT SIZE=2><P>Deve-se informar sistema "SBC" caso se queira definir formato gen&eacute;rico das mensagens da instala&ccedil;&atilde;o.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>TESTE</B></FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><B><FONT SIZE=2>MNEMONICO</B> - Indicador de exibi&ccedil;&atilde;o do mnem&ocirc;nico do atributo relativo &agrave; mensagem de erro no ambiente de teste.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"S" - Para que o mnem&ocirc;nico do atributo seja exibido junto &agrave; mensagem de erro no ambiente de teste;</FONT> </P>
<P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>" " - Para que o mnem&ocirc;nico do atributo n&atilde;o seja exibido junto &agrave; mensagem de erro no ambiente de teste.</FONT> </P></DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><B><FONT SIZE=2>CABECALHO</B> - Indicador de exibi&ccedil;&atilde;o do cabe&ccedil;alho do atributo relativo &agrave; mensagem de erro no ambiente de teste.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"S" - Para que o cabe&ccedil;alho do atributo seja exibido junto &agrave; mensagem de erro no ambiente de teste;</FONT> </P>
<P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>" " - Para que o cabe&ccedil;alho do atributo n&atilde;o seja exibido junto &agrave; mensagem de erro no ambiente de teste.</FONT> </P></DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><B><FONT SIZE=2>NOME</B> - Indicador de exibi&ccedil;&atilde;o do nome do atributo relativo &agrave; mensagem de erro no ambiente de teste.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"S" - Para que o nome do atributo seja exibido junto &agrave; mensagem de erro no ambiente de teste;</FONT> </P>
<P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>" " - Para que o nome do atributo n&atilde;o seja exibido junto &agrave; mensagem de erro no<BR>
ambiente de teste.</FONT> </P></DIR>
</DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>PRODUCAO</B></FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><B><FONT SIZE=2>MNEMONICO</B> - Indicador de exibi&ccedil;&atilde;o do mnem&ocirc;nico do atributo relativo &agrave; mensagem de erro no ambiente de produ&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"S" - Para que o mnem&ocirc;nico do atributo seja exibido junto &agrave; mensagem de erro no ambiente de produ&ccedil;&atilde;o;</FONT> </P>
<P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>" " - Para que o mnem&ocirc;nico do atributo n&atilde;o seja exibido junto &agrave; mensagem de erro no ambiente de produ&ccedil;&atilde;o.</FONT> </P></DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><B><FONT SIZE=2>CABECALHO</B> - Indicador de exibi&ccedil;&atilde;o do cabe&ccedil;alho do atributo relativo &agrave; mensagem de erro no ambiente de produ&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"S" - Para que o cabe&ccedil;alho do atributo seja exibido junto &agrave; mensagem de erro no ambiente de produ&ccedil;&atilde;o;</FONT> </P>
<P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>" " - Para que o cabe&ccedil;alho do atributo n&atilde;o seja exibido junto &agrave; mensagem de erro no ambiente de produ&ccedil;&atilde;o.</FONT> </P></DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><B><FONT SIZE=2>NOME</B> - Indicador de exibi&ccedil;&atilde;o do nome do atributo relativo &agrave; mensagem de erro no ambiente de produ&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"S" - Para que o nome do atributo seja exibido junto &agrave; mensagem de erro no ambiente de produ&ccedil;&atilde;o;</FONT> </P>
<P><IMG SRC="Bullet9.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>" " - Para que o nome do atributo n&atilde;o seja exibido junto &agrave; mensagem de erro no ambiente de produ&ccedil;&atilde;o.</FONT> </P></DIR>

<FONT SIZE=2><P>Os campos "CABECALHO" e "NOME" n&atilde;o podem ser selecionados simultaneamente.</FONT> </P>
<FONT SIZE=2><P>O campo "MNEMONICO" n&atilde;o pode ser a &uacute;nica informa&ccedil;&atilde;o a ser selecionada.</FONT> </P></DIR>
</DIR>

<FONT SIZE=2><P>A seguir, ser&atilde;o apresentadas algumas mensagens de erro que podem ser apresentadas de acordo com a parametriza&ccedil;&atilde;o adotada na tabela SBPM5004.</FONT> </P>
<FONT SIZE=2><P>Nos exemplos apresentados, foi considerado um atributo cadastrado com as seguintes informa&ccedil;&otilde;es:</FONT> </P>
<PRE>
        Mnem&ocirc;nico - FUNCOD
        Cabe&ccedil;alho - FUNCIONARIO
        Nome      - CODIGO DO FUNCIONARIO</PRE>
<FONT SIZE=2><P>1) Tabela : MNEMONICO = "S", CABECALHO = "S" e NOME = " "</FONT> </P><DIR>

<FONT SIZE=2><P>Exemplos: "FUNCOD (FUNCIONARIO) INVALIDO"</FONT> </P>
<FONT SIZE=2><P>"FUNCOD - 1 (FUNCIONARIO) INVALIDO"</FONT> </P>
<FONT SIZE=2><P>"FUNCOD - 1 (26) (FUNCIONARIO) INVALIDO"</FONT> </P>
<FONT SIZE=2><P>"FUNCOD - 1 (1,3) (FUNCIONARIO) INVALIDO" </P></DIR>

<P>2) Tabela : MNEMONICO = " ", CABECALHO = "S" e NOME = " " </P><DIR>

<P>Exemplos: "(FUNCIONARIO) INVALIDO"</FONT> </P>
<FONT SIZE=2><P>"(FUNCIONARIO) - 1 INVALIDO"</FONT> </P>
<FONT SIZE=2><P>"(FUNCIONARIO) - 1 (26) INVALIDO"</FONT> </P>
<FONT SIZE=2><P>"(FUNCIONARIO) - 1 (1,3) INVALIDO"</P></DIR>

<P>3) Tabela : MNEMONICO = "S", CABECALHO = " " e NOME = "S" </P><DIR>

<P>Exemplos: "FUNCOD (CODIGO DO FUNCIONARIO) INVALIDO"</FONT> </P>
<FONT SIZE=2><P>"FUNCOD - 1 (CODIGO DO FUNCIONARIO) INVALIDO"</FONT> </P>
<FONT SIZE=2><P>"FUNCOD - 1 (26) (CODIGO DO FUNCIONARIO) INVALIDO"</FONT> </P>
<FONT SIZE=2><P>"FUNCOD - 1 (1,3) (CODIGO DO FUNCIONARIO) INVALIDO"</FONT> </P></DIR>

<FONT SIZE=2><P>4) Tabela : MNEMONICO = " ", CABECALHO = " " e NOME = "S" </P><DIR>

<P>Exemplos: "(CODIGO DO FUNCIONARIO) INVALIDO"</FONT> </P>
<FONT SIZE=2><P>"(CODIGO DO FUNCIONARIO) - 1 INVALIDO"</FONT> </P>
<FONT SIZE=2><P>"(CODIGO DO FUNCIONARIO) - 1 (26) INVALIDO"</FONT> </P>
<FONT SIZE=2><P>"(CODIGO DO FUNCIONARIO) - 1 (1,3) INVALIDO"</FONT> </P></DIR>

<B><FONT SIZE=5><P><A NAME="Algor">Algoritmos para c&aacute;lculo de d&iacute;gito verificador m&oacute;dulo 10 e m&oacute;dulo 11</A></B></FONT> </P>
<P><HR></P>
<FONT SIZE=2><P>Os algoritmos utilizados pelo SADS para c&aacute;lculo do d&iacute;gito verificador m&oacute;dulo 10 e 11 est&atilde;o descritos nos t&oacute;picos a seguir.</FONT> </P>
<FONT SIZE=2><P>N&atilde;o existe uma padroniza&ccedil;&atilde;o geral para estes algoritmos que seja adotada igualmente por todas as instala&ccedil;&otilde;es e formas de utiliza&ccedil;&atilde;o.</FONT> </P>
<B><FONT SIZE=4><P><A NAME="Calc0">C&aacute;lculo do d&iacute;gito m&oacute;dulo 10</A></B></FONT> </P>
<FONT SIZE=2><P>O SADS calcula o d&iacute;gito verificador m&oacute;dulo 10, segundo as seguintes considera&ccedil;&otilde;es:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>O n&uacute;mero que ter&aacute; o d&iacute;gito verificador calculado deve ter o tamanho m&aacute;ximo de 23 caracteres, sendo o &uacute;ltimo caractere o d&iacute;gito verificador;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>O vetor utilizado pelo SADS para o c&aacute;lculo tem o tamanho de 22 caracteres e o seguinte valor:</FONT> </P><DIR>

<FONT SIZE=2><P>"1212121212121212121212".</FONT> </P></DIR>
</DIR>

<FONT SIZE=2><P>O algoritmo utilizado pelo SADS para o c&aacute;lculo do d&iacute;gito verificador m&oacute;dulo 10 &eacute;:</FONT> </P>
<PRE>
In&iacute;cio
        Iniciar SOMA-TOTAL com 0;
        Alinhar o n&uacute;mero que ter&aacute; seu d&iacute;gito testado &agrave; direita;
        Fa&ccedil;a, para todos os d&iacute;gitos do n&uacute;mero, partindo do pen&uacute;ltimo    d&iacute;gito do valor at&eacute; o primeiro:
                Multiplique o d&iacute;gito do n&uacute;mero pelo d&iacute;gito
                correspondente do vetor "1212121212121212121212";
                Some os dois d&iacute;gitos do resultado da multiplica&ccedil;&atilde;o;
                Acumule o resultado da soma em SOMA-TOTAL;
        Fim-Fa&ccedil;a;
        Se o &uacute;ltimo d&iacute;gito de SOMA-TOTAL for diferente de 0
                Ent&atilde;o
                  Subtrai o &uacute;ltimo d&iacute;gito de SOMA-TOTAL de 10
                  DIGITO-CALCULADO &eacute; o resultado da subtra&ccedil;&atilde;o
                Sen&atilde;o
                  DIGITO-CALCULADO &eacute; o &uacute;ltimo d&iacute;gito de SOMA-TOTAL;
        Fim-se;
Fim.</PRE>
<B><FONT SIZE=4><P><A NAME="Calc1">C&aacute;lculo do d&iacute;gito m&oacute;dulo 11</A></B></FONT> </P>
<FONT SIZE=2><P>O SADS calcula o d&iacute;gito verificador m&oacute;dulo 11, segundo o seguintes considera&ccedil;&otilde;es:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>O n&uacute;mero que ter&aacute; o d&iacute;gito verificador calculado deve ter o tamanho m&aacute;ximo de 23 caracteres, sendo o &uacute;ltimo caractere o d&iacute;gito verificador;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>O vetor utilizado pelo SADS para o c&aacute;lculo tem o tamanho de 22 caracteres e o seguinte valor:</FONT> </P><DIR>

<FONT SIZE=2><P>"7654329876543298765432".</FONT> </P></DIR>
</DIR>

<FONT SIZE=2><P>O algoritmo utilizado pelo SADS para o c&aacute;lculo de d&iacute;gito verificador m&oacute;dulo 11 &eacute;:</FONT> </P>
<PRE>
In&iacute;cio
        Iniciar SOMA-TOTAL com 0;
        Alinhar o n&uacute;mero que ter&aacute; seu d&iacute;gito testado &agrave; direita;
        Fa&ccedil;a, para todos os d&iacute;gitos do n&uacute;mero, partindo do pen&uacute;ltimo    d&iacute;gito do valor at&eacute; o primeiro:
        Multiplique o d&iacute;gito do n&uacute;mero pelo d&iacute;gito correspondente do
        vetor "7654329876543298765432" e acumule o resultado da
        multiplica&ccedil;&atilde;o em SOMA-TOTAL;
        Fim-Fa&ccedil;a;
        Divida SOMA-TOTAL por 11, guarde o resto da divis&atilde;o em RESTO;
        Se RESTO for diferente de 0
                Ent&atilde;o
                  Subtrai o RESTO de 11;
                  DIGITO-CALCULADO &eacute; o resultado da subtra&ccedil;&atilde;o;
                Sen&atilde;o
                  DIGITO-CALCULADO &eacute; o RESTO (0);
        Fim-se;
Fim.</PRE></BODY>
</HTML>
