<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft Word 97">
<TITLE>GLOSSARI</TITLE>
<META NAME="Template" CONTENT="J:\MSOFFICE\OFFICE\html.dot">
</HEAD>
<BODY LINK="#0000ff" VLINK="#800080" BACKGROUND="DOC_B.GIF">
<basefont size=2>
<B><FONT SIZE=6><P>Gloss&aacute;rio</B></FONT> </P>
<P><HR></P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B> Ajuda <I>on-line</I> (<I>help</I>)</B> - Fun&ccedil;&atilde;o que o SADS oferece, em tempo de execu&ccedil;&atilde;o, para o esclarecimento de d&uacute;vidas e erros. A ajuda <I>on-line</I> est&aacute; presente em todas as fases do desenvolvimento de sistemas, com a finalidade de agilizar o uso da ferramenta. </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> An&aacute;lise de dados</B> - Conjunto de t&eacute;cnicas, com abordagens pr&oacute;prias, que possibilitam a identifica&ccedil;&atilde;o e modelagem das informa&ccedil;&otilde;es e dos dados envolvidos no projeto de um sistema.</FONT> </P>
<FONT SIZE=2><P>Os elementos da an&aacute;lise de dados englobam todos aqueles definidos quando da elabora&ccedil;&atilde;o do Diagrama de Entidades e Relacionamentos Estendido (DER-E) - entidades, relacionamentos, hierarquias de generaliza&ccedil;&atilde;o, atributos, sin&ocirc;nimos e dom&iacute;nios.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> An&aacute;lise estruturada ou an&aacute;lise funcional </B>- Conjunto de t&eacute;cnicas que, com a utiliza&ccedil;&atilde;o de ferramentas apropriadas - ferramentas gr&aacute;ficas e textos formais -, tem o objetivo de gerar a especifica&ccedil;&atilde;o funcional do sistema, composta de m&oacute;dulos que traduzem a realidade com uma vis&atilde;o essencialmente l&oacute;gica, de um modo formal, n&atilde;o amb&iacute;guo e estruturado.</FONT> </P>
<FONT SIZE=2><P>A an&aacute;lise estruturada fornece uma op&ccedil;&atilde;o eficiente para o desenvolvimento de sistemas a partir do estudo das fun&ccedil;&otilde;es e processos envolvidos no mesmo.</FONT> </P>
<FONT SIZE=2><P>Os elementos da an&aacute;lise funcional englobam todos aqueles definidos quando da elabora&ccedil;&atilde;o do Diagrama Hier&aacute;rquico-Funcional e do Diagrama de Fluxo de Dados - fun&ccedil;&atilde;o/processo, fluxo de dados, entidade externa e dep&oacute;sito de dados.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Aplicativo (Aplica&ccedil;&atilde;o)</B> - Sistema que pode ser desenvolvido por usu&aacute;rios SADS com a finalidade de controlar um conjunto de dados e procedimentos. Tamb&eacute;m referenciado neste manual como sendo sistema aplicativo.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> &Aacute;rea conversacional </B>- Conjunto ou estrutura de atributos/campos definido em n&iacute;vel de sistema aplicativo com o objetivo de armazenar e transferir dados entre as transa&ccedil;&otilde;es de uma esta&ccedil;&atilde;o.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> &Aacute;rea de comunica&ccedil;&atilde;o da sub-rotina</B> - Conjunto de atributos/campos que ser&aacute; utilizado para transfer&ecirc;ncia de informa&ccedil;&otilde;es entre a sub-rotina e os programas que far&atilde;o chamada &agrave; mesma. Esta &aacute;rea deve conter os par&acirc;metros de entrada, fornecidos pelos programas, e os par&acirc;metros de sa&iacute;da, fornecidos pela sub-rotina.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> &Aacute;rea de trabalho (&aacute;rea de work)</B> - Conjunto de atributos/campos que poder&atilde;o ser utilizados na <I>working-storage section</I> de sub-rotinas, programas <I>host,</I> programas<I> on-line e batch</I>. Nos programas <I>on-line</I>, as &aacute;reas de trabalho podem assumir outras caracter&iacute;sticas, ou seja, podem ser utilizadas como &aacute;rea conversacional e &aacute;rea global, isto se a mesma <I>library</I> for utilizada no <I>host</I> no qual ser&aacute; feito o <I>binder</I> do programa.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> &Aacute;rea global de comunica&ccedil;&atilde;o</B> - &Aacute;rea comum entre os programas <I>on-line</I> e o programa <I>host</I> a eles associado, que pode ser utilizada para transfer&ecirc;ncia de informa&ccedil;&otilde;es entre os mesmos.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> &Aacute;rea global de comunica&ccedil;&atilde;o </B>- &Aacute;rea comum entre os programas aplicativos e o Sistema de Seguran&ccedil;a, onde as informa&ccedil;&otilde;es do usu&aacute;rio e suas habilita&ccedil;&otilde;es ficam dispon&iacute;veis para serem utilizadas pelos aplicativos.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Arquivo (convencional)</B> - Arquivo &eacute; um conjunto de dados armazenados, geralmente de forma tempor&aacute;ria, e que ser&atilde;o processados pelo sistema.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Atributo</B> - Dado elementar que caracteriza, identifica, classifica ou qualifica uma entidade. No reposit&oacute;rio de dados do SADS, o atributo &eacute; identificado pelo seu sistema e c&oacute;digo (mnem&ocirc;nico).</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Atributos globais </B>- Atributos definidos como pertencentes ao SADS e que, por isso mesmo, podem ser utilizados por quaisquer sistemas aplicativos. Para utiliz&aacute;-los, basta indicar que seu n&iacute;vel de defini&ccedil;&atilde;o &eacute; "G" (NDEF = "G").</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Atributo de v&iacute;deo</B> - Atributo utilizado para determinar a apar&ecirc;ncia do campo no desenho da tela. Ele &eacute; definido atrav&eacute;s de alguns comandos de teclado.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Atributo provis&oacute;rio</B> - Atributo cadastrado na estrutura da entidade (com NDEF = "P") sem ter, por&eacute;m, suas caracter&iacute;sticas definidas no reposit&oacute;rio de dados.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Banco de dados</B> - Conjunto de dados que se relacionam e que est&atilde;o distribu&iacute;dos em um ou mais arquivos, aos quais s&atilde;o permitidos acessos simult&acirc;neos por diferentes aplica&ccedil;&otilde;es.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Banco de dados f&iacute;sico</B> - Para o SADS, banco de dados f&iacute;sico &eacute; um banco composto por <I>datasets</I>.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Banco de dados l&oacute;gico</B> - Para o SADS, banco de dados l&oacute;gico &eacute; um banco composto por <I>remaps</I>.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Base de dados </B>- A base de dados compreende os bancos de dados e <I>datasets</I> a serem utilizados pelos <I>hosts</I>, programas <I>batch</I> e sub-rotinas de um sistema.</FONT> </P>
<FONT SIZE=2><P>Uma base de dados pode ser gen&eacute;rica para todo o sistema, possuindo at&eacute; dois bancos de dados, ou espec&iacute;fica por elemento(s) do sistema, com at&eacute; dez bancos de dados. Desta forma, os elementos de um sistema - <I>hosts</I>, programas <I>batch</I> e sub-rotinas - podem utilizar diferentes bases de dados, que podem ser espec&iacute;ficas para cada um deles ou espec&iacute;ficas para um grupo deles.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><I><FONT SIZE=2> Binder</B></I> - Processo atrav&eacute;s do qual diferentes objetos de programas s&atilde;o agregados a um programa <I>host</I> com a finalidade de formar um &uacute;nico objeto execut&aacute;vel. Os programas <I>on-line</I> desenvolvidos no padr&atilde;o SADS n&atilde;o funcionam isoladamente e, portanto, para se tornarem execut&aacute;veis, devem ser agregados aos seus respectivos <I>hosts</I> atrav&eacute;s do <I>binder</I>.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Bloqueio de usu&aacute;rio</B> - Impedimento a que o usu&aacute;rio efetue <I>logon</I> para abrir uma sess&atilde;o de trabalho no SADS e, consequentemente, processe qualquer aplicativo dentro de uma sess&atilde;o SADS.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><I><FONT SIZE=2> Browser</B></I> - O <I>browser</I> &eacute; um cliente para extra&ccedil;&atilde;o de informa&ccedil;&atilde;o em um servidor <I>Web</I>. Tipicamente, um <I>browser</I> ser&aacute; um programa, em um computador pessoal, que acessar&aacute;, via Internet ou Intranet, um servidor (isto &eacute;, um programa que atende a demanda de clientes remotos) contendo informa&ccedil;&otilde;es de interesse amplo.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Campo</B> - Dado elementar que caracteriza, identifica e qualifica uma estrutura qualquer, exceto a entidade. No reposit&oacute;rio de dados do SADS, o campo &eacute; identificado pelo seu sistema e c&oacute;digo.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Campo de transmiss&atilde;o</B> - &Uacute;ltimo campo dispon&iacute;vel da tela, utilizado para posicionamento do cursor no momento de envio das informa&ccedil;&otilde;es contidas na tela para processamento pelo sistema aplicativo. Normalmente, os sistemas aplicativos utilizam o atributo global "TLAESTAC" para denominar este campo na estrutura da tela.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Chave de acesso</B> - Estrutura composta de atributos/campos que t&ecirc;m a fun&ccedil;&atilde;o de permitir a r&aacute;pida recupera&ccedil;&atilde;o de registros em um determinado conjunto de dados e representar relacionamentos entre estes registros. As chaves de acesso aos <I>datasets</I> s&atilde;o comumente conhecidas como <I>sets</I>, <I>subsets</I> e <I>access</I>. Em se tratando de entidades e tabelas, tamb&eacute;m podem ser denominadas de chaves secund&aacute;rias; quando n&atilde;o forem as principais chaves de acesso aos mesmos, passam a ser denominadas chaves secund&aacute;rias.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> C&oacute;digo externo</B> - C&oacute;digo com o qual o elemento foi definido externamente ao SADS. O c&oacute;digo externo pode ser utilizado quando houver integra&ccedil;&atilde;o entre o ET-SADS e o SADS, da seguinte forma: o c&oacute;digo externo do elemento no SADS representa o c&oacute;digo do elemento no ET-SADS. O c&oacute;digo externo, para o SADS, &eacute; meramente documental.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Comandos de m&oacute;dulo</B> - Macroinstru&ccedil;&otilde;es no processo de cadastramento dos m&oacute;dulos de um programa. Os comandos de m&oacute;dulo, padronizados pelo SADS, t&ecirc;m o objetivo de fatorar o trabalho de complementa&ccedil;&atilde;o da l&oacute;gica do programa e, por conseguinte, diminuir o tempo de constru&ccedil;&atilde;o do mesmo.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Consist&ecirc;ncia </B>- Consist&ecirc;ncia geral, gen&eacute;rica ou simplesmente consist&ecirc;ncia &eacute; um m&oacute;dulo do SADS que executa a valida&ccedil;&atilde;o da entrada de dados para telas e tabelas de um sistema aplicativo de forma interativa e em tempo de execu&ccedil;&atilde;o. As consist&ecirc;ncias s&atilde;o de diferentes naturezas e s&atilde;o efetuadas a partir de par&acirc;metros previamente cadastrados, eliminando a necessidade de suas defini&ccedil;&otilde;es e codifica&ccedil;&otilde;es em programas de um sistema aplicativo.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Contexto</B> - Conjunto de menus e telas de processamento que engloba fun&ccedil;&otilde;es afins, ou um conjunto de telas quaisquer que o analista deseja agrupadas, que podem fazer parte de um ou mais sistemas.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> COOPERATOR</B> -<B> </B>Ferramenta desenvolvida pela MSA-Infor com o objetivo de permitir o compartilhamento dos recursos do micro e do <I>mainframe</I>. Trata-se de uma divis&atilde;o de tarefas onde parte do processamento &eacute; feito com os recursos utilizados do micro e parte pelos do <I>mainframe</I>. O COOPERATOR foi desenvolvido, pois, para atender &agrave; necessidade de economia de recursos de <I>mainframe</I>, de manuten&ccedil;&atilde;o das linhas de comunica&ccedil;&atilde;o dispon&iacute;veis e de obten&ccedil;&atilde;o de um melhor aproveitamento de recursos de <I>hardware</I> utilizados.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><I><FONT SIZE=2> DASDL</B></I> <B>(Data and Structure Definition Language)</B> - Linguagem para constru&ccedil;&atilde;o de banco de dados em DMSII.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><I><FONT SIZE=2> Dataset</B></I> - Cole&ccedil;&atilde;o de registros de dados armazenados em um arquivo, manipulada pelo sistema gerenciador de banco de dados DMSII. O <I>dataset</I> &eacute; similar a um arquivo convencional; a diferen&ccedil;a consiste na organiza&ccedil;&atilde;o dos dados e nas formas de acesso.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><I><FONT SIZE=2> Defaults</I> globais de banco de dados</B> - Valores assumidos pelos atributos em todas as estruturas do banco de dados que n&atilde;o declararem explicitamente algum valor para o mesmo.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Dep&oacute;sito de dados</B> - Elemento do Diagrama de Fluxo de Dados que representa o local f&iacute;sico de armazenamento de informa&ccedil;&otilde;es do sistema.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Disco prim&aacute;rio</B> - Disco onde ficar&atilde;o residentes os arquivos aos quais o sistema poder&aacute; executar o acesso e os que ele ir&aacute; gerar.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Disco secund&aacute;rio</B> - Disco no qual o sistema encontrar&aacute; os arquivos necess&aacute;rios para execu&ccedil;&atilde;o e que n&atilde;o est&atilde;o residentes no disco prim&aacute;rio.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Dom&iacute;nio </B>- Conjunto de caracter&iacute;sticas gerais a um grupo de atributos/campos e que geralmente engloba os valores ou intervalo de valores que estes poder&atilde;o assumir. No reposit&oacute;rio de dados do SADS, o dom&iacute;nio &eacute; identificado pelo seu sistema e c&oacute;digo.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Elemento</B> - Qualquer tipo de informa&ccedil;&atilde;o que pode ter seu acesso autorizado ou restringido ao usu&aacute;rio em uma aplica&ccedil;&atilde;o, atrav&eacute;s do Sistema de Seguran&ccedil;a. Pode ser hierarquizado e se referir a um conjunto de elementos ou se referir a um elemento espec&iacute;fico, de acordo com a aplica&ccedil;&atilde;o; podendo ser uma conta cont&aacute;bil para o sistema de contabilidade, um c&oacute;digo de produto para um sistema de produ&ccedil;&atilde;o. Para o SADS, pode ser o c&oacute;digo de uma tabela ou o c&oacute;digo de um menu, etc.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Elementos do COMS</B> - Informa&ccedil;&otilde;es b&aacute;sicas utilizadas pelo COMS para gerenciamento de transa&ccedil;&otilde;es <I>on-line</I>.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Entidade </B>- Tudo aquilo que pode ser percebido no ambiente e do qual desejamos obter informa&ccedil;&otilde;es; tudo aquilo que faz parte da realidade, podendo ser de natureza concreta, como, por exemplo, objetos (equipamento, material) ou pessoas (fornecedor, funcion&aacute;rio), ou de natureza abstrata (curso, profiss&atilde;o).</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Entidade derivada de relacionamento</B> - Entidade resultante da associa&ccedil;&atilde;o de duas ou mais entidades no modelo conceitual de dados e que cont&eacute;m informa&ccedil;&otilde;es decorrentes desta associa&ccedil;&atilde;o.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Entidade externa</B> - Entidade proveniente de fora dos limites de um sistema, podendo ser uma pessoa, um departamento, um sistema automatizado, uma organiza&ccedil;&atilde;o externa e similares, desde que estes se comuniquem com o sistema, enviando e/ou recebendo dados.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Entidade meramente conceitual</B> - Entidade que aparece apenas no modelo conceitual do sistema, n&atilde;o sendo transposta para o modelo l&oacute;gico ou f&iacute;sico do mesmo. Deste modo, ela &eacute; apenas documental.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Esta&ccedil;&atilde;o</B> - Perif&eacute;rico ou terminal destinado &agrave; utiliza&ccedil;&atilde;o pelo usu&aacute;rio final. Atrav&eacute;s de uma esta&ccedil;&atilde;o o usu&aacute;rio envia mensagens para processamento no computador central ou dele recebe mensagem.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Esta&ccedil;&atilde;o habilitada</B> - Terminal da instala&ccedil;&atilde;o que pode ser utilizado por um usu&aacute;rio para executar o acesso a um aplicativo.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Estado da tela/tabela</B> - Elemento respons&aacute;vel por identificar para qual ambiente e, consequentemente, para quais programas aplicativos a tela ou tabela estar&aacute; dispon&iacute;vel para utiliza&ccedil;&atilde;o. Existem quatro estados distintos - "D" (desenvolvimento), "T" (teste), "P" (produ&ccedil;&atilde;o) e "M" (manuten&ccedil;&atilde;o).</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Estrutura</B> - Conjunto de atributos/campos que comp&otilde;em e caracterizam o elemento.</FONT> </P>
<FONT SIZE=2><P>A estrutura de uma entidade &eacute; composta por todos os atributos que a caracterizam, identificam ou classificam.</FONT> </P>
<FONT SIZE=2><P>A estrutura de uma tela compreende os atributos/campos que comp&otilde;em a parte vari&aacute;vel da mesma, ou seja, os campos de <I>input</I> e <I>output</I>.</FONT> </P>
<FONT SIZE=2><P>A estrutura de uma consist&ecirc;ncia compreende os atributos/campos que s&atilde;o captados do usu&aacute;rio pelo programa aplicativo, ou seja, somente os campos de <I>input</I>.</FONT> </P>
<FONT SIZE=2><P>A estrutura de um arquivo, <I>dataset</I>, <I>set</I> e tabela compreende os atributos/campos que comp&otilde;em um registro de ocorr&ecirc;ncia dos mesmos.</FONT> </P>
<FONT SIZE=2><P>A estrutura de um &aacute;rea de <I>work</I> de programa, &aacute;rea conversacional e &aacute;rea de comunica&ccedil;&atilde;o com sub-rotina compreende os atributos/campos que ser&atilde;o referenciados pelos programas para utiliza&ccedil;&atilde;o dos mesmos.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> ET-SADS</B> - Ferramenta Case desenvolvida pela MSA-Infor que cobre toda a fase de an&aacute;lise de um sistema. Automatiza e estimula a utiliza&ccedil;&atilde;o de metodologias estruturadas da Engenharia da Informa&ccedil;&atilde;o.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Fluxo de dados</B> - Caminho pelo qual as informa&ccedil;&otilde;es fluem no sistema, retratando as interfaces entre os componentes do DFD. Os sentidos poss&iacute;veis s&atilde;o: entre processos, entre dep&oacute;sitos de dados e processos e entre entidades externas e processos.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Formato</B> - Indicador do tipo do conte&uacute;do do atributo/campo, que pode ser: "A" (alfab&eacute;tico), "B" (<I>boolean</I>), "D" (<I>display</I>), "N" (num&eacute;rico), "R" (real) e "F" (<I>field</I>). </P>
</FONT><P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> F&oacute;rmula</B> - Sequ&ecirc;ncia de opera&ccedil;&otilde;es matem&aacute;ticas para se alcan&ccedil;ar o valor do atributo/campo. A f&oacute;rmula de um atributo/campo &eacute; identificada pelo sistema e mnem&ocirc;nico do atributo/campo acrescido de um sequencial que representa o n&uacute;mero da f&oacute;rmula do atributo/campo, que pode possuir mais de uma f&oacute;rmula.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Fun&ccedil;&atilde;o ou processo</B> - Conjunto de procedimentos que atua na transforma&ccedil;&atilde;o dos dados, no Diagrama de Fluxo de Dados e no Diagrama Hier&aacute;rquico-funcional.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><I><FONT SIZE=2> Header </I>padr&atilde;o de <I>dataset</B></I> - Conjunto de atributos/campos definidos na tabela SBPM8014 e que opcionalmente podem ser incorporados ao <I>header</I> do <I>dataset</I>, na gera&ccedil;&atilde;o de sua DASDL (Data and Structure Definition Language).</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Hierarquia de generaliza&ccedil;&atilde;o</B> - Hierarquia de generaliza&ccedil;&atilde;o, ou simplesmente generaliza&ccedil;&atilde;o, &eacute; uma abstra&ccedil;&atilde;o que permite representar uma classe de objetos similares como um objeto gen&eacute;rico. O objeto gen&eacute;rico &eacute; denominado superentidade (entidade "pai") e os objetos similares s&atilde;o denominados subentidades (entidades "filhas"). A entidade gen&eacute;rica possui informa&ccedil;&otilde;es comuns a todas as subentidades e estas, apenas suas informa&ccedil;&otilde;es espec&iacute;ficas.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><I><FONT SIZE=2> Host </B></I>- Programa respons&aacute;vel pelo gerenciamento de transa&ccedil;&otilde;es; executa fun&ccedil;&otilde;es gen&eacute;ricas do sistema, recebendo e distribuindo as transa&ccedil;&otilde;es para os programas, cujos objetos lhe s&atilde;o agregados atrav&eacute;s do processo de <I>binder</I>.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><I><FONT SIZE=2> Host</I> f&iacute;sico</B> - <I>Host</I> que processa as transa&ccedil;&otilde;es ap&oacute;s o desenvolvimento e implanta&ccedil;&atilde;o do sistema. Neste caso, o <I>host</I> gerencia transa&ccedil;&otilde;es que realmente fazem acesso &agrave;s bases de dados do sistema e n&atilde;o apenas simulam sua opera&ccedil;&atilde;o.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><I><FONT SIZE=2> Host </I>l&oacute;gico</B> - <I>Host</I> utilizado na etapa de prototipa&ccedil;&atilde;o do sistema. Ele gerencia um sistema <I>on-line</I> quando este ainda n&atilde;o possui programas e a base de dados ainda n&atilde;o foi constru&iacute;da. A partir de menus, telas e regras previamente cadastradas, simula a execu&ccedil;&atilde;o do sistema, dando a id&eacute;ia de como ser&aacute; sua opera&ccedil;&atilde;o ap&oacute;s o desenvolvimento.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><I><FONT SIZE=2> Host </I>prim&aacute;rio</B> - <I>Host</I> encarregado de controlar e disparar todas as transa&ccedil;&otilde;es pertencentes aos menus do sistema a ele relacionado. &Eacute; aconselh&aacute;vel que se definam como agregadas diretamente ao <I>host</I> prim&aacute;rio apenas as transa&ccedil;&otilde;es menos pesadas do sistema, ou seja, aquelas transa&ccedil;&otilde;es que n&atilde;o consomem muito tempo de processamento. Sendo assim, as demais transa&ccedil;&otilde;es ficariam agregadas ao <I>host </I>secund&aacute;rio, que, por sua vez, seria disparado pelo <I>host</I> prim&aacute;rio.</FONT> </P>
<FONT SIZE=2><P>As transa&ccedil;&otilde;es gerenciadas diretamente pelo <I>host</I> prim&aacute;rio est&atilde;o associadas aos menus de c&oacute;digo "sssUnn".</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><I><FONT SIZE=2> Host </I>secund&aacute;rio</B> - <I>Host</I> disparado pelo prim&aacute;rio com o objetivo de gerenciar as transa&ccedil;&otilde;es mais pesadas do sistema, ou seja, aquelas que consomem maior tempo de processamento. Sendo assim, &eacute; aliviado o processamento do <I>host</I> prim&aacute;rio, evitando-se enfileiramentos, de modo a garantir um bom tempo de resposta ao usu&aacute;rio final.</FONT> </P>
<FONT SIZE=2><P>As transa&ccedil;&otilde;es gerenciadas pelo <I>host</I> secund&aacute;rio est&atilde;o associadas aos menus de c&oacute;digo "sssULn".</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> HTML</B> - Acr&ocirc;nimo de <I>Hypertext Markup Language</I>, &eacute; a linguagem padr&atilde;o para escrever p&aacute;ginas de documentos <I>Web</I>, que possibilita preparar documentos com gr&aacute;ficos e <I>links</I> para outros documentos, para visualiza&ccedil;&atilde;o em <I>browsers</I>.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><I><FONT SIZE=2> Input</B></I> - Palavra em ingl&ecirc;s que, traduzida para o portugu&ecirc;s, significa "entrada".</FONT> </P>
<FONT SIZE=2><P>Integra&ccedil;&atilde;o ET-SADS x SADS - Processo que permite a complementa&ccedil;&atilde;o entre as fases de um projeto de sistema desenvolvidas no ET-SADS com aquelas desenvolvidas no SADS. Ap&oacute;s a elabora&ccedil;&atilde;o do modelo conceitual no ET-SADS, transferem-se os dados para o <I>mainframe</I> e a implementa&ccedil;&atilde;o dos processos do sistema &eacute; feita utilizando-se o SADS.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Interface</B> - Rela&ccedil;&atilde;o ou liga&ccedil;&atilde;o entre dois m&oacute;dulos de <I>software</I>.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><I><FONT SIZE=2> Job</B></I> - Conjunto de comandos em linguagem WFL, respons&aacute;vel por disparar a execu&ccedil;&atilde;o de programas <I>batch</I>. O <I>job</I> &eacute; tamb&eacute;m conhecido como rotina <I>batch</I>.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><I><FONT SIZE=2> Library </B></I>- Arquivo fonte Cobol contendo os atributos/campos que comp&otilde;em a estrutura de um elemento. A <I>library</I> de um elemento &eacute; gerada completamente pelo SADS, podendo ser incorporada aos programas aplicativos que o utilizam. Como exce&ccedil;&atilde;o, a <I>library</I> de declara&ccedil;&atilde;o de banco cont&eacute;m tamb&eacute;m comandos de <I>open</I> e de <I>close</I> do banco.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Internet</B> - </P><DIR>

<P>1. Com inicial mai&uacute;scula, significa a "rede das redes", originalmente criada nos EUA, que se tornou uma associa&ccedil;&atilde;o mundial de redes interligadas, que utilizam protocolos da fam&iacute;lia TCP/IP. A Internet prov&ecirc; transfer&ecirc;ncia de arquivos, <I>login</I> remoto, correio eletr&ocirc;nico, <I>news</I> e outros servi&ccedil;os; </P>
<P>2. Com inicial min&uacute;scula, genericamente, significa uma cole&ccedil;&atilde;o de redes locais e/ou de longa distancia, interligadas por pontes, roteadores e/ou gateways.</FONT> </P></DIR>

<FONT SIZE=2><P>A Internet utiliza um modelo de computa&ccedil;&atilde;o denominado Cliente/Servidor, que permite o uso eficiente dos recursos dispon&iacute;veis em cada m&aacute;quina. </P>
<P>As aplica&ccedil;&otilde;es deste modelo reduzem o tr&aacute;fego na rede atrav&eacute;s da otimiza&ccedil;&atilde;o na troca de dados entre clientes e servidores. O servidor cuida do armazenamento e da altera&ccedil;&atilde;o de grandes cole&ccedil;&otilde;es de dados, controla o acesso &agrave; informa&ccedil;&atilde;o e processa pedidos, enquanto o cliente (um PC, por exemplo) se encarrega de fazer o que for necess&aacute;rio para que a apar&ecirc;ncia e a intera&ccedil;&atilde;o com a informa&ccedil;&atilde;o seja a melhor poss&iacute;vel. </P>
</FONT><P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Intranet</B> - &Eacute; o termo descritivo usado para a implenta&ccedil;&atilde;o das tecnologias da Internet dentro de uma corpora&ccedil;&atilde;o, ao inv&eacute;s de uma conex&atilde;o externa com a Internet. Essa implementa&ccedil;&atilde;o proporciona, de forma tranparente, a disponibiliza&ccedil;&atilde;o de imensos recursos informativos de uma organiza&ccedil;&atilde;o para todos os seus computadores, com um custo e tempo m&iacute;nimos de implementa&ccedil;&atilde;o. </P>
</FONT><P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Linha modelo</B> - Linha de relat&oacute;rio cujo desenho j&aacute; est&aacute; cadastrado no reposit&oacute;rio de dados e que, por isso mesmo, ser&aacute; utilizado como refer&ecirc;ncia para o cadastramento de uma segunda linha qualquer do mesmo relat&oacute;rio.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><I><FONT SIZE=2> Link</B></I> - Conjunto de procedimentos executados pelo sistema operacional (MCP), com o objetivo de permitir que um programa aplicativo e as sub-rotinas por ele chamadas compartilhem fisicamente a &aacute;rea definida como de comunica&ccedil;&atilde;o.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> L&oacute;gica de programa</B> - Especifica&ccedil;&atilde;o mais detalhada do tipo de processamento executado por um programa. Existe uma grande possibilidade de cadastramento de l&oacute;gicas de programas para cada um dos tipos de l&oacute;gica existentes. Cada uma dessas l&oacute;gicas ir&aacute; consistir em uma subl&oacute;gica dentro de seu tipo.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><I><FONT SIZE=2> Logoff </B></I>- Encerramento da sess&atilde;o de trabalho do SADS. Ao finalizar o seu trabalho, todo usu&aacute;rio deve encerrar a sess&atilde;o SADS atrav&eacute;s do procedimento do <I>logoff</I>, por quest&otilde;es de seguran&ccedil;a. Isto obrigar&aacute; o pr&oacute;ximo usu&aacute;rio que for trabalhar na mesma esta&ccedil;&atilde;o a efetuar um novo <I>logon</I>.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><I><FONT SIZE=2> Logon</B></I> - Habilita&ccedil;&atilde;o para uso do SADS. Para iniciar uma sess&atilde;o de trabalho no SADS, &eacute; necess&aacute;rio cumprir o procedimento de habilita&ccedil;&atilde;o. Uma vez cumprido este procedimento, o usu&aacute;rio estar&aacute; habilitado a utilizar os aplicativos para os quais foi autorizado.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> M&aacute;scara de edi&ccedil;&atilde;o</B> - A m&aacute;scara ou <I>picture</I> de edi&ccedil;&atilde;o define a forma de edi&ccedil;&atilde;o do atributo/campo, nos mesmos padr&otilde;es adotados na linguagem Cobol.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Menu </B>- Para o usu&aacute;rio final, um menu representa uma tela que exibe determinadas opera&ccedil;&otilde;es ou escolhas que, ao serem selecionadas, ativam transa&ccedil;&otilde;es ou outros menus. Para o cadastramento no reposit&oacute;rio do SADS, um menu representa um agrupamento de op&ccedil;&otilde;es ou transa&ccedil;&otilde;es onde ser&atilde;o definidas as caracter&iacute;sticas dos processamentos a serem executados pelo <I>host</I> a cada op&ccedil;&atilde;o (transa&ccedil;&atilde;o); da&iacute; esse menu ser denominado menu de op&ccedil;&atilde;o. Existem quatro tipos de classifica&ccedil;&otilde;es para os menus, de acordo com o SADS - menu de escolha, de opera&ccedil;&atilde;o, de op&ccedil;&atilde;o e secund&aacute;rio.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Menu de escolha</B> - Tela que define as rotas de navega&ccedil;&atilde;o, sendo que cada rota corresponde a um destino que pode ser outro menu de escolha ou um menu de opera&ccedil;&atilde;o. Portanto, um menu de escolha &eacute; utilizado apenas para navega&ccedil;&atilde;o entre menus, n&atilde;o sendo poss&iacute;vel solicitar opera&ccedil;&otilde;es espec&iacute;ficas a partir dele.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Menu de op&ccedil;&atilde;o</B> - Agrupamento de op&ccedil;&otilde;es ou transa&ccedil;&otilde;es onde ser&atilde;o definidas as caracter&iacute;sticas dos processamentos a serem executados pelo <I>host</I> a cada op&ccedil;&atilde;o (transa&ccedil;&atilde;o). Sendo assim, um menu de op&ccedil;&atilde;o &eacute; definido atrav&eacute;s de sua tela e atrav&eacute;s de seu cadastramento no reposit&oacute;rio de dados do SADS. A tela do menu ir&aacute; apresentar as op&ccedil;&otilde;es dispon&iacute;veis para o usu&aacute;rio e o cadastramento no reposit&oacute;rio de dados ir&aacute; definir as caracter&iacute;sticas vinculadas a cada uma destas op&ccedil;&otilde;es. As telas dos menus de op&ccedil;&atilde;o n&atilde;o s&atilde;o apresentadas pela navega&ccedil;&atilde;o do SADS.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Menu de opera&ccedil;&atilde;o</B> - Tela que define as opera&ccedil;&otilde;es e os dados b&aacute;sicos a serem informados para processamento das transa&ccedil;&otilde;es. A cada menu de opera&ccedil;&atilde;o pode estar associada nenhuma, uma ou mais de uma tela de processamento.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Menu secund&aacute;rio</B> - Menu onde est&atilde;o cadastradas as transa&ccedil;&otilde;es do sistema que est&atilde;o relacionadas ao <I>host</I> secund&aacute;rio. O menu secund&aacute;rio possui padr&atilde;o "sssULn".</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> M&oacute;dulo de processamento</B> - Conjunto de macroinstru&ccedil;&otilde;es cadastradas no SADS que t&ecirc;m como objetivo moldar a gera&ccedil;&atilde;o de um programa &agrave;s necessidades do sistema, incluindo, complementando ou substituindo trechos do fonte que seriam normalmente gerados pelo SADS.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> M&oacute;dulo do SADS </B>- Cada m&oacute;dulo do SADS &eacute; uma unidade distinta de gerenciamento de elemento do SADS, com fun&ccedil;&otilde;es nitidamente destinadas ao controle deste elemento, que pode ser composta por um ou mais sistemas. Exemplos de m&oacute;dulos do SADS: Gerenciador de telas, Gerenciador de tabelas, Consist&ecirc;ncia geral, Controlador de bibliotecas, etc.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Navega&ccedil;&atilde;o</B> - Processo de deslocamento entre menus do sistema, a fim de facilitar a sua utiliza&ccedil;&atilde;o. &Eacute; realizada atrav&eacute;s de menus de escolha, menus de opera&ccedil;&atilde;o e telas de processamento, que ficam agrupadas em contextos de navega&ccedil;&atilde;o.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> N&iacute;vel de acesso geral do usu&aacute;rio </B>- N&iacute;vel especificado no momento do cadastramento do usu&aacute;rio e que determina o seu poder de acesso ao Sistema de Seguran&ccedil;a e demais sistemas desenvolvidos pelo SADS.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> N&iacute;vel de acesso do usu&aacute;rio por aplicativo</B> - N&iacute;vel especificado no momento de habilita&ccedil;&atilde;o do aplicativo ao usu&aacute;rio e que determina seu poder de acesso a este aplicativo. Informa&ccedil;&atilde;o dispon&iacute;vel na &aacute;rea global de comunica&ccedil;&atilde;o para ser tratada pelos aplicativos.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> N&iacute;vel de defini&ccedil;&atilde;o (NDEF)</B> - O n&iacute;vel de defini&ccedil;&atilde;o do atributo/campo na estrutura de um elemento especifica em qual sistema, relativamente ao elemento, ele foi definido. Pode assumir os seguintes valores: " " (atributo/campo definido como item grupo na estrutura), "S" (atributo/campo definido no sistema indicado no campo SIS - caso o campo SIS n&atilde;o seja informado, o sistema &eacute; o mesmo do elemento) e "P" (atributo/campo n&atilde;o definido no reposit&oacute;rio de dados).</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> N&iacute;vel de estrutura&ccedil;&atilde;o (NIVEL)</B> - Identifica&ccedil;&atilde;o da hierarquia do atributo/campo dentro da estrutura de um elemento. O n&iacute;vel de estrutura&ccedil;&atilde;o de um atributo/campo &eacute; an&aacute;logo ao n&iacute;vel do Cobol.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Op&ccedil;&otilde;es globais de banco de dados </B>- Op&ccedil;&otilde;es respons&aacute;veis pelo controle das caracter&iacute;sticas das rotinas de acesso ao banco de dados, em tempo de compila&ccedil;&atilde;o e execu&ccedil;&atilde;o.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Operador aritm&eacute;tico </B>- Operador utilizado para concatenar os operandos de uma express&atilde;o matem&aacute;tica. No SADS, &eacute; utilizado no cadastramento das f&oacute;rmulas de atributos/campos que sejam vari&aacute;veis geradas (sintaxe = "VG") e no cadastramento em n&iacute;vel de estrutura das consist&ecirc;ncias gen&eacute;ricas. S&atilde;o os seguintes os operadores aritm&eacute;ticos: "+" (adi&ccedil;&atilde;o), "-" (subtra&ccedil;&atilde;o), "*" (multiplica&ccedil;&atilde;o) e "/" (divis&atilde;o).</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Operador l&oacute;gico</B> - Operador utilizado para concatenar logicamente as opera&ccedil;&otilde;es. No SADS, &eacute; utilizado no cadastramento das validades de atributos/campos que sejam vari&aacute;veis definidas (sintaxe = "VD") e no cadastramento das validades em n&iacute;vel de estrutura das consist&ecirc;ncias gen&eacute;ricas. S&atilde;o os seguintes os operadores l&oacute;gicos: "E" (e - <I>and</I>) e "O" (ou - <I>or</I>).</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Operador relacional</B> - Operador utilizado para comparar os operandos. No SADS, &eacute; utilizado no cadastramento de vari&aacute;veis definidas (sintaxe = "VD"), no cadastramento da valida&ccedil;&atilde;o em n&iacute;vel de estrutura das consist&ecirc;ncias e na defini&ccedil;&atilde;o de condi&ccedil;&atilde;o de <I>subset</I> autom&aacute;tico. S&atilde;o os seguintes os operadores relacionais: "LE" (<I>Less or equal</I> - Menor que ou igual a), "LT" (<I>Less than</I> - Menor que), "GE" (<I>Greater or equal</I> - Maior que ou igual a), "GT" (<I>Greater than</I> - Maior que), "EQ" (<I>Equal</I> - Igual a) e "NE" (<I>Not equal</I> - Diferente de).</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Ordena&ccedil;&atilde;o de programa</B> - Especifica&ccedil;&atilde;o de quais e em qual sequ&ecirc;ncia os campos de um arquivo definido como recurso do programa ser&atilde;o utilizados na sua classifica&ccedil;&atilde;o.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><I><FONT SIZE=2> Output</B></I> - Palavra em ingl&ecirc;s que, traduzida para o portugu&ecirc;s, significa "sa&iacute;da".</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Padr&atilde;o</B> - Teste padr&atilde;o ao qual o atributo/campo a ele relacionado ser&aacute; submetido para valida&ccedil;&atilde;o de seu conte&uacute;do, na consist&ecirc;ncia dos dados de uma tela ou tabela.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Paginador de entrada de dados</B> - M&oacute;dulo do SADS respons&aacute;vel por agilizar a entrada de dados para os programas <I>on-line</I> que utilizam m&uacute;ltiplas telas.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Paginador de sa&iacute;da de dados (paginador de consulta) </B>- M&oacute;dulo do SADS respons&aacute;vel por agilizar a programa&ccedil;&atilde;o de sistemas que utilizam consultas de m&uacute;ltiplas p&aacute;ginas em aplica&ccedil;&otilde;es <I>on-line</I>.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Par&acirc;metros f&iacute;sicos de</B> <B><I>dataset</B></I> - Caracter&iacute;sticas que o <I>dataset</I> ou suas chaves de acesso assumir&atilde;o no momento da compila&ccedil;&atilde;o da DASDL do banco de dados.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Par&acirc;metros globais de banco de dados</B> - Elementos respons&aacute;veis pelo controle das caracter&iacute;sticas das rotinas de acesso de banco de dados em tempo de compila&ccedil;&atilde;o e execu&ccedil;&atilde;o.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Perfil modelo</B> - Usu&aacute;rio ao qual podem ser vinculados outros usu&aacute;rios que assumir&atilde;o suas habilita&ccedil;&otilde;es. Facilita a manuten&ccedil;&atilde;o do cadastro de usu&aacute;rios, de maneira a evitar o cadastramento repetitivo.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Processamento Cooperativo</B> - Divis&atilde;o de tarefas onde parte do processamento &eacute; feito com os recurso utilizados do micro e parte pelos de mainframe. V. <B>Cooperator</B>.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Processo ou fun&ccedil;&atilde;o</B> - Conjunto de procedimentos que atua na transforma&ccedil;&atilde;o dos dados, no Diagrama de Fluxo de Dados e Diagrama Hier&aacute;rquico-funcional.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Programa</B> <B><I>batch</B></I> - Programa que processa um grande n&uacute;mero de informa&ccedil;&otilde;es, em lotes de dados, sem intera&ccedil;&atilde;o direta com o usu&aacute;rio e disparado atrav&eacute;s de <I>jobs</I> (WFL).</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Programa</B> <B><I>on-line</B></I> - Programa que processa pequena quantidade de informa&ccedil;&otilde;es, com intera&ccedil;&atilde;o direta com o usu&aacute;rio atrav&eacute;s de telas. As informa&ccedil;&otilde;es s&atilde;o processadas ao mesmo tempo que o usu&aacute;rio requisita a execu&ccedil;&atilde;o do programa atrav&eacute;s de transa&ccedil;&otilde;es (transacional) ou atrav&eacute;s do disparo direto do programa (conversacional).</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Prototipa&ccedil;&atilde;o</B> - Fase do projeto l&oacute;gico de desenvolvimento de sistemas, no qual, a partir de menus, telas e regras previamente cadastradas, o <I>host</I> simula a execu&ccedil;&atilde;o de um sistema, dando a id&eacute;ia de como ser&aacute; sua opera&ccedil;&atilde;o ap&oacute;s seu desenvolvimento, embora ainda n&atilde;o possua programas e a base de dados ainda n&atilde;o tenha sido constru&iacute;da.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Quebra de programa</B> - Especifica&ccedil;&atilde;o de quais campos de um arquivo servir&atilde;o como marcos na divis&atilde;o do processamento de um programa em <I>loops</I>.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Recurso de programa</B> - Elemento (<I>datasets</I>, telas, sub-rotinas, etc) que far&aacute; parte ou ser&aacute; utilizado no processamento de um programa.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Refer&ecirc;ncias cruzadas </B>- Consultas que permitem a verifica&ccedil;&atilde;o de quais elementos do reposit&oacute;rio de dados se relacionam com o argumento de pesquisa.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Registro de uso geral ou <I>dataset</I> de uso geral</B> - <I>Dataset</I> cujos registros s&atilde;o utilizados por v&aacute;rios sistemas para armazenamento de informa&ccedil;&otilde;es de controle. Sendo este <I>dataset</I> de formato vari&aacute;vel, cada sistema dever&aacute; definir uma m&aacute;scara para os seus dados nele armazenados.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Relacionamento</B> - Associa&ccedil;&atilde;o feita entre ocorr&ecirc;ncias de uma ou mais entidades.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Relat&oacute;rio</B> - Conjunto de caracteres ordenados de forma significativa, gerado por programas <I>on-line</I> ou <I>batch</I> para apresenta&ccedil;&atilde;o de dados em formul&aacute;rios de papel via impressoras remotas ou centrais.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Relat&oacute;rio <I>batch</B></I> - Relat&oacute;rio emitido por programa <I>batch</I>.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Relat&oacute;rio <I>on-line</B></I> - Relat&oacute;rio emitido por programa <I>on-line.</I></FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Relat&oacute;rio remoto</B> - Relat&oacute;rio emitido por programa <I>on-line</I> nas impressoras remotas.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><I><FONT SIZE=2> Remap</B></I> - Vis&atilde;o l&oacute;gica de um <I>dataset</I> j&aacute; definido.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Reposit&oacute;rio de dados </B>- Local f&iacute;sico onde s&atilde;o armazenadas as caracter&iacute;sticas dos dados e suas rela&ccedil;&otilde;es com outros dados, informa&ccedil;&otilde;es estas utilizadas pelos sistemas. O reposit&oacute;rio de dados &eacute; o m&oacute;dulo b&aacute;sico de infra-estrutura do SADS, que integra e ap&oacute;ia os demais, permitindo o registro de todos os elementos dos Sistemas de Informa&ccedil;&atilde;o, de forma centralizada, com total controle e informa&ccedil;&atilde;o sobre a utiliza&ccedil;&atilde;o dos mesmos. Ele n&atilde;o s&oacute; &eacute; utilizado no desenvolvimento de sistemas aplicativos, como tamb&eacute;m na execu&ccedil;&atilde;o dos mesmos, encarregando-se das fun&ccedil;&otilde;es de <I>help</I>, consist&ecirc;ncia geral, leitura de telas, etc.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Rota </B>- Conjunto de informa&ccedil;&otilde;es que determinam o caminho para se chegar a uma transa&ccedil;&atilde;o espec&iacute;fica a partir da escolha de uma das op&ccedil;&otilde;es apresentadas em um menu. A rota de navega&ccedil;&atilde;o define, para determinado menu de escolha, as palavras-chave que podem ser selecionadas e as telas que ser&atilde;o apresentadas ap&oacute;s a transmiss&atilde;o de cada uma delas.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> SAA (System Application Architecture)</B> - Conjunto de interfaces, conven&ccedil;&otilde;es e protocolos propostos pela IBM que fornece padr&otilde;es amig&aacute;veis para o desenvolvimento e a utiliza&ccedil;&atilde;o de aplicativos em diferentes ambientes e plataformas.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> SADS - Sistema de Automa&ccedil;&atilde;o do Desenvolvimento de Sistemas</B> - Conjunto de ferramentas desenvolvido pela MSA-Infor com o objetivo de auxiliar nas diversas fases da Engenharia da Informa&ccedil;&atilde;o, desde o planejamento at&eacute; a manuten&ccedil;&atilde;o de sistemas aplicativos em geral.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> SADS/SCP - Sistema de Planejamento e Controle de Projetos</B> - M&oacute;dulo integrante do SADS que oferece os recursos necess&aacute;rios &agrave; administra&ccedil;&atilde;o de m&atilde;o-de-obra alocada ao desenvolvimento e manuten&ccedil;&atilde;o dos sistemas. Este m&oacute;dulo ap&oacute;ia as ger&ecirc;ncias na administra&ccedil;&atilde;o e execu&ccedil;&atilde;o de projetos, a partir de um planejamento elaborado, permitindo o acompanhamento individualizado de todas as atividades.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> SADS/SPO - Sistema de Controle do Processamento</B> - M&oacute;dulo do SADS que automatiza as atividades de planejamento e controla a produ&ccedil;&atilde;o do CPD. Aplic&aacute;vel ao ambiente <I>batch</I>, este m&oacute;dulo em si &eacute; de natureza <I>on-line</I>, possibilitando que todo ciclo dos servi&ccedil;os seja ativado de forma interativa, desde o registro no sistema at&eacute; a expedi&ccedil;&atilde;o dos relat&oacute;rios para os usu&aacute;rios.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> SADS/SS ou SBT - Sistema de Seguran&ccedil;a</B> - M&oacute;dulo do SADS que garante a seguran&ccedil;a de acesso &agrave;s informa&ccedil;&otilde;es da empresa, permitindo o uso de transa&ccedil;&otilde;es <I>on-line</I> somente &agrave;s pessoas habilitadas. O controle &eacute; feito atrav&eacute;s de senhas individuais e o sistema exige que cada usu&aacute;rio se identifique antes de iniciar uma sess&atilde;o de trabalho.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> SADS/STE - Sistema de Estat&iacute;sticas do Ambiente On-Line</B> - M&oacute;dulo do SADS encarregado de fornecer um efetivo controle de todas as vari&aacute;veis envolvidas em ambientes de TP. Ele atua automaticamente na capta&ccedil;&atilde;o de informa&ccedil;&otilde;es geradas pelos COMS e Cande, possibilitando o conhecimento do n&uacute;mero de transa&ccedil;&otilde;es e seus respectivos tempos de resposta, sob as mais variadas vis&otilde;es.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Senha</B> - C&oacute;digo individual para identifica&ccedil;&atilde;o do usu&aacute;rio SADS no momento do <I>logon</I>. A senha deve ser de conhecimento restrito ao seu usu&aacute;rio, para que o acesso ao ambiente SADS seja controlado. No Sistema de Seguran&ccedil;a do SADS, a senha pode ter at&eacute; seis caracteres alfanum&eacute;ricos, com pelo menos uma letra e um n&uacute;mero, n&atilde;o podendo, portanto, possuir caracteres especiais.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Senha criptografada </B>- Campo que guarda as mesmas informa&ccedil;&otilde;es contidas na senha do usu&aacute;rio, por&eacute;m de forma "mascarada", para n&atilde;o permitir seu conhecimento at&eacute; mesmo pelo administrador de seguran&ccedil;a.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Servi&ccedil;o<I> </B></I>- <I>Job</I> preparado para execu&ccedil;&atilde;o ou em execu&ccedil;&atilde;o. A cada vez que um <I>job</I> que esteja cadastrado no SPO - <I>job</I> fonte - &eacute; preparado para execu&ccedil;&atilde;o, ele passa a ser considerado um servi&ccedil;o.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Servidor</B></FONT> </P><DIR>

<FONT SIZE=2><P>1. No modelo cliente/servidor, &eacute; o programa respons&aacute;vel pelo atendimento a determinado servi&ccedil;o solicitado por um cliente. Servi&ccedil;os como <I>archie</I>, <I>Gopher</I>, WAIS e WWW s&atilde;o providos por servidores; </P>
<P>2. Referindo-se a equipamento, o servidor &eacute; um sistema que prov&ecirc; recursos tais como armazenamento de dados, impress&atilde;o e acesso <I>dial-up</I> para usu&aacute;rios de uma rede de computadores.</FONT> </P></DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Sess&atilde;o SADS </B>- Per&iacute;odo de trabalho iniciado pela opera&ccedil;&atilde;o de <I>logon</I> do SADS e encerrado pela opera&ccedil;&atilde;o de <I>logoff</I>, que permite ao usu&aacute;rio trabalhar com o SADS ou qualquer aplicativo gerado por ele.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Sin&ocirc;nimo </B>- Atributo/campo definido a partir das caracter&iacute;sticas j&aacute; cadastradas para um outro atributo/campo ao qual ele est&aacute; relacionado.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Sintaxe</B> - Tipo da vari&aacute;vel do atributo/campo. Pode assumir um dos valores: "VD" (vari&aacute;vel definida), "VG" (vari&aacute;vel gerada), "VE" (vari&aacute;vel estruturada) e "VL" (vari&aacute;vel livre).</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Sistema</B> - Cole&ccedil;&atilde;o de elementos discretos, interdependentes, que se interagem com o objetivo de atingir uma causa ou meta comum. De maneira gen&eacute;rica, pode ser entendido como um conjunto de processos, dados e estruturas de dados.</FONT> </P>
<FONT SIZE=2><P>Para o SADS, sistema &eacute; o elemento de n&iacute;vel mais elevado e sob o qual estar&atilde;o definidos os demais elementos dos modelos de dados e processos, sejam eles conceituais, l&oacute;gicos ou f&iacute;sicos.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Sistema aplicativo</B> - Sistema que pode ser desenvolvido por usu&aacute;rios SADS com a finalidade de controlar um conjunto de dados e procedimentos. Tamb&eacute;m referenciado neste manual como aplicativo ou aplica&ccedil;&atilde;o.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Sistema cooperativo</B> - Sistema no qual o processamento &eacute; dividido entre o computador central e os microcomputadores. Para o SADS, um sistema cooperativo &eacute; aquele no qual as m&aacute;scaras das telas, regras de valida&ccedil;&atilde;o dos dados e navega&ccedil;&atilde;o das telas s&atilde;o executadas no microcomputador e apenas a execu&ccedil;&atilde;o do processamento da l&oacute;gica em si &eacute; executada no computador central.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><I><FONT SIZE=2> Site</B></I> [instala&ccedil;&atilde;o]</FONT> </P><DIR>

<FONT SIZE=2><P>1. Uma institui&ccedil;&atilde;o, onde computadores s&atilde;o instalados e operados; </P>
<P>2. Um n&oacute; Internet.</FONT> </P></DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><I><FONT SIZE=2> Softwares </I>de banco de dados</B> - Rotinas respons&aacute;veis pelo gerenciamento l&oacute;gico e f&iacute;sico do banco de dados, pela recupera&ccedil;&atilde;o do banco, pelas fun&ccedil;&otilde;es espec&iacute;ficas de DMSII e pela recupera&ccedil;&atilde;o em <I>audit</I> e <I>control file</I>, <I>rebuild</I> ou <I>rollback</I>. Esses <I>softwares</I> s&atilde;o comumente conhecidos como <I>accesroutines, datarecovery, dmsupport, reconstruct </I>e<I> recovery</I>.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Subentidade</B> - Entidade que em uma hierarquia de generaliza&ccedil;&atilde;o &eacute; subordinada a uma superentidade. Pode tamb&eacute;m ser denominada entidade "filha", possuindo informa&ccedil;&otilde;es espec&iacute;ficas e herdando todas as classifica&ccedil;&otilde;es da superentidade &agrave; qual est&aacute; relacionada.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Submenu</B> - Tipo especial de menu contido hierarquicamente dentro de um outro menu e que possui as mesmas caracter&iacute;sticas deste.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Sub-rotina</B> - Conjunto de comandos que podem ser processados por mais de um aplicativo. A sub-rotina tem seu c&oacute;digo objeto e fonte independentes dos objetos e fontes dos aplicativos, sendo ativada atrav&eacute;s do comando "CALL".</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Sub-rotinas globais </B>- S&atilde;o sub-rotinas dos aplicativos ou do SADS que s&atilde;o utilizadas pelos programas chamados e que s&atilde;o declaradas na &aacute;rea global de comunica&ccedil;&atilde;o do <I>host,</I> sendo, por isso mesmo, utilizadas globalmente. Desta forma, s&atilde;o "linkadas" apenas uma vez ao<I> host</I>, somente na sua primeira chamada, economizando os tempos de <I>link</I> nos novos disparos das mesmas pelos programas chamados.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Superentidade</B> - Entidade que em uma hierarquia de generaliza&ccedil;&atilde;o possui duas ou mais subentidades a ela subordinadas. Pode tamb&eacute;m ser denominada de entidade "pai", determinando todas as classifica&ccedil;&otilde;es herdadas pelas subentidades a ela relacionadas.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Tabela</B> - Conjunto composto de uma base de dados, estruturas para acesso aos dados armazenados e uma tela para capta&ccedil;&atilde;o destes dados, sendo todos estes elementos atualizados e controlados pelo SADS. A tabela se apresenta como alternativa para implementa&ccedil;&atilde;o f&iacute;sica de alguns tipos de entidades. As fun&ccedil;&otilde;es de cria&ccedil;&atilde;o e manuten&ccedil;&atilde;o, bem como de armazenamento dos itens de dados, s&atilde;o processadas e gerenciadas por um m&oacute;dulo do SADS. </P>
</FONT><P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> TCP/ IP - </B>Acr&ocirc;nimo de <I>Transmission Control Protocol/Internet Protocol</I>, &eacute; a fam&iacute;lia de protocolos para a comunica&ccedil;&atilde;o de dados inter-redes, originalmente proposta para a<I> Advanced Research Products Agency</I> (ARPA). Hoje &eacute; um padr&atilde;o de fato para inter-redes abertas, e seu uso &eacute; amplamente difundido dentro e fora dos EUA.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Tela</B> - Conjunto de caracteres ordenados de forma significativa, utilizados em programas <I>on-line </I>transacionais para apresenta&ccedil;&atilde;o e capta&ccedil;&atilde;o de dados em terminais de v&iacute;deo ou microcomputador.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Tela de processamento</B> - Tela utilizada pelo programa aplicativo que processa a transa&ccedil;&atilde;o e que permite opera&ccedil;&otilde;es de inclus&atilde;o, altera&ccedil;&atilde;o, exclus&atilde;o e consulta, gera&ccedil;&atilde;o, libera&ccedil;&atilde;o entre outras opera&ccedil;&otilde;es.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Tipo da l&oacute;gica de programa</B> - Indicador do tipo de processamento a ser executado pelo programa (inclus&atilde;o, altera&ccedil;&atilde;o, consulta, etc) e, por conseguinte, do modelo com o qual ele ser&aacute; gerado. O SADS gera programas segundo tipos de l&oacute;gicas padronizadas que atendem &agrave; maioria das necessidades de aplicativos <I>on-line,</I> <I>batch</I> e sub-rotinas. Quanto mais simples a l&oacute;gica do programa ou sub-rotina e quanto mais pr&oacute;xima de uma l&oacute;gica padronizada estiver sua fun&ccedil;&atilde;o, maior ser&aacute; a capacidade de gera&ccedil;&atilde;o do SADS.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><I><FONT SIZE=2> Trancode</B></I> - C&oacute;digo de transa&ccedil;&atilde;o. Primeiro campo transmiss&iacute;vel de uma tela. &Eacute; utilizado pelo COMS para identifica&ccedil;&atilde;o do programa que ir&aacute; tratar aquela tela.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Transa&ccedil;&atilde;o prototipada (ou transa&ccedil;&atilde;o em prototipa&ccedil;&atilde;o) </B>- Transa&ccedil;&atilde;o cadastrada no menu de um sistema por&eacute;m n&atilde;o relacionada a nenhum programa chamado. Neste caso, quando esta transa&ccedil;&atilde;o for requisitada, o <I>host</I> ir&aacute; simular a execu&ccedil;&atilde;o de um processamento, dando a id&eacute;ia de como ser&aacute; sua opera&ccedil;&atilde;o ap&oacute;s seu desenvolvimento sem atualiza&ccedil;&atilde;o das bases de dados. A prototipa&ccedil;&atilde;o &eacute; importante para valida&ccedil;&atilde;o da navega&ccedil;&atilde;o entre as telas do sistema e da consist&ecirc;ncia de dados de entrada.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><I><FONT SIZE=2> Window </B></I>- Conceito na arquitetura COMS que habilita um n&uacute;mero de ambientes de programas para ser operado independente e simultaneamente a uma esta&ccedil;&atilde;o. Um dos ambientes de programa pode ser visualizado enquanto os outros continuam a opera&ccedil;&atilde;o.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> WWW</B> - <I>World Wide Web</I>, ou <I>Web</I>. Meta-rede, baseada em hipertextos, que integra diversos servi&ccedil;os Internet, atrav&eacute;s de uma interface que possibilita o acesso a informa&ccedil;&otilde;es multim&iacute;dia.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Unidades autorizadas </B>- Unidades (empresa, estabelecimento e unidade) &agrave;s quais o usu&aacute;rio pode obter autoriza&ccedil;&atilde;o de acesso para uso de sistemas aplicativos.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Unidade de armazenamento </B>- Crit&eacute;rio pelo qual os itens s&atilde;o armazenados e considerados na tabela. Ela ir&aacute; definir em qual n&iacute;vel de unidade de uma instala&ccedil;&atilde;o os itens armazenados na tabela estar&atilde;o dispon&iacute;veis.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Unidade SADS </B>- C&oacute;digo num&eacute;rico que identifica a parti&ccedil;&atilde;o do reposit&oacute;rio de dados que ser&aacute; trabalhada. Na atual vers&atilde;o do SADS n&atilde;o foi implementado ainda o particionamento do reposit&oacute;rio; portanto, o c&oacute;digo da unidade SADS assumido &eacute; igual a 01.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><I><FONT SIZE=2> Usercode </B></I>- Divis&atilde;o l&oacute;gica dos arquivos dentro dos discos. Cada <I>usercode</I> se assemelha a um diret&oacute;rio onde residem v&aacute;rios arquivos.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><I><FONT SIZE=2> Usercode </I>de an&aacute;lise</B> - <I>Usercode</I> definido para o SADS, na tabela SBPM5000, como principal no desenvolvimento de um sistema. Nele residir&atilde;o os fontes dos programas aplicativos. Relacionados ao <I>usercode</I> de an&aacute;lise existem os <I>usercodes</I> de teste e produ&ccedil;&atilde;o, onde residir&atilde;o as <I>libraries</I> e programas objetos respectivamente em teste e produ&ccedil;&atilde;o.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Usu&aacute;rio </B>- Indiv&iacute;duo habilitado a efetuar transa&ccedil;&otilde;es do SADS e sistemas gerados por ele. Possui um n&uacute;mero, c&oacute;digo e senha pr&oacute;prios que o identificam para obter acesso a estes sistemas.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Usu&aacute;rio bloqueado</B> - Usu&aacute;rio que est&aacute; impedido de efetuar <I>logon</I> no ambiente SADS.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Validades em n&iacute;vel de estrutura</B> - Testes aos quais os atributos/campos pertencentes a uma consist&ecirc;ncia devem ser submetidos, quando a mesma for executada.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Validades </B>- Valores ou intervalo de valores que o atributo ou campo poder&atilde;o assumir.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13><B><FONT SIZE=2> Servidor Web</B> - M&oacute;dulo do SADS que visa disponibilizar os sistemas aplicativos desenvolvidos atrav&eacute;s do SADS no ambiente <I>World Wide Web</I>.</FONT> </P></DIR>
</BODY>
</HTML>
