<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=ISO-8859-1">
<TITLE>Tabela</TITLE>

<META NAME="GENERATOR" CONTENT="Internet Assistant for Microsoft Word 2.04z">
</HEAD>
<BODY BACKGROUND="doc_b.gif">
<basefont size=2>
<P>
<A NAME="Tabel"><B><FONT SIZE=6>Tabela</FONT></B></A>
<HR>
<P>
<A NAME="Conce"><B><FONT SIZE=5>Conceitua&ccedil;&atilde;o</FONT></B></A>
<HR>
<P>
<FONT SIZE=2>Uma tabela, para o SADS, &eacute; um conjunto composto
de uma base de dados para armazenamento de itens, estruturas para
acesso aos itens armazenados e uma tela para capta&ccedil;&atilde;o
e apresenta&ccedil;&atilde;o dos itens, sendo todos estes elementos
atualizados e controlados pelo SADS.</FONT>
<P>
<FONT SIZE=2>As tabelas s&atilde;o bases alternativas para implementa&ccedil;&atilde;o
f&iacute;sica de alguns tipos de entidades que geralmente possuem
poucas ocorr&ecirc;ncias, poucos atributos e acessos bastante
espec&iacute;ficos.</FONT>
<P>
<FONT SIZE=2>Uma tabela pode ser criada para atender a um sistema,
uma &aacute;rea, ou mesmo a toda a empresa.</FONT>
<P>
<FONT SIZE=2>As caracter&iacute;sticas principais de uma tabela,
relevantes no momento em que se opta por uma que ser&aacute; a
resid&ecirc;ncia f&iacute;sica para armazenamento de uma entidade
de dados, s&atilde;o:</FONT>
<P><dir><img src="Bullet1.gif" width=8 heigth=8>Chaves de acesso com tamanho m&aacute;ximo de 30
(trinta) caracteres;</FONT>
<P><img src="Bullet1.gif" width=8 heigth=8>Itens de dados com tamanho m&aacute;ximo de 300
(trezentos) caracteres;</FONT>
<P><img src="Bullet1.gif" width=8 heigth=8>Utiliza&ccedil;&atilde;o de no m&aacute;ximo quatro
estruturas de acesso aos itens nelas armazenados, sendo que a
chave prim&aacute;ria pode possuir at&eacute; 30 (trinta) caracteres
e as secund&aacute;rias at&eacute; 50 (cinquenta) caracteres;</FONT>
<P><img src="Bullet1.gif" width=8 heigth=8>Atualiza&ccedil;&atilde;o de itens efetuada apenas
pelo gerenciador de tabelas do SADS (os programas aplicativos
s&oacute; podem consultar itens);</FONT>
<P><img src="Bullet1.gif" width=8 heigth=8>Baixo volume de dados (m&aacute;ximo de 1500 itens);</FONT>
<P><img src="Bullet1.gif" width=8 heigth=8>Baixa volatilidade dos itens (itens mais est&aacute;veis).</FONT>
</dir>
<P>
<FONT SIZE=2>Cada tabela possui um c&oacute;digo pr&oacute;prio,
padronizado, que a identifica para o rep&oacute;sitorio de dados
do SADS.</FONT>
<P>
<B><FONT SIZE=5>Estados de tabelas</FONT></B>
<P>
<FONT SIZE=2>O estado de uma tabela identifica, para cada um de
seus desenhos, se ela pode ser utilizada em algum ambiente de
processamento (teste ou produ&ccedil;&atilde;o), se ela ainda
est&aacute; em desenvolvimento ou encontra-se em manuten&ccedil;&atilde;o.</FONT>
<P>
<FONT SIZE=2>Assim sendo, uma &uacute;nica tabela possui desenhos
espec&iacute;ficos nos estados de desenvolvimento, manuten&ccedil;&atilde;o,
teste e produ&ccedil;&atilde;o.</FONT>
<P>
<FONT SIZE=2>O estado de desenvolvimento &eacute; exclusivo, ou
seja, uma tabela em desenvolvimento possui apenas uma c&oacute;pia
do desenho. Portanto, ela ainda n&atilde;o pode ter opera&ccedil;&otilde;es
realizadas para seus itens nos ambientes de teste e produ&ccedil;&atilde;o.
</FONT>
<P>
<FONT SIZE=2>Quando uma tabela em desenvolvimento for liberada
para teste, ela deixa de existir naquele ambiente para existir
apenas em teste, e, a partir deste momento, qualquer altera&ccedil;&atilde;o
efetuada no desenho da tabela acarretar&aacute; na cria&ccedil;&atilde;o
de outra vers&atilde;o em manuten&ccedil;&atilde;o que, at&eacute;
ser liberada e, se for o caso, reorganizada, n&atilde;o interferir&aacute;
nas vers&otilde;es em teste e em produ&ccedil;&atilde;o.</FONT>
<P>
<FONT SIZE=2>Portanto, uma tabela pode ter, simultaneamente, at&eacute;
tr&ecirc;s vers&otilde;es diferentes do seu desenho, ou seja,
em produ&ccedil;&atilde;o, em teste e em manuten&ccedil;&atilde;o.</FONT>
<P>
<FONT SIZE=2>A seguir, s&atilde;o apresentados detalhes sobre
cada um dos estados de uma tabela:</FONT>
<P><dir><img src="Bullet5.gif" width=13 heigth=13><B><FONT SIZE=2 COLOR=#000000>Desenvolvimento</FONT></B><FONT SIZE=2>
- Estado inicial da tabela. Neste estado, a tabela n&atilde;o
possui itens, podendo, portanto, sofrer todo e qualquer tipo de
altera&ccedil;&atilde;o sem refletir no ambiente operacional;</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>Teste</FONT></B><FONT SIZE=2> -
Estado resultante de uma libera&ccedil;&atilde;o para teste de
uma tabela em manuten&ccedil;&atilde;o ou em desenvolvimento.
Neste estado, seus itens encontram-se dispon&iacute;veis para
acesso por programas aplicativos compilados para o ambiente de
teste e para sofrerem opera&ccedil;&otilde;es por parte de usu&aacute;rios
que efetuaram </FONT><I><FONT SIZE=2 COLOR=#000000>logon</FONT></I><FONT SIZE=2>
neste mesmo ambiente;</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13><B><FONT SIZE=2 COLOR=#000000>Produ&ccedil;&atilde;o</FONT></B><FONT SIZE=2>
- Estado resultante da libera&ccedil;&atilde;o para produ&ccedil;&atilde;o
de uma tabela em teste. Neste estado, seus itens est&atilde;o
dispon&iacute;veis para acesso por programas aplicativos compilados
para o ambiente de produ&ccedil;&atilde;o e para sofrerem opera&ccedil;&otilde;es
por parte de usu&aacute;rios que efetuaram </FONT><I><FONT SIZE=2 COLOR=#000000>logon</FONT></I><FONT SIZE=2>
neste mesmo ambiente;</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>Manuten&ccedil;&atilde;o</FONT></B><FONT SIZE=2>
- Estado intermedi&aacute;rio de uma tabela anteriormente em teste,
ou seja, estado resultante de uma altera&ccedil;&atilde;o feita
em tabela j&aacute; liberada. Neste estado, a nova vers&atilde;o
da tabela n&atilde;o se encontra dispon&iacute;vel para acesso
por programas aplicativos e nem por usu&aacute;rios, e qualquer
tipo de altera&ccedil;&atilde;o continua n&atilde;o refletindo
no ambiente operacional. Para utilizar uma tabela em manuten&ccedil;&atilde;o,
&eacute; necess&aacute;rio liber&aacute;-la para teste ou produ&ccedil;&atilde;o
e, se necess&aacute;rio, reorganizar seus itens.</FONT>
<P>
<FONT SIZE=2>A exist&ecirc;ncia desses estados permite altera&ccedil;&otilde;es
na tabela sem que estas venham influenciar o ambiente operacional
onde elas s&atilde;o utilizadas (teste e produ&ccedil;&atilde;o).
Todas as altera&ccedil;&otilde;es na defini&ccedil;&atilde;o,
par&acirc;metros, especifica&ccedil;&atilde;o, estrutura e desenho
da tabela s&atilde;o feitas nos estados de desenvolvimento ou
de manuten&ccedil;&atilde;o, j&aacute; as manuten&ccedil;&otilde;es
em seus itens s&atilde;o feitas nos ambientes de teste e de produ&ccedil;&atilde;o.</dir>
<P>
<A NAME="Gertab"><B><FONT SIZE=5>Gerenciamento de tabelas pelo
SADS</FONT></B></A>
<P>
<FONT SIZE=2>O SADS, atrav&eacute;s de seu Gerenciador de Tabelas
ou simplesmente Sistema de Tabelas, elimina a necessidade de cria&ccedil;&atilde;o
de </FONT><I><FONT SIZE=2 COLOR=#000000>datasets</FONT></I><FONT SIZE=2>
e programas espec&iacute;ficos para a manuten&ccedil;&atilde;o
das mesmas, pois qualquer programa, </FONT><I><FONT SIZE=2 COLOR=#000000>batch</FONT></I><FONT SIZE=2>
ou </FONT><I><FONT SIZE=2 COLOR=#000000>on-line</FONT></I><FONT SIZE=2>,
pode consultar os dados destas tabelas por ele controladas.</FONT>
<P>
<FONT SIZE=2>O gerenciamento de tabelas do SADS &eacute; feito
atrav&eacute;s de transa&ccedil;&otilde;es </FONT><I><FONT SIZE=2 COLOR=#000000>on-line</FONT></I><FONT SIZE=2>,
onde &eacute; poss&iacute;vel efetuar manuten&ccedil;&otilde;es
em seus itens, como: incluir, alterar, excluir, consultar, etc.</FONT>
<P>
<FONT SIZE=2>Sempre que uma das transa&ccedil;&otilde;es de manuten&ccedil;&atilde;o
de itens de tabela for solicitada, o Sistema de Seguran&ccedil;a
do SADS ir&aacute; verificar se o usu&aacute;rio que a requisitou
est&aacute; habilitado a efetu&aacute;-la, exceto em consultas
e listagens de tabelas que estiverem definidas que n&atilde;o
utilizar&atilde;o seguran&ccedil;a. Caso o usu&aacute;rio n&atilde;o
esteja habilitado, a opera&ccedil;&atilde;o n&atilde;o ser&aacute;
efetuada.</FONT>
<P>
<A NAME="Padro"><B><FONT SIZE=5>Padroniza&ccedil;&atilde;o</FONT></B></A>
<HR>
<P>
<FONT SIZE=2>O padr&atilde;o de codifica&ccedil;&atilde;o adotado
pelo SADS para identifica&ccedil;&atilde;o do elemento tabela
&eacute; o seguinte:</FONT>
<P><dir><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2>&quot;sssMnnnn&quot;</FONT></B><FONT SIZE=2> onde:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>
<B><FONT SIZE=2>&quot;sss&quot;</FONT></B><FONT SIZE=2> &eacute;
o c&oacute;digo alfab&eacute;tico que identifica o sistema;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<B><FONT SIZE=2>&quot;M&quot;</FONT></B><FONT SIZE=2> &eacute;
a constante de tabela e</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<B><FONT SIZE=2>&quot;nnnn&quot;</FONT></B><FONT SIZE=2> &eacute;
o sequencial num&eacute;rico maior ou igual a 5000.</dir></dir>
<P>
<A NAME="Utili"><B><FONT SIZE=5>Utiliza&ccedil;&atilde;o</FONT></B></A>
<HR>
<P>
<FONT SIZE=2>As tabelas s&atilde;o alternativas para armazenamento
de entidades de dados com pequeno volume de dados e normalmente
de baixa volatilidade, eliminando, assim, a necessidade de cria&ccedil;&atilde;o
de </FONT><I><FONT SIZE=2 COLOR=#000000>datasets</FONT></I><FONT SIZE=2>
e programas espec&iacute;ficos para manuten&ccedil;&atilde;o das
mesmas.</FONT>
<P>
<FONT SIZE=2>As tabelas definidas no SADS podem ser acessadas
pelos programas aplicativos, atrav&eacute;s da sub-rotina SS/T/SC/01,
por at&eacute; quatro (4) ordens de classifica&ccedil;&atilde;o
distintas: a primeira classifica&ccedil;&atilde;o &eacute; por
chave prim&aacute;ria, que n&atilde;o aceita item duplicado; as
outras tr&ecirc;s poss&iacute;veis s&atilde;o por chaves secund&aacute;rias,
que aceitam itens duplicados. </FONT>
<P>
<FONT SIZE=2>As tabelas tamb&eacute;m podem ser acessadas pelo
m&oacute;dulo de consist&ecirc;ncia geral para verifica&ccedil;&atilde;o
da exist&ecirc;ncia ou n&atilde;o de alguns de seus itens.</FONT>
<P>
<A NAME="Cadas"><B><FONT SIZE=5>Cadastramento</FONT></B></A>
<HR>
<P>
<FONT SIZE=2>Para cadastrar uma tabela, &eacute; necess&aacute;rio
que o sistema e os atributos e campos que ir&atilde;o compor sua
estrutura j&aacute; estejam definidos no reposit&oacute;rio de
dados.</FONT>
<P>
<B><FONT SIZE=4>Roteiro</FONT></B>
<P>
<FONT SIZE=2>Para cadastrar uma tabela e torn&aacute;-la dispon&iacute;vel
para utiliza&ccedil;&atilde;o, deve-se executar as seguintes fun&ccedil;&otilde;es:</FONT>
<P><dir><img src="Bullet9.gif" width=13 heigth=13>Cadastramento de par&acirc;metros de tabela;</FONT>
<P><img src="Bullet9.gif" width=13 heigth=13>Cadastramento de desenho de tabela;</FONT>
<P><img src="Bullet9.gif" width=13 heigth=13>Defini&ccedil;&atilde;o de tabela;</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>Gera&ccedil;&atilde;o de defini&ccedil;&otilde;es
de tabela a partir de entidade;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>Especifica&ccedil;&atilde;o no reposit&oacute;rio;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>Cadastramento de estrutura de tabela;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>Cadastramento de chaves secund&aacute;rias, caso
existam.</dir>
<P><img src="Bullet9.gif" width=13 heigth=13>Gera&ccedil;&atilde;o de </FONT><I><FONT SIZE=2 COLOR=#000000>library</FONT></I><FONT SIZE=2>
de tabela;</FONT>
<P><img src="Bullet9.gif" width=13 heigth=13>Gera&ccedil;&atilde;o de consist&ecirc;ncia de tabela;</FONT>
<P><img src="Bullet9.gif" width=13 heigth=13>Libera&ccedil;&atilde;o de tabela;</FONT>
<P><img src="Bullet9.gif" width=13 heigth=13>Libera&ccedil;&atilde;o de consist&ecirc;ncia;</FONT>
<P><img src="Bullet9.gif" width=13 heigth=13>Libera&ccedil;&atilde;o de </FONT><I><FONT SIZE=2 COLOR=#000000>library</FONT></I><FONT SIZE=2>
para produ&ccedil;&atilde;o.</dir>
<P>
<FONT SIZE=2>Terminado o cadastramento da tabela, pode-se executar
as fun&ccedil;&otilde;es de &quot;Manuten&ccedil;&atilde;o de
itens de tabela&quot;.</FONT>
<P>
<A NAME="Cadpar"><B><FONT SIZE=5>Cadastramento de par&acirc;metros
de tabela</FONT></B></A>
<P>
<FONT SIZE=2>Os par&acirc;metros de tabela consistem nas especifica&ccedil;&otilde;es
de:</FONT>
<P><dir><img src="Bullet1.gif" width=8 heigth=8>
Crit&eacute;rio de armazenamento dos itens: por
empresa, estabelecimento, unidade ou sem crit&eacute;rio de armazenamento;</FONT>
<P><img src="Bullet1.gif" width=8 heigth=8>Crit&eacute;rio de validade dos itens: De-at&eacute;,
de, at&eacute; ou sem crit&eacute;rio de validade;</FONT>
<P><img src="Bullet1.gif" width=8 heigth=8>Chaves secund&aacute;rias para acesso aos itens:
se existir&atilde;o e quais ser&atilde;o as chaves secund&aacute;rias
para acesso aos itens;</FONT>
<P><img src="Bullet1.gif" width=8 heigth=8>Sub-rotina para tratamento de exclus&atilde;o: se
existir&aacute; e qual ser&aacute; a sub-rotina para execu&ccedil;&atilde;o
de testes de restri&ccedil;&atilde;o de integridade nas exclus&otilde;es
de itens da tabela;</FONT>
<P><img src="Bullet1.gif" width=8 heigth=8>Edi&ccedil;&atilde;o de atributos num&eacute;ricos:
se haver&aacute; edi&ccedil;&atilde;o de atributos num&eacute;ricos
(datas e atributos com decimais) nas consultas e listagens de
itens.</dir>
<P>
<FONT SIZE=2>A exclus&atilde;o de par&acirc;metros de tabelas
s&oacute; &eacute; permitida para aquelas que est&atilde;o em
desenvolvimento e/ou manuten&ccedil;&atilde;o. Para excluir tabelas
j&aacute; liberadas para os ambientes de teste e/ou produ&ccedil;&atilde;o,
deve-se efetuar a exclus&atilde;o total das mesmas.</FONT>
<P>
<FONT SIZE=2>Para cadastrar os par&acirc;metros de uma tabela,
&eacute; necess&aacute;rio que seu sistema j&aacute; tenha sido
definido no reposit&oacute;rio de dados do SADS.</FONT>
<P><dir>
<B><FONT SIZE=2 COLOR=#000000>CAMPOS DA TELA</FONT></B>
<P><dir><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TABELA</FONT></B><FONT SIZE=2> -
C&oacute;digo da tabela no padr&atilde;o SADS (sssMnnnn);</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>USUARIO</FONT></B><FONT SIZE=2>
- Nome do usu&aacute;rio respons&aacute;vel pela manuten&ccedil;&atilde;o
da tabela.</FONT>
<P>
<FONT SIZE=2>O nome do usu&aacute;rio &eacute; livre de padroniza&ccedil;&atilde;o,
podendo indicar uma &aacute;rea, uma equipe, um usu&aacute;rio,
etc.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>ARMAZENAMENTO (EMP/EST/UND)</FONT></B><FONT SIZE=2>
- Crit&eacute;rio de unidade de armazenamento de itens adotado
para a tabela.</FONT>
<P>
<FONT SIZE=2>O crit&eacute;rio de unidade de armazenamento &eacute;
utilizado para restringir o acesso de usu&aacute;rios de setores
diversos de uma empresa ou de empresas distintas de um mesmo grupo
a seus pr&oacute;prios itens de dados, evitando, assim, o cadastramento
de tabelas separadas para cada um deles.</FONT>
<P>
<FONT SIZE=2>A defini&ccedil;&atilde;o da unidade de armazenamento
&eacute; opcional e os valores v&aacute;lidos s&atilde;o:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;EMP&quot; - Para armazenamento de itens espec&iacute;ficos
para cada empresa;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;EST&quot; - Para armazenamento de itens espec&iacute;ficos
por empresa/estabelecimento;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;UND&quot; - Para armazenamento de itens espec&iacute;ficos
por empresa/estabelecimento/unidade.</dir>
<P>
<FONT SIZE=2>Quando este crit&eacute;rio for definido para uma
tabela, ao efetuar o </FONT><I><FONT SIZE=2 COLOR=#000000>logon</FONT></I><FONT SIZE=2>,
o usu&aacute;rio ter&aacute; de informar os c&oacute;digos de
empresa, estabelecimento e unidade a que ele est&aacute; habilitado
para acesso. Estas informa&ccedil;&otilde;es s&atilde;o usadas
para definir com quais itens de dados cadastrados naquelas unidades
onde foi efetuado o </FONT><I><FONT SIZE=2 COLOR=#000000>logon</FONT></I><FONT SIZE=2>
o usu&aacute;rio poder&aacute; trabalhar.</FONT>
<P>
<FONT SIZE=2>Exemplificando:</FONT>
<P>
<FONT SIZE=2>Suponha que um usu&aacute;rio fa&ccedil;a </FONT><I><FONT SIZE=2 COLOR=#000000>logon</FONT></I><FONT SIZE=2>
nas seguintes unidades:</FONT>
<P><dir>
<FONT SIZE=2>Empresa : 001</FONT>
<P>
<FONT SIZE=2>Estabelecimento : 0002</FONT>
<P>
<FONT SIZE=2>Unidade : 003</dir>
<P>
<FONT SIZE=2>Para as tabelas em que est&aacute; habilitado, o
usu&aacute;rio poder&aacute; incluir, alterar, excluir e consultar:</FONT>
<ul type=disc><li>todos os itens, caso a tabela n&atilde;o possua
especifica&ccedil;&otilde;es de unidade de armazenamento;</FONT>
<li>somente os dados da empresa 001 das tabelas que
possuam especifica&ccedil;&atilde;o &quot;EMP&quot; para a unidade
de armazenamento;</FONT>
<li>somente os dados da empresa 001 e estabelecimento
0002 das tabelas que possuam especifica&ccedil;&atilde;o &quot;EST&quot;
para a unidade de armazenamento;</FONT>
<li>somente os dados da empresa 001, estabelecimento
0002 e unidade 003 das tabelas que possuam especifica&ccedil;&atilde;o
&quot;UND&quot; para a unidade de armazenamento;</ul>
<P>
<FONT SIZE=2>S&oacute; &eacute; poss&iacute;vel utilizar o crit&eacute;rio
de armazenamento para empresas cadastradas na tabela SBPM6001.
Maiores informa&ccedil;&otilde;es a respeito desta tabela est&atilde;o
descritas na Se&ccedil;&atilde;o V, &quot;Parametriza&ccedil;&otilde;es
do SADS&quot;, neste manual.</FONT>
<P>
<FONT SIZE=2>Ap&oacute;s a libera&ccedil;&atilde;o de altera&ccedil;&otilde;es
do crit&eacute;rio de armazenamento feitas em tabelas j&aacute;
liberadas, estas passar&atilde;o a incluir, alterar, excluir e
consultar somente os itens do novo crit&eacute;rio de armazenamento,
n&atilde;o conseguindo fazer acesso aos itens que j&aacute; estavam
cadastrados segundo o crit&eacute;rio antigo.</FONT>
<P>
<FONT SIZE=2>Para que os itens antigos possam ser mantidos, eles
dever&atilde;o ser compatibilizados ao novo crit&eacute;rio. Para
isto, deve-se alterar suas unidades de armazenamento, atrav&eacute;s
do menu MANARMTAB (Manuten&ccedil;&atilde;o por local de armazenamento),
utilizando a opera&ccedil;&atilde;o &quot;LIV&quot; - &quot;Altera&ccedil;&atilde;o
Livre&quot;.</FONT>
<P>
<FONT SIZE=2>Da mesma forma, os programas que utilizavam a tabela
fazendo chamada &agrave; sub-rotina SSTS01 s&oacute; conseguir&atilde;o
obter acesso aos itens que se enquadrarem ao novo crit&eacute;rio.
Portanto, estes programas dever&atilde;o transferir, como argumento
para a sub-rotina, os c&oacute;digos de empresa, estabelecimento
e unidade adotados como novo crit&eacute;rio de armazenamento.</FONT>
<P>
<FONT SIZE=2>As consist&ecirc;ncias que fazem testes contra essas
tabelas, enquanto n&atilde;o forem liberadas novamente, somente
poder&atilde;o ter acesso aos itens que j&aacute; estavam cadastrados
no crit&eacute;rio antigo. Ap&oacute;s a nova libera&ccedil;&atilde;o,
o acesso aos itens s&oacute; ser&aacute; permitido ap&oacute;s
efetuar a convers&atilde;o dos mesmos do crit&eacute;rio antigo
para o novo. </FONT>
<P>
<FONT SIZE=2>Para as tabelas que possuam especifica&ccedil;&otilde;es
no crit&eacute;rio de armazenamento, existem fun&ccedil;&otilde;es
que executam manuten&ccedil;&otilde;es nos seus itens por unidade.
Estas fun&ccedil;&otilde;es est&atilde;o descritas no t&oacute;pico
&quot;Manuten&ccedil;&atilde;o por local de armazenamento&quot;,
nesta se&ccedil;&atilde;o.</FONT>
<P><img src="Bullet5.gif" width=13 heidth=13>
<B><FONT SIZE=2 COLOR=#000000>CRITERIO VALIDACAO DE DATA</FONT></B><FONT SIZE=2>
- Crit&eacute;rio para identifica&ccedil;&atilde;o da validade
dos itens cadastrados.</FONT>
<P>
<FONT SIZE=2>A especifica&ccedil;&atilde;o deste crit&eacute;rio
&eacute; opcional e proporciona a busca de um item v&aacute;lido
na tabela a partir da informa&ccedil;&atilde;o de uma data.</FONT>
<P>
<FONT SIZE=2>A seguir, s&atilde;o apresentados os crit&eacute;rios
de valida&ccedil;&atilde;o por data poss&iacute;veis de serem
especificados para tabelas:</FONT>
<p><dir><b>&quot;1&quot; </b> - (&quot;De&quot;) - Indica que os
itens desta tabela valer&atilde;o a partir da data especificada
para cada um deles. Quando um acesso for executado, o item v&aacute;lido
ser&aacute; aquele cuja data especificada estiver anteriormente
mais pr&oacute;xima daquela indicada no acesso;</FONT>
<P>
<b>&quot;2&quot; </b> - (&quot;At&eacute;&quot;) - Indica
que os itens desta tabela valer&atilde;o at&eacute; a data especificada
para cada um deles. Quando um acesso for executado, o item v&aacute;lido
ser&aacute; aquele cuja data especificada estiver posteriormente
mais pr&oacute;xima daquela indicada no acesso;</FONT>
<P>
<FONT SIZE=2>Para a utiliza&ccedil;&atilde;o dos crit&eacute;rios
&quot;1&quot; e &quot;2&quot;, deve-se colocar um campo para informa&ccedil;&atilde;o
das datas &quot;De&quot; e &quot;At&eacute;&quot;, respectivamente,
no desenho e na estrutura da tabela. Este campo tem de ser colocado
como o &uacute;ltimo campo componente da chave.</FONT>
<P>
<b>&quot;3&quot;</b> - (&quot;De&quot; - &quot;At&eacute;&quot;)
- Indica que os itens desta tabela valer&atilde;o de uma data
at&eacute; outra especificada para cada um deles. Se em um acesso
for indicada uma data v&aacute;lida para dois itens distintos,
o acesso ser&aacute; feito &agrave;quele cuja data inicial (data
de) seja a anterior mais pr&oacute;xima daquela indicada no acesso.</dir>
<P>
<FONT SIZE=2>Para a utiliza&ccedil;&atilde;o do crit&eacute;rio
&quot;3&quot;, deve-se colocar dois campos para informa&ccedil;&atilde;o
das datas &quot;De&quot; e &quot;At&eacute;&quot;, respectivamente,
no desenho e na estrutura da tabela. O campo para informa&ccedil;&atilde;o
da data &quot;De&quot; tem de ser colocado como o &uacute;ltimo
campo componente da chave, j&aacute; o campo para informa&ccedil;&atilde;o
da data &quot;At&eacute;&quot; tem de ser colocado como o primeiro
campo do item de dados.</FONT>
<P>
<FONT SIZE=2>Quando o programa aplicativo executar acesso a tabelas
com defini&ccedil;&atilde;o de crit&eacute;rio de valida&ccedil;&atilde;o
por data, deve-se informar, dentre os seus argumentos de pesquisa
por data, em qual delas ter-se-&aacute; acesso a um item v&aacute;lido.
</FONT>
<P>
<FONT SIZE=2>A altera&ccedil;&atilde;o do crit&eacute;rio de valida&ccedil;&atilde;o
de data de uma tabela de &quot;1&quot; ou &quot;2&quot; para &quot;3&quot;
marca esta tabela como &quot;a reorganizar&quot;, para evitar
erro no acesso aos itens da tabela, ap&oacute;s este tipo de altera&ccedil;&atilde;o.</FONT>
<P>
<FONT SIZE=2>Detalhes sobre a execu&ccedil;&atilde;o de chamada
&agrave; sub-rotina est&atilde;o descritos posteriormente no t&oacute;pico
&quot;Interface com aplicativos&quot;, neste mesmo item.</FONT>
<P>
<FONT SIZE=2>Exemplificando: </FONT>
<P>
<FONT SIZE=2>Para os pre&ccedil;os v&aacute;lidos para um mesmo
c&oacute;digo de produto, temos:</FONT>
<P>
<TABLE BORDER=1>
<TR align=center><TD WIDTH=114>DATA</TD><TD WIDTH=111>PRE&Ccedil;O (R$)</TD>
</TR>
<TR align=center><TD WIDTH=114>15/06/92</TD><TD WIDTH=111>1000,00</TD></TR>
<TR align=center><TD WIDTH=114>20/07/92</TD><TD WIDTH=111>1200,00</TD></TR>
<TR align=center><TD WIDTH=114>15/08/92</TD><TD WIDTH=111>1320,00</TD></TR>
<TR align=center><TD WIDTH=114>20/11/92</TD><TD WIDTH=111>1500,00</TD></TR>
<TR align=center><TD WIDTH=114>01/12/92</TD><TD WIDTH=111>1600,00</TD></TR>
</TABLE>
<P>
Quanto aos itens cadastrados nesta tabela, podem ser feitas as
seguintes considera&ccedil;&otilde;es:
<P><dir>
- Para o crit&eacute;rio de valida&ccedil;&atilde;o por data com
c&oacute;digo num&eacute;rico igual a &quot;1&quot;, tem-se que
os pre&ccedil;os do produto come&ccedil;am a vigorar a partir
da data indicada no item e deixam de valer no dia em que o pr&oacute;ximo
pre&ccedil;o entrar em vigor. Portanto, na tabela exemplo, para
uma data anterior a 20/07/92 e posterior a 15/06/92, o pre&ccedil;o
do produto ser&aacute; CR$ 1000,00. Para uma data de pesquisa
igual a &quot;30/09/92&quot;, a sub-rotina SSTS01 ir&aacute; retornar
o item da tabela de 15/08/92, cujo pre&ccedil;o &eacute; CR$ 1320,00,
j&aacute; que este pre&ccedil;o &eacute; v&aacute;lido de 15/08/92
at&eacute; 19/11/92. Para qualquer data posterior a 01/12/92,
o pre&ccedil;o do produto ser&aacute; CR$ 1600,00, at&eacute;
que outro item com data posterior a este seja cadastrado. Para
qualquer data anterior a 15/06/92, n&atilde;o h&aacute; pre&ccedil;o
especificado para o produto.
<P>
- Para o crit&eacute;rio de valida&ccedil;&atilde;o por data com
c&oacute;digo num&eacute;rico igual a &quot;2&quot;, temos que
os pre&ccedil;os do produto come&ccedil;am a vigorar um dia ap&oacute;s
a data indicada no item anterior, perdendo a validade na data
que estiver indicada no item. Portanto, na tabela exemplo, para
qualquer data anterior a 15/06/92, o pre&ccedil;o do produto ser&aacute;
CR$ 1000,00. Para uma data de pesquisa igual a &quot;30/09/92&quot;,
no lugar do item de 15/08/92 do exemplo anterior, a sub-rotina
SSTS01 ir&aacute; retornar o item da tabela de 20/11/92, cujo
pre&ccedil;o &eacute; CR$ 1500,00, j&aacute; que este pre&ccedil;o
&eacute; v&aacute;lido de 16/08/92 at&eacute; 20/11/92. Para qualquer
data posterior a 01/12/92, n&atilde;o h&aacute; pre&ccedil;o especificado
para o produto.</dir>
<P>
<TABLE BORDER=1>
<TR align=center><TD WIDTH=130>DATA IN&Iacute;CIO</TD><TD WIDTH=106>DATA FIM
</TD><TD WIDTH=106>PRE&Ccedil;O</TD></TR>
<TR align=center><TD WIDTH=130>15/06/92</TD><TD WIDTH=106>17/07/92</TD><TD WIDTH=106>1000,00
</TD></TR>
<TR align=center><TD WIDTH=130>20/07/92</TD><TD WIDTH=106>14/08/92</TD><TD WIDTH=106>1200,00
</TD></TR>
<TR align=center><TD WIDTH=130>17/08/92</TD><TD WIDTH=106>20/11/92</TD><TD WIDTH=106>1500,00
</TD></TR>
<TR align=center><TD WIDTH=130>23/11/92</TD><TD WIDTH=106>30/11/92</TD><TD WIDTH=106>1550,00
</TD></TR>
<TR align=center><TD WIDTH=130>01/12/92</TD><TD WIDTH=106>10/12/92</TD><TD WIDTH=106>1650,00
</TD></TR>
</TABLE>
<P><dir>
- Para o crit&eacute;rio de valida&ccedil;&atilde;o por data com
c&oacute;digo num&eacute;rico igual a &quot;3&quot;, temos que
os pre&ccedil;os do produto come&ccedil;am a vigorar a partir
da data indicada como &quot;DATA IN&Iacute;CIO&quot;, perdendo
sua validade na data indicada como &quot;DATA FIM&quot;, no item.
Portanto, na tabela exemplo, para qualquer data anterior a 15/06/92,
n&atilde;o h&aacute; pre&ccedil;o especificado para o produto.
Para uma data de pesquisa igual a &quot;30/09/92&quot;, a sub-rotina
SSTS01 ir&aacute; retornar o item da tabela que vai de 17/08/92
a 20/11/92, cujo pre&ccedil;o &eacute; CR$ 1500,00&quot;, j&aacute;
que a data encontra-se no intervalo especificado para o item.
Para qualquer data posterior a 10/12/92, n&atilde;o h&aacute;
pre&ccedil;o especificado para o produto.</dir>
<P>
&Eacute; importante avaliar cuidadosamente a necessidade de implementa&ccedil;&atilde;o
de algum crit&eacute;rio de valida&ccedil;&atilde;o por data em
uma tabela, pois este crit&eacute;rio n&atilde;o poder&aacute;
ser inclu&iacute;do para tabelas j&aacute; liberadas. Por&eacute;m,
para as tabelas que possuirem alguma especifica&ccedil;&atilde;o,
podem ser alteradas livremente. 
<P>
Qualquer altera&ccedil;&atilde;o no crit&eacute;rio de valida&ccedil;&atilde;o
por data deve ser complementada pela confirma&ccedil;&atilde;o
do desenho da tabela. Esta confirma&ccedil;&atilde;o &eacute;
necess&aacute;ria para que seja feita a consist&ecirc;ncia do
desenho contra o novo crit&eacute;rio. Al&eacute;m disso, efetuada
a altera&ccedil;&atilde;o na tabela, deve-se executar a sua libera&ccedil;&atilde;o
e, finalmente, a reorganiza&ccedil;&atilde;o dos itens da mesma.
<P>
Em opera&ccedil;&otilde;es de altera&ccedil;&atilde;o de par&acirc;metros
de tabela, s&oacute; &eacute; obrigat&oacute;rio confirmar o desenho
da tabela caso alguma altera&ccedil;&atilde;o tenha sido feita
no crit&eacute;rio de valida&ccedil;&atilde;o por data.
<P>
Para tabelas convertidas de vers&otilde;es anteriores &agrave;
3.0, n&atilde;o &eacute; permitida a altera&ccedil;&atilde;o do
seu desenho antes de fazer uma primeira libera&ccedil;&atilde;o.
Entretanto, antes de liber&aacute;-lo, deve-se verificar o cadastramento
das estruturas destas tabelas. 
<P>
Detalhes sobre tabelas convertidas de vers&otilde;es anteriores
est&atilde;o descritos no item &quot;Funcionamento das tabelas
anteriores &agrave; vers&atilde;o 3.0&quot;, nesta mesma se&ccedil;&atilde;o.
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>CHAVES SECUNDARIAS (B/C/D)</FONT></B><FONT SIZE=2>
- Indicadores das chaves secund&aacute;rias da tabela.</FONT>
<P>
<FONT SIZE=2>Chaves secund&aacute;rias s&atilde;o vias alternativas
de acesso aos itens de uma tabela. Elas permitem a exist&ecirc;ncia
de itens duplicados, isto &eacute;, com o mesmo valor de chave
secund&aacute;ria.</FONT>
<P>
<FONT SIZE=2>As chaves secund&aacute;rias podem ser compostas
de um ou mais atributos, tendo o tamanho total m&aacute;ximo de
50 posi&ccedil;&otilde;es. Podem ser compostas por quaisquer atributos
e campos da estrutura da tabela, sendo estes pertencentes ou n&atilde;o
&agrave; chave prim&aacute;ria.</FONT>
<P>
<FONT SIZE=2>No momento do cadastramento dos par&acirc;metros
da tabela, deve-se indicar quais chaves ser&atilde;o utilizadas
pela mesma, marcando um &quot;X&quot; ou informando a letra identificadora
da chave (B, C ou D) em seu respectivo lugar.</FONT>
<P>
<FONT SIZE=2>Exemplificando:<Pre><FONT SIZE=3>
<u>B</u> <u>C</u> <u>D</u> - para defini&ccedil;&atilde;o das chaves B, C e D
<u> </u> <u>C</u> <u> </u> - para defini&ccedil;&atilde;o da chave C
<u> </u> <u> </u> <u>X</u> - para defini&ccedil;&atilde;o da chave D
</Pre></font>
<FONT SIZE=2>As estruturas das chaves secund&aacute;rias t&ecirc;m
de ser definidas no reposit&oacute;rio de dados do SADS antes
da libera&ccedil;&atilde;o da tabela.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>SUB-ROTINA TRATAMENTO EXCLUSAO</FONT></B><FONT SIZE=2>
- C&oacute;digo da sub-rotina para tratamento da exclus&atilde;o
dos itens da tabela. </FONT>
<P>
<FONT SIZE=2>Esta sub-rotina deve estar previamente cadastrada
e informada no padr&atilde;o SADS (sssSxn).</FONT>
<P>
<FONT SIZE=2>Esta sub-rotina, caso seja cadastrada para a tabela,
ser&aacute; a respons&aacute;vel pela garantia de integridade
referencial nas exclus&otilde;es de itens da tabela. Em geral,
estas sub-rotinas executam testes contra cadastros ou de habilita&ccedil;&atilde;o
de usu&aacute;rios para o item. Estes testes evitam a exclus&atilde;o
indesejada de itens da tabela.</FONT>
<P>
<FONT SIZE=2>Esta sub-rotina, caso seja cadastrada para a tabela,
ser&aacute; executada sempre que for acionada uma das transa&ccedil;&otilde;es
de exclus&atilde;o (unit&aacute;ria ou de lista) de itens de tabela,
efetuada somente se a sub-rotina assim permitir.</FONT>
<P>
<FONT SIZE=2>As regras para a codifica&ccedil;&atilde;o dessas
sub-rotinas est&atilde;o descritas no t&oacute;pico</FONT><I><FONT SIZE=2 COLOR=#000000>
</FONT></I><FONT SIZE=2>&quot;Interface com Aplicativo&quot;,
neste mesmo item.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>EDICAO NA EMISSAO E CONSULTA (S/N)</FONT></B><FONT SIZE=2>
- Indicador de edi&ccedil;&atilde;o de itens na emiss&atilde;o
e consulta.</FONT>
<P>
<FONT SIZE=2>Pode assumir os seguintes valores:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;S&quot; - Para indicar que dever&aacute; haver
edi&ccedil;&atilde;o do conte&uacute;do de itens da tabela nas
transa&ccedil;&otilde;es de emiss&atilde;o e consulta;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;N&quot; - Para indicar que n&atilde;o dever&aacute;
haver edi&ccedil;&atilde;o do conte&uacute;do de itens da tabela
nas transa&ccedil;&otilde;es de emiss&atilde;o e consulta.</dir>
<P>
<FONT SIZE=2>A utiliza&ccedil;&atilde;o indiscriminada do processamento
de edi&ccedil;&atilde;o em tabelas que n&atilde;o necessitam desta
especifica&ccedil;&atilde;o pode prejudicar a </FONT><I><FONT SIZE=2 COLOR=#000000>performance</FONT></I><FONT SIZE=2>
do sistema. </FONT>
<P>
<FONT SIZE=2>Quando este campo for especificado, a edi&ccedil;&atilde;o
ser&aacute; feita a partir das informa&ccedil;&otilde;es cadastradas
e liberadas na consist&ecirc;ncia gen&eacute;rica e no reposit&oacute;rio
de dados do SADS.</FONT>
<P>
<FONT SIZE=2>As edi&ccedil;&otilde;es s&atilde;o feitas de acordo
com os formatos dos atributos e dos campos que comp&otilde;em
a consist&ecirc;ncia da tabela da seguinte forma:</FONT>
<P>
<FONT SIZE=2>Edi&ccedil;&atilde;o de v&iacute;rgula - Para atributos
e campos num&eacute;ricos com decimais;</FONT>
<P>
<FONT SIZE=2>Edi&ccedil;&atilde;o de sinal negativo - Para atributos
e campos que possuam sinal (SIN = &quot;S&quot;);</FONT>
<P>
<FONT SIZE=2>Invers&atilde;o de data do formato ano/m&ecirc;s/dia
para o formato dia/m&ecirc;s/ano - Para atributos e campos com
formato num&eacute;rico e padr&atilde;o de data invertida (Formato
= &quot;N&quot; e Padr&atilde;o = &quot;INV&quot;).</FONT>
<P>
<FONT SIZE=2>Edi&ccedil;&atilde;o de data - Para atributos e campos
com formato num&eacute;rico e com um dos padr&otilde;es de data
(Formato = &quot;N&quot; e Padr&atilde;o = &quot;DMA&quot; ou
&quot;AMD&quot; ou &quot;INV&quot;).</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>SEGURANCA PARA CONSULTA E LISTAGEM
(S/N)</FONT></B><FONT SIZE=2> - Indicador de valida&ccedil;&atilde;o
da habilita&ccedil;&atilde;o do usu&aacute;rio no Sistema de Seguran&ccedil;a
ao disparar uma consulta ou listagem dos itens de tabela.</FONT>
<P>
<FONT SIZE=2>Pode assumir os seguintes valores:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;S&quot; - Para indicar que dever&aacute; ser
validada a habilita&ccedil;&atilde;o do usu&aacute;rio no Sistema
de Seguran&ccedil;a nas transa&ccedil;&otilde;es de consulta e
listagem dos itens da tabela;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;N&quot; - Para indicar que n&atilde;o dever&aacute;
ser validada a habilita&ccedil;&atilde;o do usu&aacute;rio no
Sistema de Seguran&ccedil;a nas transa&ccedil;&otilde;es de consulta
e listagem dos itens da tabela.</dir>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>CONFIRME (S/N)</FONT></B><FONT SIZE=2>
- Indicador de confirma&ccedil;&atilde;o de opera&ccedil;&atilde;o.</FONT>
<P>
<FONT SIZE=2>Pode assumir os seguintes valores:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;S&quot; - Para confirmar a opera&ccedil;&atilde;o
desejada;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;N&quot; - Para cancelar a opera&ccedil;&atilde;o
que est&aacute; sendo processada.</dir>
<P>
<FONT SIZE=2>Se a opera&ccedil;&atilde;o for confirmada, ser&aacute;
encadeada a tela para defini&ccedil;&atilde;o do desenho da tabela.</FONT>
<P>
<FONT SIZE=2>A inclus&atilde;o do par&acirc;metro s&oacute; ser&aacute;
efetuada ap&oacute;s a confirma&ccedil;&atilde;o da defini&ccedil;&atilde;o
do desenho.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>ALTERACAO DE DESENHO (S/N)</FONT></B><FONT SIZE=2>
- Indicador de encadeamento da opera&ccedil;&atilde;o de altera&ccedil;&atilde;o
do desenho, no caso de altera&ccedil;&atilde;o dos par&acirc;metros
da tabela.</FONT>
<P>
<FONT SIZE=2>Pode assumir os seguintes valores:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;S&quot; - Para encadear a tela com o desenho
da tabela;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;N&quot; - Para confirmar a altera&ccedil;&atilde;o
do par&acirc;metro e n&atilde;o haver encadeamento do desenho
da tabela.</dir></dir></dir>
<P>
<A NAME="Caddes"><B><FONT SIZE=5>Cadastramento de desenho de tabela</FONT></B></A>
<P>
<FONT SIZE=2>O desenho de uma tabela especifica como a tela, que
ser&aacute; exibida ao usu&aacute;rio para capta&ccedil;&atilde;o
e apresenta&ccedil;&atilde;o dos itens, dever&aacute; ser montada.</FONT>
<P>
<FONT SIZE=2>Deste modo, desenhar uma tabela significa especificar
os campos de dados e seus cabe&ccedil;alhos para uma formata&ccedil;&atilde;o
mais amig&aacute;vel da tela que ser&aacute; utilizada para manipula&ccedil;&atilde;o
dos itens da tabela.</FONT>
<P>
<FONT SIZE=2>Os campos da composi&ccedil;&atilde;o da chave prim&aacute;ria
tamb&eacute;m s&atilde;o especificados no desenho da tabela.</FONT>
<P>
<FONT SIZE=2>Para especifica&ccedil;&atilde;o dos elementos que
comp&otilde;em os desenhos das tabelas, devem ser observados os
seguintes detalhes:</FONT>
<P><dir><img src="Bullet1.gif" width=8 heigth=8>
O cabe&ccedil;alho, t&iacute;tulo das colunas que
geralmente aparece na primeira linha ou antes dos campos de informa&ccedil;&atilde;o,
&eacute; opcional;</FONT>
<P><img src="Bullet1.gif" width=8 heigth=8>A chave da tabela (argumento de pesquisa):</FONT>
<ul type=disc><li>pode ser composta por um ou mais atributos/campos,
desde que a soma do tamanho destes n&atilde;o ultrapasse 30 caracteres;</FONT>
<li>deve, obrigatoriamente, possuir pelo menos um atributo/campo.</FONT>
<li>os campos que a comp&otilde;em devem ser delimitados
pelos caracteres abre chave (&quot;{&quot;) e fecha chave (&quot;}&quot;)
e t&ecirc;m de estar definidos antes dos campos de informa&ccedil;&atilde;o.</FONT>
<li>n&atilde;o pode ser alterada depois que a tabela
j&aacute; estiver liberada. Por&eacute;m, quando a tabela utiliza
crit&eacute;rio de valida&ccedil;&atilde;o de data, &eacute; poss&iacute;vel
aumentar o tamanho das datas que comp&otilde;em sua chave. Detalhes
a este respeito est&atilde;o descritos no item &quot;Fun&ccedil;&otilde;es
de Apoio&quot;, subitem &quot;Reorganiza&ccedil;&atilde;o de itens
de tabela&quot;, nesta se&ccedil;&atilde;o.</FONT>
<li>para a utiliza&ccedil;&atilde;o de qualquer crit&eacute;rio
de valida&ccedil;&atilde;o por data, deve-se colocar um campo
para informa&ccedil;&atilde;o de data como o &uacute;ltimo componente
da chave.</ul>
<P><img src="Bullet1.gif" width=8 heigth=8>Os campos de informa&ccedil;&atilde;o:</FONT>
<ul type=disc><li>podem ser compostos por um ou mais atributos/campos,
desde que a soma do tamanho destes n&atilde;o ultrapasse 300 caracteres;</FONT>
<li>devem ser delimitados pelos caracteres abre colchete
(&quot;[&quot;) e fecha colchete (&quot;]&quot;);</FONT>
<li>para a utiliza&ccedil;&atilde;o do crit&eacute;rio
de valida&ccedil;&atilde;o por data &quot;De - At&eacute;&quot;,
deve-se colocar um campo para informa&ccedil;&atilde;o da data
&quot;At&eacute;&quot; como o primeiro do item, isto &eacute;,
antes dos demais campos de dados.</ul>
<P>
<FONT SIZE=2>O desenho de uma tabela &eacute; utilizado para definir
o </FONT><I><FONT SIZE=2 COLOR=#000000>layout</FONT></I><FONT SIZE=2>
com que os seus itens ser&atilde;o captados ou apresentados para
o usu&aacute;rio.</FONT>
<P>
<FONT SIZE=2>Para efetuar o cadastramento do desenho de uma tabela,
&eacute; necess&aacute;rio que seus par&acirc;metros j&aacute;
tenham sido cadastrados no reposit&oacute;rio de dados do SADS.</FONT>
<P>
<B><FONT SIZE=2 COLOR=#000000>CAMPOS DA TELA</FONT></B>
<P>
<FONT SIZE=2>Est&atilde;o dispon&iacute;veis 15 linhas de 78 colunas
cada uma, para o desenho do cabe&ccedil;alho, das chaves da tabela
e de seus campos de informa&ccedil;&atilde;o. Por&eacute;m, no
momento de cadastramento do desenho, basta desenhar o cabe&ccedil;alho
da tabela e um item da mesma, pois, na sua libera&ccedil;&atilde;o
para o ambiente de teste, o Gerenciador de Tabelas se encarregar&aacute;
de determinar o n&uacute;mero de ocorr&ecirc;ncias de itens que
aparecer&atilde;o em uma mesma tabela e que ser&atilde;o exibidos
ao usu&aacute;rio a cada solicita&ccedil;&atilde;o.</FONT>
<P>
<FONT SIZE=2>Exemplificando:</FONT>
<ul type=disc><li>Se o cabe&ccedil;alho da tabela ocupar duas linhas
e cada um de seus itens ocupar apenas uma, esta tabela ter&aacute;
13 ocorr&ecirc;ncias de itens em cada tela (duas linhas de cabe&ccedil;alho
mais 13 de itens, somam as 15 linhas dispon&iacute;veis na tela
da tabela);</FONT>
<li>Se a tabela n&atilde;o tiver cabe&ccedil;alho e
cada item ocupar cinco linhas, estar&atilde;o dispon&iacute;veis
tr&ecirc;s itens em cada tela de tratamento da tabela.</ul></dir></dir>
<P>
<A NAME="Deftab"><B><FONT SIZE=5>Defini&ccedil;&atilde;o de tabela</FONT></B></A>
<P>
<FONT SIZE=2>Definir uma tabela no reposit&oacute;rio de dados
significa especificar seu nome, sua estrutura e as estruturas
de suas chaves secund&aacute;rias (se houverem).</FONT>
<P>
<FONT SIZE=2>A especifica&ccedil;&atilde;o da tabela torna-a dispon&iacute;vel
para ser referenciada nas defini&ccedil;&otilde;es de recursos
de programas, de atributos, campos, sin&ocirc;nimos e dom&iacute;nios
que forem tabelados e, tamb&eacute;m, nos testes contra tabelas
da consist&ecirc;ncia geral.</FONT>
<P>
<A NAME="Gerdef"><B><FONT SIZE=4>Gera&ccedil;&atilde;o de defini&ccedil;&otilde;es
de tabela a partir de entidade</FONT></B></A>
<P>
<FONT SIZE=2>A defini&ccedil;&atilde;o de uma tabela pode ser
cadastrada diretamente ou gerada a partir da defini&ccedil;&atilde;o
de uma entidade j&aacute; cadastrada no reposit&oacute;rio de
dados do SADS.</FONT>
<P>
<FONT SIZE=2>A gera&ccedil;&atilde;o das defini&ccedil;&otilde;es
da tabela a partir da entidade compreende a gera&ccedil;&atilde;o
de sua especifica&ccedil;&atilde;o no reposit&oacute;rio de dados
(nome da tabela), de sua estrutura, de suas chaves prim&aacute;rias
e secund&aacute;rias, tomando como base os dados cadastrados para
a entidade informada como origem.</FONT>
<P>
<FONT SIZE=2>Para efetuar a gera&ccedil;&atilde;o autom&aacute;tica,
a tabela n&atilde;o pode estar definida no reposit&oacute;rio
de dados e o cadastramento da entidade deve estar completo, contendo
no m&aacute;ximo tr&ecirc;s chaves secund&aacute;rias (B/C/D).</FONT>
<P>
<FONT SIZE=2>A gera&ccedil;&atilde;o autom&aacute;tica substitui
o cadastramento direto da especifica&ccedil;&atilde;o, estrutura
e chaves de uma tabela. N&atilde;o h&aacute; impedimento para
a realiza&ccedil;&atilde;o de manuten&ccedil;&otilde;es nestas
defini&ccedil;&otilde;es ap&oacute;s a gera&ccedil;&atilde;o.</FONT>
<P>
<FONT SIZE=2>A gera&ccedil;&atilde;o de tabela a partir de entidade
n&atilde;o est&aacute; associada a nenhuma tela de processamento.
Portanto, para efetu&aacute;-la, basta transmitir os argumentos
do menu de opera&ccedil;&atilde;o &quot;GERTABENT&quot;, cujos
campos ser&atilde;o apresentados a seguir.</FONT>
<P><dir>
<B><FONT SIZE=2 COLOR=#000000>CAMPOS DA TELA</FONT></B>
<P><dir><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>Entidade</FONT></B><FONT SIZE=2>
- C&oacute;digo da entidade a partir da qual ser&aacute; gerada
a tabela, no padr&atilde;o SADS (sssEaaa);</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>Tabela</FONT></B><FONT SIZE=2> -
C&oacute;digo da tabela a ser gerada, no padr&atilde;o SADS (sssMnnnn).</dir></dir>
<P>
<A NAME="Repos"><B><FONT SIZE=4>Especifica&ccedil;&atilde;o no
reposit&oacute;rio</FONT></B></A>
<P>
<FONT SIZE=2>A especifica&ccedil;&atilde;o da tabela consiste
em definir o c&oacute;digo e o nome da tabela no reposit&oacute;rio
de dados do SADS.</FONT>
<P>
<FONT SIZE=2>O nome da tabela dever&aacute; identificar resumidamente,
com tamanho m&aacute;ximo de 40 caracteres, que informa&ccedil;&otilde;es
est&atilde;o nela armazenadas.</FONT>
<P>
<FONT SIZE=2>Para efetuar o cadastramento da especifica&ccedil;&atilde;o
de uma tabela, &eacute; necess&aacute;rio que o sistema j&aacute;
esteja cadastrado no reposit&oacute;rio de dados do SADS. No caso
da tabela ter sido gerada a partir de entidade, sua especifica&ccedil;&atilde;o
j&aacute; estar&aacute; cadastrada no reposit&oacute;rio de dados.</FONT>
<P><dir>
<B><FONT SIZE=2 COLOR=#000000>CAMPOS DA TELA</FONT></B>
<P><dir><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TABELA </FONT></B><FONT SIZE=2>-
C&oacute;digo da tabela no padr&atilde;o SADS (sssMnnnn);</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>NOME</FONT></B><FONT SIZE=2> - Descri&ccedil;&atilde;o
resumida da tabela.</FONT>
<P>
<FONT SIZE=2>Esta descri&ccedil;&atilde;o visa indicar, de modo
resumido, que informa&ccedil;&otilde;es s&atilde;o armazenadas
na tabela.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>OPERACAO</FONT></B><FONT SIZE=2>
- Opera&ccedil;&atilde;o efetuada em rela&ccedil;&atilde;o &agrave;
especifica&ccedil;&atilde;o de tabela.</FONT>
<P>
<FONT SIZE=2>As opera&ccedil;&otilde;es poss&iacute;veis s&atilde;o
as seguintes:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;INC&quot; (Inclus&atilde;o);</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;ALT&quot; (Altera&ccedil;&atilde;o);</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;EXC&quot; (Exclus&atilde;o);</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;CON&quot; (Consulta).</dir></dir></dir>
<P>
<A NAME="Estab"><B><FONT SIZE=4>Cadastramento de estrutura de
tabela</FONT></B></A>
<P>
<FONT SIZE=2>Definir estrutura de tabela significa relacionar
os atributos e campos que a comp&otilde;em, identificando aqueles
que fazem parte da chave e indicando os que s&atilde;o opcionais.</FONT>
<P>
<FONT SIZE=2>Caso a tabela tenha sido gerada a partir de uma entidade,
sua estrutura j&aacute; estar&aacute; cadastrada no reposit&oacute;rio
de dados.</FONT>
<P>
<FONT SIZE=2>Quando uma tabela tem especifica&ccedil;&atilde;o
de valida&ccedil;&atilde;o de data, na defini&ccedil;&atilde;o
de sua estrutura e desenho, as seguintes regras devem ser observadas:</FONT>
<ul type=disc><li>O atributo ou campo reservado &agrave; data deve
estar definido como o &uacute;ltimo campo da chave;</FONT>
<li>Para o crit&eacute;rio &quot;3&quot; (&quot;De -
At&eacute;&quot;), deve-se definir tamb&eacute;m o atributo ou
campo reservado &agrave; data final como sendo o primeiro campo
de informa&ccedil;&atilde;o (delimitado por colchetes no desenho
da tabela);</FONT>
<li>Os atributos ou campos definidos para as datas devem
possuir formato num&eacute;rico com invers&atilde;o (Formato =
&quot;N&quot; e Padr&atilde;o = &quot;INV&quot;) em suas defini&ccedil;&otilde;es
ou na estrutura da consist&ecirc;ncia da tabela.</ul>
<P>
<FONT SIZE=2>Na altera&ccedil;&atilde;o da estrutura de tabela
j&aacute; liberada e com itens cadastrados, para evitar perdas
de conte&uacute;do de itens, alguns cuidados devem ser tomados,
quais sejam:</FONT>
<ul type=disc><li>Atributos ou campos que forem eliminados da estrutura
da tabela ter&atilde;o seus conte&uacute;dos perdidos na reorganiza&ccedil;&atilde;o
de seus itens;</FONT>
<li>Os sufixos dos atributos e campos da estrutura s&atilde;o
considerados como parte integrante de seus c&oacute;digos. Portanto,
uma altera&ccedil;&atilde;o no sufixo equivale na exclus&atilde;o
de um atributo ou campo e na inclus&atilde;o de outro.</FONT>
<li>Altera&ccedil;&otilde;es nos formatos e tamanhos
dos atributos e campos da tabela podem ocasionar perda de parte
do conte&uacute;do, na reorganiza&ccedil;&atilde;o de seus itens.</ul>
<P>
<FONT SIZE=2>Ap&oacute;s cadastrada a estrutura da tabela, &eacute;
poss&iacute;vel gerar sua </FONT><I><FONT SIZE=2 COLOR=#000000>library</FONT></I><FONT SIZE=2>
Cobol, consistir se o desenho est&aacute; correto, gerar a estrutura
da consist&ecirc;ncia geral e torn&aacute;-la dispon&iacute;vel
para utiliza&ccedil;&atilde;o pelo gerador de programas nas movimenta&ccedil;&otilde;es
entre estruturas.</FONT>
<P>
<FONT SIZE=2>Para cadastrar a estrutura de uma tabela, &eacute;
necess&aacute;rio que a tabela e todos os atributos e campos que
ir&atilde;o comp&ocirc;-la j&aacute; tenham sido definidos no
reposit&oacute;rio de dados do SADS.</FONT>
<P>
<FONT SIZE=2>No contexto de tabela, entenda-se atributo como sendo
atributo propriamente dito, campo ou sin&ocirc;nimo.</FONT>
<P><dir>
<B><FONT SIZE=2 COLOR=#000000>CAMPOS DA TELA</FONT></B>
<P><dir><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TABELA</FONT></B><FONT SIZE=2> -
C&oacute;digo da tabela no padr&atilde;o SADS (sssMnnnn).</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>SEQ </FONT></B><FONT SIZE=2>- N&uacute;mero
para posicionamento do atributo na estrutura da tabela.</FONT>
<P>
<FONT SIZE=2>O primeiro n&uacute;mero &eacute; &quot;0010&quot;
e os demais, acrescidos de 10.</FONT>
<P>
<FONT SIZE=2>Para incluir um atributo entre dois outros j&aacute;
inclu&iacute;dos, &eacute; necess&aacute;rio preencher uma linha
que esteja em branco e alterar o n&uacute;mero sequencial desta
linha para um n&uacute;mero entre os j&aacute; existentes. O SADS
reorganizar&aacute; automaticamente a estrutura. Na pr&oacute;xima
opera&ccedil;&atilde;o os atributos j&aacute; estar&atilde;o na
nova ordem.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>ATRIBUTO</FONT></B><FONT SIZE=2>
- Atributo que ir&aacute; compor a estrutura dos itens da tabela.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>SUF</FONT></B><FONT SIZE=2>- Sufixo
diferenciador do c&oacute;digo do atributo.</FONT>
<P>
<FONT SIZE=2>O sufixo &eacute; utilizado quando for necess&aacute;rio
referenciar um mesmo atributo mais de uma vez na estrutura da
tabela. Neste caso, para diferenciar suas ocorr&ecirc;ncias, deve-se
cadastrar sufixos diferentes para cada um deles.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>NIVEL </FONT></B><FONT SIZE=2>-
N&iacute;vel de estrutura&ccedil;&atilde;o do atributo.</FONT>
<P>
<FONT SIZE=2>Semelhante ao n&iacute;vel de defini&ccedil;&atilde;o
de campos da WORKING-STORAGE SECTION do Cobol.</FONT>
<P>
<FONT SIZE=2>O n&iacute;vel serve para identificar a hierarquia
existente entre os atributos, diferenciando aqueles que s&atilde;o
itens grupos daqueles elementares dentro da estrutura da tabela.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>NDEF</FONT></B><FONT SIZE=2> - N&iacute;vel
de defini&ccedil;&atilde;o do atributo.</FONT>
<P>
<FONT SIZE=2>O n&iacute;vel de defini&ccedil;&atilde;o indica
se o atributo est&aacute; ou n&atilde;o definido no reposit&oacute;rio
de dados do SADS.</FONT>
<P>
<FONT SIZE=2>Os n&iacute;veis de defini&ccedil;&atilde;o v&aacute;lidos
s&atilde;o :</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;S&quot; - Para atributo pertencente ao sistema
indicado no campo SIS ou, quando o campo SIS n&atilde;o for informado,
para atributo pertencente ao sistema da tabela;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;G&quot; - Para atributo definido para utiliza&ccedil;&atilde;o
gen&eacute;rica no SADS.</dir>
<P>
<FONT SIZE=2>Se o n&iacute;vel de defini&ccedil;&atilde;o n&atilde;o
for informado, o SADS assumir&aacute; o atributo como item grupo
e, neste caso, o erro ser&aacute; acusado no processo de libera&ccedil;&atilde;o
da tabela.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>SIS</FONT></B><FONT SIZE=2> - C&oacute;digo
do sistema no qual o atributo est&aacute; definido.</FONT>
<P>
<FONT SIZE=2>Este campo dever&aacute; ser informado somente quando
NDEF for igual a &quot;S&quot; e o atributo n&atilde;o estiver
definido no mesmo sistema da tabela.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>OPC</FONT></B><FONT SIZE=2> - Indicador
de atributo opcional no momento da inclus&atilde;o ou altera&ccedil;&atilde;o
de itens na tabela. </FONT>
<P>
<FONT SIZE=2>O valor poss&iacute;vel &eacute; o seguinte:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;S&quot; - Para atributo cujo preenchimento
&eacute; opcional no momento da inclus&atilde;o ou altera&ccedil;&atilde;o
de itens da tabela.</dir>
<P>
<FONT SIZE=2>Caso este campo n&atilde;o seja informado, ser&aacute;
obrigat&oacute;rio o preenchimento do atributo no momento da inclus&atilde;o
ou altera&ccedil;&atilde;o de itens na tabela.</FONT>
<P>
<FONT SIZE=2>Esta informa&ccedil;&atilde;o s&oacute; ser&aacute;
utilizada se a consist&ecirc;ncia da tabela for gerada a partir
da mesma.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>CLAS</FONT></B><FONT SIZE=2> - Classifica&ccedil;&atilde;o
do atributo dentro da estrutura da tabela.</FONT>
<P>
<FONT SIZE=2>As classifica&ccedil;&otilde;es poss&iacute;veis
s&atilde;o as seguintes:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;C&quot; - Para atributo que comp&otilde;e a
chave prim&aacute;ria da tabela;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;P&quot; ou &quot; &quot; - Para atributo que
&eacute; pr&oacute;prio da tabela, mas n&atilde;o faz parte da
chave prim&aacute;ria.</dir>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TAM </FONT></B><FONT SIZE=2>- Tamanho
do atributo na estrutura da tabela.</FONT>
<P>
<FONT SIZE=2>Este campo n&atilde;o pode ser informado caso tenha
sido parametrizado na tabela SBPM5000 que os atributos/campos
n&atilde;o podem ter seus tamanhos redefinidos nas estruturas
nas quais s&atilde;o inclu&iacute;dos.</FONT>
<P>
<FONT SIZE=2>Maiores detalhes a respeito desta parametriza&ccedil;&atilde;o,
deve-se consultar a Se&ccedil;&atilde;o V, &quot;Parametriza&ccedil;&otilde;es
do SADS&quot;, item &quot;Atributo&quot;, subitem &quot;Redefini&ccedil;&atilde;o
em estruturas&quot;. </FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>SIN </FONT></B><FONT SIZE=2>- Sinal
do atributo na estrutura da tabela.</FONT>
<P>
<FONT SIZE=2>Os valores poss&iacute;veis s&atilde;o os seguintes:</FONT>
<P><dir>
<p><img src="Bullet7.gif" width=13 heigth=13><b>&quot;S&quot;</b> - Atributo com sinal e sem decimais;
<p><img src="Bullet7.gif" width=13 heigth=13><b>&quot;D&quot;</b> - Atributo com decimais e sem sinal;
<p><img src="Bullet7.gif" width=13 heigth=13><b>&quot;A&quot;</b> - Atributo com sinal e decimais;
<p><img src="Bullet7.gif" width=13 heigth=13><b>&quot;N&quot;</b> - Atributo sem sinal e decimais.</dir>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>DEC</FONT></B><FONT SIZE=2> - N&uacute;mero
de casas decimais do atributo na estrutura da tabela.</FONT>
<P>
<FONT SIZE=2>Este campo deve ser informado somente quando o atributo
tiver um tamanho diferente daquele para ele cadastrado no reposit&oacute;rio
de dados do SADS.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>OCCURS</FONT></B><FONT SIZE=2> -
N&uacute;mero de ocorr&ecirc;ncias do atributo dentro da estrutura
do item tabela.</FONT>
<P>
<FONT SIZE=2>Caso o atributo com ocorr&ecirc;ncias seja um item
grupo, este n&uacute;mero ir&aacute; indicar quantas vezes seus
itens elementares ocorrem.</FONT>
<P>
<FONT SIZE=2>N&atilde;o podem ser consideradas as ocorr&ecirc;ncias
autom&aacute;ticas, ou seja, as ocorr&ecirc;ncias geradas quando
na tela de capta&ccedil;&atilde;o de itens da tabela, comporta
mais de um item.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>CONTINUA (S/N)</FONT></B><FONT SIZE=2>
- Indicador de continuidade de opera&ccedil;&atilde;o.</FONT>
<P>
<FONT SIZE=2>As possibilidades de preenchimento deste campo s&atilde;o
as seguintes:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;S&quot; - Nova tela ser&aacute; aberta para
prosseguir informando mais atributos na estrutura;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;N&quot; - &Uacute;ltima tela para opera&ccedil;&atilde;o
com estrutura de tela.</dir>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>OPERACAO</FONT></B><FONT SIZE=2>
- Opera&ccedil;&atilde;o efetuada em rela&ccedil;&atilde;o &agrave;
estrutura da tabela.</FONT>
<P>
<FONT SIZE=2>As opera&ccedil;&otilde;es poss&iacute;veis s&atilde;o
as seguintes:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;INC&quot; (Inclus&atilde;o);</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;ALT&quot; (Altera&ccedil;&atilde;o);</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;EXC&quot; (Exclus&atilde;o);</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;CON&quot; (Consulta).</dir></dir></dir>
<P>
<A NAME="Chasec"><B><FONT SIZE=4>Cadastramento de chaves secund&aacute;rias</FONT></B></A>
<P>
<FONT SIZE=2>Chaves secund&aacute;rias s&atilde;o vias para acesso
aos itens da tabela, segundo uma classifica&ccedil;&atilde;o diferente
da existente para a chave prim&aacute;ria.</FONT>
<P>
<FONT SIZE=2>No momento da defini&ccedil;&atilde;o dos par&acirc;metros
da tabela, at&eacute; tr&ecirc;s chaves (B, C e D) podem ser especificadas
para a mesma.</FONT>
<P>
<FONT SIZE=2>Para cada chave selecionada, deve-se cadastrar a
sua estrutura no reposit&oacute;rio de dados do SADS.</FONT>
<P>
<FONT SIZE=2>As estruturas das chaves secund&aacute;rias podem
ser compostas por um ou mais atributos, pertencentes ou n&atilde;o
&agrave; chave prim&aacute;ria, com o tamanho m&aacute;ximo de
50 posi&ccedil;&otilde;es.</FONT>
<P>
<FONT SIZE=2>Os atributos da chave secund&aacute;ria devem obrigatoriamente
pertencer &agrave; estrutura da tabela.</FONT>
<P>
<FONT SIZE=2>A valida&ccedil;&atilde;o do tamanho da chave secund&aacute;ria
&eacute; efetuada no momento da libera&ccedil;&atilde;o da tabela
para teste.</FONT>
<P>
<FONT SIZE=2>As chaves secund&aacute;rias podem ser utilizadas
para as consultas e emiss&otilde;es </FONT><I><FONT SIZE=2 COLOR=#000000>on-line
</FONT></I><FONT SIZE=2>atrav&eacute;s do gerenciador de tabelas
do SADS e pelos programas aplicativos, atrav&eacute;s da sub-rotina
SSTS01.</FONT>
<P>
<FONT SIZE=2>Para cadastrar uma chave secund&aacute;ria, &eacute;
necess&aacute;rio que a estrutura da tabela j&aacute; tenha sido
cadastrada no reposit&oacute;rio de dados do SADS e que no par&acirc;metro
de tabela tenha sido especificado o uso de chave secund&aacute;ria.</FONT>
<P><dir>
<B><FONT SIZE=2 COLOR=#000000>CAMPOS DA TELA</FONT></B>
<P><dir><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TABELA</FONT></B><FONT SIZE=2> -
C&oacute;digo da tabela no padr&atilde;o SADS (sssMnnnn).</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>CHAVE</FONT></B><FONT SIZE=2> -
Identificador da chave secund&aacute;ria da tabela.</FONT>
<P>
<FONT SIZE=2>Pode-se utilizar as letras &quot;B&quot;, &quot;C&quot;
ou &quot;D&quot;.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>NOME </FONT></B><FONT SIZE=2>- Descri&ccedil;&atilde;o
resumida da chave secund&aacute;ria da tabela.</FONT>
<P>
<FONT SIZE=2>O nome tem o objetivo de identificar, de maneira
reduzida, a ordem para a qual a chave secund&aacute;ria est&aacute;
sendo definida.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>SEQ </FONT></B><FONT SIZE=2>- N&uacute;mero
para posicionamento do atributo na estrutura da chave secund&aacute;ria
da tabela.</FONT>
<P>
<FONT SIZE=2>O primeiro n&uacute;mero &eacute; &quot;0010&quot;
e os demais, acrescidos de 10.</FONT>
<P>
<FONT SIZE=2>Para incluir um atributo entre dois outros j&aacute;
inclu&iacute;dos, &eacute; necess&aacute;rio preencher uma linha
que esteja em branco e alterar o n&uacute;mero sequencial desta
linha para um n&uacute;mero entre os j&aacute; informados. O SADS
reorganizar&aacute; automaticamente a estrutura. Na pr&oacute;xima
opera&ccedil;&atilde;o os atributos j&aacute; estar&atilde;o na
nova ordem.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>ATRIBUTO</FONT></B><FONT SIZE=2>
- Atributo que ir&aacute; compor a chave secund&aacute;ria da
tabela.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>SUFIXO</FONT></B><FONT SIZE=2> -
Sufixo diferenciador do c&oacute;digo do atributo.</FONT>
<P>
<FONT SIZE=2>O sufixo &eacute; utilizado quando for necess&aacute;rio
referenciar um mesmo atributo mais de uma vez na estrutura de
chave secund&aacute;ria de uma tabela. Neste caso, para diferenciar
suas ocorr&ecirc;ncias, deve-se cadastrar sufixos diferentes para
cada um deles.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>CONTINUA (S/N) </FONT></B><FONT SIZE=2>-
Indicador de continuidade de opera&ccedil;&atilde;o.</FONT>
<P>
<FONT SIZE=2>As possibilidades de preenchimento deste campo s&atilde;o
as seguintes:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>
&quot;S&quot; - Nova tela ser&aacute; aberta para
prosseguir informando mais atributos na estrutura da chave secund&aacute;ria;
<p><img src="Bullet7.gif" width=13 heigth=13>
&quot;N&quot; - &Uacute;ltima tela para opera&ccedil;&atilde;o
com chave secund&aacute;ria.</dir>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>OPERACAO</FONT></B><FONT SIZE=2>
- Opera&ccedil;&atilde;o efetuada em rela&ccedil;&atilde;o &agrave;
chave secund&aacute;ria de tabela.</FONT>
<P>
<FONT SIZE=2>As opera&ccedil;&otilde;es poss&iacute;veis s&atilde;o
as seguintes:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>&quot;INC&quot; (Inclus&atilde;o);
<p><img src="Bullet7.gif" width=13 heigth=13>&quot;ALT&quot; (Altera&ccedil;&atilde;o);
<p><img src="Bullet7.gif" width=13 heigth=13>&quot;EXC&quot; (Exclus&atilde;o);
<p><img src="Bullet7.gif" width=13 heigth=13>&quot;CON&quot; (Consulta).</dir></dir></dir>
<P>
<A NAME="Gerlib"><B><FONT SIZE=5>Gera&ccedil;&atilde;o de </FONT><FONT SIZE=5 COLOR=#000000>library</FONT><FONT SIZE=5>
de tabela</FONT></B></A>
<P>
<FONT SIZE=2>A gera&ccedil;&atilde;o de </FONT><I><FONT SIZE=2 COLOR=#000000>library</FONT></I><FONT SIZE=2>
de tabela compreende &agrave; cria&ccedil;&atilde;o de um fonte
Cobol, relativo &agrave; sua estrutura, para ser utilizado na
</FONT><I><FONT SIZE=2 COLOR=#000000>working-storage-section</FONT></I><FONT SIZE=2>
dos programas que fizerem acesso a ela.</FONT>
<P>
<FONT SIZE=2>A </FONT><I><FONT SIZE=2 COLOR=#000000>library</FONT></I><FONT SIZE=2>
cont&eacute;m os atributos e campos que comp&otilde;em a tabela
em duas estruturas distintas: na primeira est&atilde;o os atributos
e campos da chave prim&aacute;ria e, na segunda, os atributos
e campos de dados.</FONT>
<P>
<FONT SIZE=2>A seguir, &eacute; apresentado um exemplo de </FONT><I><FONT SIZE=2 COLOR=#000000>library</FONT></I><FONT SIZE=2>
de tabela.</FONT>
<P>
<FONT SIZE=2>Para a tabela &quot;SXYM5000 - Filiais&quot;, temos
a </FONT><I><FONT SIZE=2 COLOR=#000000>library</FONT></I><FONT SIZE=2>:<Pre><FONT SIZE=3>
  01  YM5000-SXYM5000
    05  YM5000-TBLARG.
         10  YM5000-EMPCOD          PIC 9(003).
         10  YM5000-FILCOD          PIC 9(004).
    05  YM5000-TBLITEM.
         10 YM5000-FILNOM           PIC X(040).
         10 YM5000-FILEND           PIC X(150).
         10 YM5000-FILCGC           PIC 9(014).
</PRE>
</FONT>
<P>
<FONT SIZE=2>Os campos utilizados como grupos da chave e dos dados,
TBLARG e TBLITEM, s&atilde;o gen&eacute;ricos e colocados automaticamente
na gera&ccedil;&atilde;o da </FONT><I><FONT SIZE=2 COLOR=#000000>library</FONT></I><FONT SIZE=2>,
n&atilde;o sendo necess&aacute;rio defini-los nas estruturas das
tabelas.</FONT>
<P>
<FONT SIZE=2>Os prefixos dos campos de </FONT><I><FONT SIZE=2 COLOR=#000000>library</FONT></I><FONT SIZE=2>
de tabelas t&ecirc;m a seguinte forma&ccedil;&atilde;o :</FONT>
<P>
<FONT SIZE=2>Terceira letra do sistema (&quot;Y&quot;, no exemplo)
+ a letra &quot;M&quot; (que identifica uma tabela) + o n&uacute;mero
da tabela (&quot;5000&quot;, no exemplo) seguido do mnem&ocirc;nico
do atributo ou campo.</FONT>
<P>
<FONT SIZE=2>O modo de utiliza&ccedil;&atilde;o da </FONT><I><FONT SIZE=2 COLOR=#000000>library</FONT></I><FONT SIZE=2>
nos programas aplicativos est&aacute; descrito no t&oacute;pico
&quot;Interface com Aplicativos&quot;, neste mesmo item.</FONT>
<P>
<FONT SIZE=2>A gera&ccedil;&atilde;o de </FONT><I><FONT SIZE=2 COLOR=#000000>library</FONT></I><FONT SIZE=2>
de tabela n&atilde;o est&aacute; relacionada a nenhuma tela de
processamento. Para ger&aacute;-la, basta transmitir os argumentos
do menu de opera&ccedil;&atilde;o &quot;GERLIBTAB&quot;, cujos
campos s&atilde;o apresentados a seguir:</FONT>
<P><dir>
<B><FONT SIZE=2 COLOR=#000000>CAMPOS DA TELA</FONT></B>
<P><dir><img src="Bullet5.gif" width=13 Heigth=13>
<B><FONT SIZE=2 COLOR=#000000>Tabela </FONT></B><FONT SIZE=2>-
C&oacute;digo da tabela a ser gerada, no padr&atilde;o SADS (sssMnnnn).</FONT>
<P><img src="Bullet5.gif" width=13 Heigth=13>
<B><FONT SIZE=2 COLOR=#000000>Ambiente </FONT></B><FONT SIZE=2>-
Ambiente na qual a </FONT><I><FONT SIZE=2 COLOR=#000000>library</FONT></I><FONT SIZE=2>
da tabela ser&aacute; gerada.</FONT>
<P>
<FONT SIZE=2>Os ambientes poss&iacute;veis s&atilde;o:</FONT>
<P><dir><img src="Bullet7.gif" width=13 Heigth=13>
<FONT SIZE=2>&quot;T&quot; - Para gerar a </FONT><I><FONT SIZE=2 COLOR=#000000>library</FONT></I><FONT SIZE=2>
para o ambiente de teste. 
<P>
<FONT SIZE=2>Neste caso, ela ser&aacute; utilizada por programas
compilados para teste.</FONT>
<P><img src="Bullet7.gif" width=13 Heigth=13>
<FONT SIZE=2>&quot;P&quot; - Para gerar a </FONT><I><FONT SIZE=2 COLOR=#000000>library</FONT></I><FONT SIZE=2>
para o ambiente de produ&ccedil;&atilde;o.</FONT>
<P>
<FONT SIZE=2>Neste caso, ela ser&aacute; utilizada por programas
compilados para produ&ccedil;&atilde;o. </FONT>
<P>
<FONT SIZE=2>Se o ambiente de produ&ccedil;&atilde;o para gera&ccedil;&atilde;o
de </FONT><I><FONT SIZE=2 COLOR=#000000>libraries</FONT></I><FONT SIZE=2>
n&atilde;o especificar </FONT><I><FONT SIZE=2 COLOR=#000000>usercode
(usercode *), as libraries</FONT></I><FONT SIZE=2> ser&atilde;o
utilizadas simultaneamente para compila&ccedil;&otilde;es para
teste e produ&ccedil;&atilde;o.</dir>
<P>
<FONT SIZE=2>Caso o ambiente n&atilde;o seja informado, ser&aacute;
assumido o ambiente </FONT><I><FONT SIZE=2 COLOR=#000000>default</FONT></I><FONT SIZE=2>
do usu&aacute;rio. Detalhes sobre o cadastramento do ambiente
</FONT><I><FONT SIZE=2 COLOR=#000000>default</FONT></I><FONT SIZE=2>
do usu&aacute;rio podem ser obtidos na se&ccedil;&atilde;o VI,
&quot;Sistema de Seguran&ccedil;a&quot;, item &quot;Usu&aacute;rios
e habilita&ccedil;&otilde;es&quot;.</FONT>
<P><img src="Bullet5.gif" width=13 Heigth=13>
<B><FONT SIZE=2 COLOR=#000000>Usercode </FONT></B><FONT SIZE=2>-
</FONT><I><FONT SIZE=2 COLOR=#000000>Usercode</FONT></I><FONT SIZE=2>
de an&aacute;lise.</FONT>
<P>
<FONT SIZE=2>O </FONT><I><FONT SIZE=2 COLOR=#000000>usercode</FONT></I><FONT SIZE=2>
a ser informado deve estar habilitado ao usu&aacute;rio, como
elemento, em sua lista de elementos &quot;SEGUSER&quot;, no Sistema
de Seguran&ccedil;a. Detalhes sobre este cadastramento est&atilde;o
descritos na Se&ccedil;&atilde;o VI, &quot;Sistema de Seguran&ccedil;a&quot;,
item &quot;Habilita&ccedil;&otilde;es de usu&aacute;rios SADS&quot;.</FONT>
<P>
<FONT SIZE=2>Caso o </FONT><I><FONT SIZE=2 COLOR=#000000>usercode</FONT></I><FONT SIZE=2>
n&atilde;o seja informado, ser&aacute; assumido o </FONT><I><FONT SIZE=2 COLOR=#000000>usercode</FONT></I><FONT SIZE=2>
</FONT><I><FONT SIZE=2 COLOR=#000000>default</FONT></I><FONT SIZE=2>
do usu&aacute;rio. Detalhes sobre o cadastramento do </FONT><I><FONT SIZE=2 COLOR=#000000>usercode</FONT></I><FONT SIZE=2>
</FONT><I><FONT SIZE=2 COLOR=#000000>default</FONT></I><FONT SIZE=2>
do usu&aacute;rio podem ser obtidos na Se&ccedil;&atilde;o VI,
&quot;Sistema de Seguran&ccedil;a&quot;, item &quot;Usu&aacute;rios
e habilita&ccedil;&otilde;es&quot;.</FONT>
<P>
<FONT SIZE=2>Para </FONT><I><FONT SIZE=2 COLOR=#000000>usercodes</FONT></I><FONT SIZE=2>
de an&aacute;lise, s&atilde;o definidos os elementos (</FONT><I><FONT SIZE=2 COLOR=#000000>usercode</FONT></I><FONT SIZE=2>
e disco) onde ficar&atilde;o residentes suas </FONT><I><FONT SIZE=2 COLOR=#000000>libraries</FONT></I><FONT SIZE=2>
de teste e produ&ccedil;&atilde;o, sendo poss&iacute;vel que as
</FONT><I><FONT SIZE=2 COLOR=#000000>libraries</FONT></I><FONT SIZE=2>
de produ&ccedil;&atilde;o fiquem sem </FONT><I><FONT SIZE=2 COLOR=#000000>usercodes</FONT></I><FONT SIZE=2>.
Estas defini&ccedil;&otilde;es est&atilde;o na tabela SBPM5002,
que se encontra descrita na se&ccedil;&atilde;o V, &quot;Parametriza&ccedil;&otilde;es
do SADS&quot;, neste manual.</FONT></dir></dir></dir>
<P>
<A NAME="Gercon"><B><FONT SIZE=5>Gera&ccedil;&atilde;o de consist&ecirc;ncia
de tabela</FONT></B></A>
<P>
<FONT SIZE=2>A consist&ecirc;ncia compreende os testes e valida&ccedil;&otilde;es
a que ser&atilde;o submetidos os itens nas inclus&otilde;es e
manuten&ccedil;&otilde;es da tabela.</FONT>
<P>
<FONT SIZE=2>A consist&ecirc;ncia &eacute; utilizada pelos programas
do Gerenciador de Tabelas do SADS, nas opera&ccedil;&otilde;es
de manuten&ccedil;&atilde;o de itens da tabela (inclus&atilde;o
e altera&ccedil;&atilde;o), para fazer a cr&iacute;tica da entrada
de dados, conforme os testes cadastrados em sua estrutura. </FONT>
<P>
<FONT SIZE=2>A estrutura da consist&ecirc;ncia da tabela pode
ser cadastrada diretamente ou gerada automaticamente pelo SADS,
a partir da estrutura da tabela.</FONT>
<P>
<FONT SIZE=2>As fun&ccedil;&otilde;es de gera&ccedil;&atilde;o
de consist&ecirc;ncia a partir de tabela, de cadastramento de
estrutura de consist&ecirc;ncia e de seus testes espec&iacute;ficos,
est&atilde;o descritas no item &quot;Consist&ecirc;ncia Geral&quot;,
nesta se&ccedil;&atilde;o.</FONT>
<P>
<A NAME="Libtab"><B><FONT SIZE=5>Libera&ccedil;&atilde;o de tabela</FONT></B></A>
<P>
<FONT SIZE=2>A libera&ccedil;&atilde;o &eacute; o processo que
torna a tabela dispon&iacute;vel em determinado ambiente para
que os usu&aacute;rios, atrav&eacute;s do gerenciador de tabelas
do SADS, possam executar opera&ccedil;&otilde;es com seus itens.</FONT>
<P>
<FONT SIZE=2>Estas opera&ccedil;&otilde;es poder&atilde;o ser
executadas somente para os itens do ambiente para o qual a tabela
foi liberada. Portanto, se a tabela foi liberada para teste, as
opera&ccedil;&otilde;es com estes itens estar&atilde;o dispon&iacute;veis
apenas para os usu&aacute;rios que fizerem </FONT><I><FONT SIZE=2 COLOR=#000000>logon</FONT></I><FONT SIZE=2>
neste ambiente, se para produ&ccedil;&atilde;o, as opera&ccedil;&otilde;es
estar&atilde;o dispon&iacute;veis somente para os usu&aacute;rios
que fizerem </FONT><I><FONT SIZE=2 COLOR=#000000>logon</FONT></I><FONT SIZE=2>
no ambiente de produ&ccedil;&atilde;o.</FONT>
<P>
<FONT SIZE=2>Os itens de uma tabela s&atilde;o armazenados nos
ambientes de teste e produ&ccedil;&atilde;o. Deste modo, as altera&ccedil;&otilde;es
efetuadas em uma tabela somente refletir&atilde;o nestes ambientes
ap&oacute;s efetuada a sua libera&ccedil;&atilde;o e reorganiza&ccedil;&atilde;o.</FONT>
<P>
<FONT SIZE=2>Concluindo, as libera&ccedil;&otilde;es s&atilde;o
as seguintes, de acordo com o ambiente destino da tabela:</FONT>
<P>
<b>Libera&ccedil;&atilde;o para testes</b> - Esta libera&ccedil;&atilde;o
consiste em colocar uma tabela, residente em desenvolvimento ou
em manuten&ccedil;&atilde;o, dispon&iacute;vel para uso no ambiente
de teste, sendo a vers&atilde;o em desenvolvimento ou manuten&ccedil;&atilde;o
exclu&iacute;da ap&oacute;s a sua libera&ccedil;&atilde;o.</FONT>
<P>
<b>Libera&ccedil;&atilde;o para produ&ccedil;&atilde;o</b>
- Esta libera&ccedil;&atilde;o consiste em colocar a tabela, residente
no ambiente de teste, dispon&iacute;vel para uso no ambiente de
produ&ccedil;&atilde;o, mantendo a vers&atilde;o em teste ap&oacute;s
a sua libera&ccedil;&atilde;o. No procedimento de libera&ccedil;&atilde;o
para a produ&ccedil;&atilde;o, ser&atilde;o tamb&eacute;m liberadas
as consist&ecirc;ncias das tabelas que estiverem com o </FONT><I><FONT SIZE=2 COLOR=#000000>status</FONT></I><FONT SIZE=2>
de &quot;a liberar para produ&ccedil;&atilde;o&quot;.</FONT>
<P>
<FONT SIZE=2>Na opera&ccedil;&atilde;o de libera&ccedil;&atilde;o
de uma tabela em teste para produ&ccedil;&atilde;o, os itens da
mesma n&atilde;o ser&atilde;o copiados. Portanto, para copiar
os itens de uma mesma tabela entre ambientes, deve-se utilizar
a fun&ccedil;&atilde;o &quot;C&oacute;pia de itens entre ambientes&quot;,
descrita no t&oacute;pico &quot;Fun&ccedil;&otilde;es de apoio&quot;,
neste mesmo item.</FONT>
<P>
<FONT SIZE=2>A libera&ccedil;&atilde;o para produ&ccedil;&atilde;o
torna a tabela dispon&iacute;vel para utiliza&ccedil;&atilde;o
no ambiente de produ&ccedil;&atilde;o do mesmo computador onde
ela foi liberada. Para que esta libera&ccedil;&atilde;o seja refletida
em outros computadores, deve-se utilizar a fun&ccedil;&atilde;o
&quot;Transfer&ecirc;ncia entre computadores&quot;, descrita no
t&oacute;pico &quot;Fun&ccedil;&otilde;es de apoio&quot;, neste
mesmo item.</FONT>
<P>
<FONT SIZE=2>No momento da libera&ccedil;&atilde;o para o ambiente
de teste, algumas valida&ccedil;&otilde;es s&atilde;o efetuadas,
quais sejam:</FONT>
<ul type=disc>
<li>Se o tamanho dos campos chaves e de informa&ccedil;&atilde;o
n&atilde;o excedem o m&aacute;ximo permitido (30 e 300 caracteres
respectivamente);</FONT>
<li>Se o tamanho das chaves secund&aacute;rias n&atilde;o
excedem o m&aacute;ximo permitido de 50 caracteres;</FONT>
<li>Se os atributos e campos da estrutura est&atilde;o
em posi&ccedil;&atilde;o e com tamanhos compat&iacute;veis com
o desenho da tabela;</FONT>
<li>Se, na estrutura da tabela, os campos de data est&atilde;o
compat&iacute;veis com o crit&eacute;rio definido para ela, caso
exista.</ul>
<P>
<FONT SIZE=2>Caso haja alguma incoer&ecirc;ncia, o erro &eacute;
acusado e a libera&ccedil;&atilde;o n&atilde;o &eacute; efetuada.</FONT>
<P>
<FONT SIZE=2>Antes de liberar tabelas anteriormente dispon&iacute;veis
e com itens cadastrados, algumas verifica&ccedil;&otilde;es devem
ser feitas, quais sejam:</FONT>
<ul type=disc>
<li>Se houve altera&ccedil;&atilde;o no formato e/ou
tamanho dos atributos e campos de sua estrutura, pois redu&ccedil;&otilde;es
no tamanho podem ocasionar o truncamento e perda dos conte&uacute;dos,
&agrave; esquerda ou &agrave; direita, dependendo do formato;</FONT>
<li>Se houve troca ou exclus&atilde;o de atributos ou
campos da estrutura, pois, neste caso, os conte&uacute;dos relativos
aos atributos ou campos que sa&iacute;ram da tabela ser&atilde;o
perdidos;</FONT>
<li>Se houve altera&ccedil;&atilde;o de sufixos dos
atributos e campos, pois, como estes fazem parte dos mnem&ocirc;nicos,
se a altera&ccedil;&atilde;o for confirmada, ser&aacute; considerado
que houve exclus&atilde;o de um atributo ou campo e inclus&atilde;o
de um novo, tendo este perdido o seu conte&uacute;do original.</ul>
<P>
<FONT SIZE=2>Ap&oacute;s a libera&ccedil;&atilde;o de uma tabela
que j&aacute; possui itens cadastrados, ela poder&aacute; necessitar
de uma reorganiza&ccedil;&atilde;o nos seus itens. Esta necessidade
&eacute; detectada de acordo com o tipo de altera&ccedil;&atilde;o
ocorrida.</FONT>
<P>
<FONT SIZE=2>Tipos de altera&ccedil;&atilde;o que requerem a reorganiza&ccedil;&atilde;o
dos itens de uma tabela:</FONT>
<ul type=disc>
<li>Altera&ccedil;&atilde;o da estrutura ou de alguma
das chaves secund&aacute;rias;</FONT>
<li>Altera&ccedil;&atilde;o do formato ou do tamanho
de algum atributo pertencente &agrave; estrutura da tabela;</FONT>
<li>Inclus&atilde;o ou exclus&atilde;o de uma chave
secund&aacute;ria;</FONT>
<li>Altera&ccedil;&atilde;o do crit&eacute;rio de valida&ccedil;&atilde;o
por data.</ul>
<P>
<FONT SIZE=2>A necessidade ou n&atilde;o de reorganiza&ccedil;&atilde;o
de uma tabela ap&oacute;s a sua libera&ccedil;&atilde;o pode ser
constatada por meio de uma consulta aos par&acirc;metros da mesma
em ambiente espec&iacute;fico (teste ou produ&ccedil;&atilde;o).
Esta informa&ccedil;&atilde;o est&aacute; contida no campo ESTADO,
mantido automaticamente pelo Gerenciador de Tabelas do SADS.</FONT>
<P>
<FONT SIZE=2>Os itens de uma tabela que necessitam de reorganiza&ccedil;&atilde;o
n&atilde;o podem sofrer manuten&ccedil;&otilde;es, por&eacute;m,
n&atilde;o h&aacute; nada que impede&ccedil;a o acesso aos mesmos
via sub-rotina SSTS01. Como os programas aplicativos utilizam
a </FONT><I><FONT SIZE=2 COLOR=#000000>library</FONT></I><FONT SIZE=2>
Cobol da tabela para tratamento dos itens, &eacute; necess&aacute;rio
que exista uma compatibilidade total entre a </FONT><I><FONT SIZE=2 COLOR=#000000>library</FONT></I><FONT SIZE=2>
com que o programa foi compilado e o </FONT><I><FONT SIZE=2 COLOR=#000000>layout</FONT></I><FONT SIZE=2>
dos itens da tabela. Deste modo, os programas compilados com a
</FONT><I><FONT SIZE=2 COLOR=#000000>library</FONT></I><FONT SIZE=2>
antiga da tabela far&atilde;o acesso aos itens na sequ&ecirc;ncia
anterior &agrave; reorganiza&ccedil;&atilde;o e os programas compilados
com a </FONT><I><FONT SIZE=2 COLOR=#000000>library</FONT></I><FONT SIZE=2>
nova, aos itens j&aacute; reorganizados.</dir></dir></dir>
<P>
<A NAME="Libcon"><B><FONT SIZE=5>Libera&ccedil;&atilde;o de consist&ecirc;ncia</FONT></B></A>
<P>
<FONT SIZE=2>A libera&ccedil;&atilde;o &eacute; o processo que
torna a consist&ecirc;ncia da tabela dispon&iacute;vel para utiliza&ccedil;&atilde;o
pelo Gerenciador de Tabelas do SADS num determinado ambiente.</FONT>
<P>
<FONT SIZE=2>Estando a consist&ecirc;ncia da tabela liberada para
teste ou produ&ccedil;&atilde;o, o SADS ir&aacute; execut&aacute;-la
em seu respectivo ambiente, sempre que um usu&aacute;rio final
requisitar manuten&ccedil;&atilde;o (inclus&atilde;o ou altera&ccedil;&atilde;o)
para qualquer um de seus itens.</FONT>
<P>
<FONT SIZE=2>No procedimento de libera&ccedil;&atilde;o para a
produ&ccedil;&atilde;o, tamb&eacute;m ser&atilde;o liberadas as
consist&ecirc;ncias das tabelas que estiverem com o status de
&quot;a liberar para produ&ccedil;&atilde;o&quot;.</FONT>
<P>
<FONT SIZE=2>As fun&ccedil;&otilde;es de libera&ccedil;&atilde;o
de consist&ecirc;ncia est&atilde;o descritas no item &quot;Consist&ecirc;ncia
Geral&quot;, desta se&ccedil;&atilde;o.</FONT>
<P>
<A NAME="Liblib"><B><FONT SIZE=5>Libera&ccedil;&atilde;o de</FONT></B><I><FONT SIZE=5 COLOR=#000000>
</FONT></I><B><FONT SIZE=5 COLOR=#000000>library</FONT></B><I><FONT SIZE=5 COLOR=#000000>
</FONT></I><B><FONT SIZE=5>para produ&ccedil;&atilde;o</FONT></B></A>
<P>
<FONT SIZE=2>A libera&ccedil;&atilde;o da</FONT><I><FONT SIZE=2 COLOR=#000000>
library</FONT></I><FONT SIZE=2> de uma tabela para produ&ccedil;&atilde;o
&eacute; necess&aacute;ria quando ela tiver sido gerada no ambiente
de teste e os programas que a utilizam necessitarem ser compilados
para produ&ccedil;&atilde;o.</FONT>
<P>
<FONT SIZE=2>As </FONT><I><FONT SIZE=2 COLOR=#000000>libraries</FONT></I><FONT SIZE=2>
de tabela geradas diretamente para o ambiente de produ&ccedil;&atilde;o,
mesmo n&atilde;o podendo ser liberadas, podem ser utilizadas para
compila&ccedil;&otilde;es de programas para produ&ccedil;&atilde;o
e para teste. </FONT>
<P>
<FONT SIZE=2>A utiliza&ccedil;&atilde;o de uma </FONT><I><FONT SIZE=2 COLOR=#000000>library</FONT></I><FONT SIZE=2>
de produ&ccedil;&atilde;o nas compila&ccedil;&otilde;es para teste
ser&aacute; permitida conforme a defini&ccedil;&atilde;o do </FONT><I><FONT SIZE=2 COLOR=#000000>usercode</FONT></I><FONT SIZE=2>
de an&aacute;lise na tabela SBPM5002, descrita na se&ccedil;&atilde;o
III, &quot;Parametriza&ccedil;&otilde;es do SADS&quot;, neste
manual.</FONT>
<P>
<FONT SIZE=2>A libera&ccedil;&atilde;o de </FONT><I><FONT SIZE=2 COLOR=#000000>library</FONT></I><FONT SIZE=2>
de tabela para produ&ccedil;&atilde;o n&atilde;o est&aacute; relacionada
a nenhuma tela de processamento. Para efetu&aacute;-la, basta
transmitir os argumentos do menu de opera&ccedil;&atilde;o &quot;LIBLIBTAB&quot;,
cujos campos s&atilde;o apresentados a seguir:</FONT>
<P><dir>
<B><FONT SIZE=2 COLOR=#000000>CAMPOS DA TELA</FONT></B>
<P><dir><img src="Bullet5.gif" width=13 Heigth=13>
<B><FONT SIZE=2 COLOR=#000000>Tabela</FONT></B><FONT SIZE=2> -
C&oacute;digo da tabela cuja </FONT><I><FONT SIZE=2 COLOR=#000000>library</FONT></I><FONT SIZE=2>
ser&aacute; liberada, no padr&atilde;o SADS (sssMnnnn).</FONT>
<P><img src="Bullet5.gif" width=13 Heigth=13>
<B><FONT SIZE=2 COLOR=#000000>Usercode</FONT></B><FONT SIZE=2>
- </FONT><I><FONT SIZE=2 COLOR=#000000>Usercode</FONT></I><FONT SIZE=2>
de an&aacute;lise.</FONT>
<P><img src="Bullet5.gif" width=13 Heigth=13><FONT SIZE=2>O </FONT><I><FONT SIZE=2 COLOR=#000000>usercode</FONT></I><FONT SIZE=2>
a ser informado deve estar habilitado ao usu&aacute;rio, como
elemento, em sua lista de elementos &quot;SEGUSER&quot;, no Sistema
de Seguran&ccedil;a. Detalhes sobre este cadastramento est&atilde;o
descritos na Se&ccedil;&atilde;o VI, &quot;Sistema de Seguran&ccedil;a&quot;,
item &quot;Habilita&ccedil;&otilde;es de usu&aacute;rios SADS&quot;.</FONT>
<P>
<FONT SIZE=2>Caso o </FONT><I><FONT SIZE=2 COLOR=#000000>usercode</FONT></I><FONT SIZE=2>
n&atilde;o seja informado, ser&aacute; assumido o </FONT><I><FONT SIZE=2 COLOR=#000000>usercode</FONT></I><FONT SIZE=2>
</FONT><I><FONT SIZE=2 COLOR=#000000>default</FONT></I><FONT SIZE=2>
do usu&aacute;rio. Detalhes sobre o cadastramento do </FONT><I><FONT SIZE=2 COLOR=#000000>usercode</FONT></I><FONT SIZE=2>
</FONT><I><FONT SIZE=2 COLOR=#000000>default</FONT></I><FONT SIZE=2>
do usu&aacute;rio podem ser obtidos na Se&ccedil;&atilde;o VI,
&quot;Sistema de Seguran&ccedil;a&quot;, item &quot;Usu&aacute;rios
e habilita&ccedil;&otilde;es&quot;.</FONT>
<P>
<FONT SIZE=2>Para </FONT><I><FONT SIZE=2 COLOR=#000000>usercodes</FONT></I><FONT SIZE=2>
de an&aacute;lise, s&atilde;o definidos os elementos (</FONT><I><FONT SIZE=2 COLOR=#000000>usercode</FONT></I><FONT SIZE=2>
e disco) onde ficar&atilde;o residentes suas </FONT><I><FONT SIZE=2 COLOR=#000000>libraries</FONT></I><FONT SIZE=2>
de teste e produ&ccedil;&atilde;o, sendo poss&iacute;vel que as
</FONT><I><FONT SIZE=2 COLOR=#000000>libraries</FONT></I><FONT SIZE=2>
de produ&ccedil;&atilde;o fiquem sem </FONT><I><FONT SIZE=2 COLOR=#000000>usercodes</FONT></I><FONT SIZE=2>.
Estas defini&ccedil;&otilde;es est&atilde;o na tabela SBPM5002,
que se encontra descrita na se&ccedil;&atilde;o V, &quot;Parametriza&ccedil;&otilde;es
do SADS&quot;, neste manual.</dir></dir>
<P>
<A NAME="Itetab"><B><FONT SIZE=5>Manuten&ccedil;&atilde;o de itens
de tabela</FONT></B></A>
<P>
<FONT SIZE=2>As fun&ccedil;&otilde;es para manuten&ccedil;&atilde;o
de itens de tabelas permitem a inclus&atilde;o, altera&ccedil;&atilde;o,
exclus&atilde;o, consulta e emiss&atilde;o de listagens dos itens
cadastrados via chave prim&aacute;ria e secund&aacute;ria.</FONT>
<P>
<FONT SIZE=2>Para que um usu&aacute;rio possa efetuar qualquer
uma dessas fun&ccedil;&otilde;es de manuten&ccedil;&atilde;o de
itens de tabelas, ele dever&aacute; estar habilitado a trabalhar
com a tabela requisitada no Sistema de Seguran&ccedil;a, isto
&eacute;, deve possuir habilita&ccedil;&atilde;o de elemento para
as tabelas com as quais deseja trabalhar. Por&eacute;m, nas transa&ccedil;&otilde;es
de consultas e listagens de itens das tabelas cadastradas para
n&atilde;o utilizar seguran&ccedil;a, esta habilita&ccedil;&atilde;o
n&atilde;o ser&aacute; validada.</FONT>
<P>
<FONT SIZE=2>Detalhes sobre como definir estas habilita&ccedil;&otilde;es
est&atilde;o descritos na Se&ccedil;&atilde;o VI, &quot;Sistema
de Seguran&ccedil;a&quot;, item &quot;Habilita&ccedil;&atilde;o
de usu&aacute;rios SADS&quot;, neste manual.</FONT>
<P>
<FONT SIZE=2>As manuten&ccedil;&otilde;es nos itens de uma tabela
somente poder&atilde;o ser executadas para itens que estiverem
cadastrados nesta tabela e no ambiente onde o usu&aacute;rio efetuou
o </FONT><I><FONT SIZE=2 COLOR=#000000>logon</FONT></I><FONT SIZE=2>.</FONT>
<P>
<FONT SIZE=2>Nas opera&ccedil;&otilde;es de manuten&ccedil;&atilde;o
de itens, a identifica&ccedil;&atilde;o do ambiente corrente,
ambiente no qual o usu&aacute;rio efetuou o</FONT><I><FONT SIZE=2 COLOR=#000000>
logon</FONT></I><FONT SIZE=2>, ser&aacute; feita no canto esquerdo
superior da tela. Neste local, se o </FONT><I><FONT SIZE=2 COLOR=#000000>logon</FONT></I><FONT SIZE=2>
foi efetuado para o ambiente de teste, ser&aacute; apresentada
a palavra &quot;TESTE&quot;, se o </FONT><I><FONT SIZE=2 COLOR=#000000>logon</FONT></I><FONT SIZE=2>
foi efetuado para o ambiente de produ&ccedil;&atilde;o, a identifica&ccedil;&atilde;o
ser&aacute; omitida.</FONT>
<P>
<FONT SIZE=2>Para as tabelas com especifica&ccedil;&atilde;o para
crit&eacute;rio de unidade de armazenamento (empresa, estabelecimento
e unidade), os itens da tabela apresentados ao usu&aacute;rio
ser&atilde;o aqueles definidos especificamente para aquelas unidades
informadas no </FONT><I><FONT SIZE=2 COLOR=#000000>logon</FONT></I><FONT SIZE=2>.
Portanto, um usu&aacute;rio poder&aacute; realizar manuten&ccedil;&otilde;es
somente nos itens que estiverem cadastrados para uma tabela e
dispon&iacute;veis nas unidades de armazenamento onde ele efetuou
o </FONT><I><FONT SIZE=2 COLOR=#000000>logon</FONT></I><FONT SIZE=2>.</FONT>
<P>
<FONT SIZE=2>Quando houver crit&eacute;rio de unidade de armazenamento
especificado para a tabela cujos itens ir&atilde;o sofrer manuten&ccedil;&atilde;o,
ser&atilde;o apresentadas na tela as unidades (empresa, estabelecimento
e unidade) que est&atilde;o em manuten&ccedil;&atilde;o no canto
superior esquerdo, ap&oacute;s o espa&ccedil;o reservado para
apresenta&ccedil;&atilde;o do ambiente da tabela.</FONT>
<P>
<FONT SIZE=2>Se a tabela possuir chaves secund&aacute;rias, elas
ser&atilde;o mantidas automaticamente pelo Gerenciador de Tabelas
sempre que seus itens sofrerem manuten&ccedil;&otilde;es.</FONT>
<P>
<FONT SIZE=2>As opera&ccedil;&otilde;es de consulta aos itens
da tabela s&atilde;o paginadas, ou seja, utilizam o Paginador
de Sa&iacute;da ou Paginador de Consulta do SADS.</FONT>
<P>
<FONT SIZE=2>Nas solicita&ccedil;&otilde;es de consulta ou listagem
dos itens de uma tabela, principalmente para as que possuem edi&ccedil;&atilde;o
de campos na emiss&atilde;o e consulta, &eacute; aconselh&aacute;vel
informar os argumentos inicial e final da pesquisa ou a quantidade
de itens desejada. Isto porque a execu&ccedil;&atilde;o de uma
destas fun&ccedil;&otilde;es, quando solicitadas para um grande
volume de dados, pode prejudicar a </FONT><I><FONT SIZE=2 COLOR=#000000>performance</FONT></I><FONT SIZE=2>
do Gerenciador de Tabelas, principalmente em tabelas com edi&ccedil;&atilde;o.</FONT>
<P>
<FONT SIZE=2>A manuten&ccedil;&atilde;o de itens de tabela engloba
as seguintes fun&ccedil;&otilde;es:</FONT>
<ul type=disc><li>Manipula&ccedil;&atilde;o de itens de tabela;</FONT>
<li>Consulta a itens via chave secund&aacute;ria;</FONT>
<li>Listagem de itens de tabela via chave prim&aacute;ria;</FONT>
<li>Listagem de itens de tabela via chave secund&aacute;ria.</ul>
<P>
<FONT SIZE=2>Cada uma das fun&ccedil;&otilde;es de manuten&ccedil;&atilde;o
de itens encontra-se descrita a seguir:</FONT>
<P>
<A NAME="Manite"><B><FONT SIZE=4>Manipula&ccedil;&atilde;o de
itens de tabela</FONT></B></A>
<P>
<FONT SIZE=2>As opera&ccedil;&otilde;es dispon&iacute;veis para
manipula&ccedil;&atilde;o de itens de tabela, s&atilde;o :</FONT>
<ul type=disc><li>Inclus&atilde;o de itens na tabela,</FONT>
<li>Altera&ccedil;&atilde;o de itens da tabela,</FONT>
<li>Exclus&atilde;o de itens da tabela,</FONT>
<li>Consulta itens da tabela,</FONT>
<li>Exclus&atilde;o unit&aacute;ria de itens da tabela.</ul>
<P>
<FONT SIZE=2>Sempre que uma destas opera&ccedil;&otilde;es for
solicitada, ser&aacute; exibida a tela com o desenho da tabela
dispon&iacute;vel para o ambiente onde foi efetuado o </FONT><I><FONT SIZE=2 COLOR=#000000>logon</FONT></I><FONT SIZE=2>.
Para cada tabela, ser&atilde;o apresentados tantos itens quantos
couberem na tela, exceto na opera&ccedil;&atilde;o &quot;EUN&quot;
(exclus&atilde;o unit&aacute;ria), onde o Gerenciador de Tabelas
apresentar&aacute; somente o item selecionado no menu.</FONT>
<P>
<FONT SIZE=2>O n&uacute;mero de itens que aparecer&aacute; em
uma mesma tela &eacute; determinado no momento da libera&ccedil;&atilde;o
da tabela para o ambiente de teste, em fun&ccedil;&atilde;o da
quantidade de linhas que cada item ocupa e do n&uacute;mero de
linhas do cabe&ccedil;alho.</FONT>
<P>
<FONT SIZE=2>Quando forem solicitadas opera&ccedil;&otilde;es
de inclus&atilde;o, altera&ccedil;&atilde;o ou exclus&atilde;o
de itens, o Gerenciador de Tabelas apresentar&aacute; os itens
em diversas p&aacute;ginas, a medida que forem sendo solicitados.
Para as opera&ccedil;&otilde;es de consulta, ser&atilde;o preparadas
at&eacute; 90 p&aacute;ginas, quantidade m&aacute;xima permitida
pelo Paginador de Consulta do SADS (STP03), ou um n&uacute;mero
suficiente para apresenta&ccedil;&atilde;o dos itens solicitados.</FONT>
<P>
<FONT SIZE=2>A exclus&atilde;o de itens de tabela pode ser unit&aacute;ria
(&quot;EUN&quot;) ou por lista de itens (&quot;EXC&quot;).</FONT>
<P>
<FONT SIZE=2>Para a opera&ccedil;&atilde;o &quot;EUN&quot; (Exclus&atilde;o
Unit&aacute;ria), ser&aacute; apresentada uma tela com o item
selecionado, bastando confirmar a exclus&atilde;o para que a opera&ccedil;&atilde;o
seja efetuada. Caso o item n&atilde;o esteja cadastrado, ser&aacute;
enviada uma mensagem informando sobre esta situa&ccedil;&atilde;o.</FONT>
<P>
<FONT SIZE=2>Para a opera&ccedil;&atilde;o &quot;EXC&quot; (Exclus&atilde;o
de itens da tabela), ser&aacute; apresentada uma tela contendo
todos os itens que couberem nesta tela a partir do argumento informado
no menu ou do pr&oacute;ximo que esteja cadastrado, caso n&atilde;o
exista cadastramento para o argumento informado. Caso nenhum argumento
seja informado, os itens ser&atilde;o apresentados a partir do
primeiro que estiver cadastrado. Antes de confirmar a opera&ccedil;&atilde;o,
os argumentos do itens a serem exclu&iacute;dos devem ser deletados,
ou seja, somente os itens cujas chaves estiverem com espa&ccedil;os
ser&atilde;o exclu&iacute;dos.</FONT>
<P>
<FONT SIZE=2>Nas opera&ccedil;&otilde;es de inclus&atilde;o e
altera&ccedil;&atilde;o de itens de tabela, cada tela &eacute;
consistida de acordo com os testes cadastrados na consist&ecirc;ncia
geral para a tabela. A atualiza&ccedil;&atilde;o solicitada s&oacute;
ser&aacute; efetuada quando n&atilde;o houver erros de consist&ecirc;ncia.</FONT>
<P>
<FONT SIZE=2>Sempre que uma transa&ccedil;&atilde;o de altera&ccedil;&atilde;o
de itens for transmitida, tendo sido informado &quot;S&quot; no
campo CONFIRMA, os itens ser&atilde;o atualizados na tabela. Caso
seja informado &quot;N&quot;, independentemente do que foi informado
no campo CONTINUA (&quot;S&quot; ou &quot;N&quot;), a atualiza&ccedil;&atilde;o
ser&aacute; desconsiderada. </FONT>
<P>
<FONT SIZE=2>O Gerenciador de Tabelas n&atilde;o permite a inclus&atilde;o
de itens com a mesma chave de identifica&ccedil;&atilde;o (chave
prim&aacute;ria). No entanto, ele permite que esta duplicidade
ocorra com as chaves secund&aacute;rias.</FONT>
<P>
<FONT SIZE=2>As opera&ccedil;&otilde;es de manipula&ccedil;&atilde;o
de itens de tabela s&atilde;o disparadas atrav&eacute;s do menu
de opera&ccedil;&atilde;o &quot;MANITETAB&quot;, cujos campos
s&atilde;o apresentados a seguir:</FONT>
<P><dir>
<B><FONT SIZE=2 COLOR=#000000>CAMPOS DA TELA</FONT></B>
<P><dir><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>Operacao </FONT></B><FONT SIZE=2>-
Opera&ccedil;&atilde;o de manipula&ccedil;&atilde;o a ser efetuada
sobre os itens da tabela.</FONT>
<P>
<FONT SIZE=2>Pode assumir os seguintes valores:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>&quot;INC&quot; (Inclus&atilde;o);
<p><img src="Bullet7.gif" width=13 heigth=13>&quot;ALT&quot; (Altera&ccedil;&atilde;o);
<p><img src="Bullet7.gif" width=13 heigth=13>&quot;EXC&quot; (Exclus&atilde;o);
<p><img src="Bullet7.gif" width=13 heigth=13>&quot;CON&quot; (Consulta);
<p><img src="Bullet7.gif" width=13 heigth=13>&quot;EUN&quot; (Exclus&atilde;o unit&aacute;ria);
</dir>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>Tabela -</FONT></B><FONT SIZE=2>
C&oacute;digo da tabela cujos itens ser&atilde;o acessados, no
padr&atilde;o SADS (sssMnnnn);</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>Argumento</FONT></B><FONT SIZE=2>
- Chave do item a partir do qual a tabela ser&aacute; acessada.</FONT>
<P>
<FONT SIZE=2>Nas opera&ccedil;&otilde;es de altera&ccedil;&atilde;o,
exclus&atilde;o (unit&aacute;ria ou de uma lista) e consulta,
pode-se informar como argumento o item a partir do qual se deseja
ter acesso &agrave; tabela. Com exce&ccedil;&atilde;o da exclus&atilde;o
unit&aacute;ria, nas demais opera&ccedil;&otilde;es, se o argumento
informado n&atilde;o estiver cadastrado, os itens ser&atilde;o
apresentados a partir do pr&oacute;ximo cadastrado.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>Argumento limite </FONT></B><FONT SIZE=2>-
Chave do item at&eacute; o qual a tabela ser&aacute; acessada;</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>Qtde de itens </FONT></B><FONT SIZE=2>-
N&uacute;mero de itens que devem ser apresentados na consulta.</FONT>
<P>
<FONT SIZE=2>Esta quantidade n&atilde;o deve ser informada quando
o argumento limite for especificado.</FONT>
<P>
<FONT SIZE=2>Quando uma consulta aos itens de uma tabela for solicitada
e o argumento limite ou a quantidade de itens n&atilde;o forem
informados, ser&atilde;o apresentados no m&aacute;ximo 60 itens.
Para se obter uma consulta completa dos itens da tabela, deve-se
informar &quot;999&quot; no campo &quot;Qtde de itens&quot;.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>Ambiente</FONT></B><FONT SIZE=2>
- Ambiente para tabelas que n&atilde;o utilizem o Sistema de Seguran&ccedil;a.</FONT>
<P>
<FONT SIZE=2>Os valores poss&iacute;veis s&atilde;o os seguintes:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>&quot;T&quot; - Para consultar tabela sem seguran&ccedil;a
em teste;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>&quot;P&quot; - Para consultar tabela sem seguran&ccedil;a
em produ&ccedil;&atilde;o.</dir>
<P>
<FONT SIZE=2>Para tabelas que utilizem o Sistema de Seguran&ccedil;a,
o ambiente utilizado ser&aacute; o informado no procedimento de
</FONT><I><FONT SIZE=2 COLOR=#000000>logon</FONT></I><FONT SIZE=2>.
A indica&ccedil;&atilde;o de uso do Sistema de Seguran&ccedil;a
&eacute; feita no cadastramento da tabela.</FONT></dir></dir></dir>
<P>
<A NAME="Concha"><B><FONT SIZE=4>Consulta a itens via chave secund&aacute;ria</FONT></B></A>
<P>
<FONT SIZE=2>O Gerenciador de Tabelas permite consultar os itens
de uma tabela cadastrada no SADS na ordem estabelecida por qualquer
uma de suas chaves secund&aacute;rias.</FONT>
<P>
<FONT SIZE=2>As manuten&ccedil;&otilde;es nas chaves secund&aacute;rias
das tabelas s&atilde;o feitas de forma autom&aacute;tica. Sempre
que um item for inclu&iacute;do ou exclu&iacute;do ou um campo
que faz parte da estrutura de uma chave secund&aacute;ria for
alterado, as chaves secund&aacute;rias definidas para a tabela
ser&atilde;o automaticamente atualizadas.</FONT>
<P>
<FONT SIZE=2>As consultas aos itens de uma tabela via chave secund&aacute;ria,
a exemplo das consultas via chave prim&aacute;ria, s&atilde;o
feitas atrav&eacute;s do Paginador de Consulta do SADS (STP03).</FONT>
<P>
<FONT SIZE=2>Para efetuar esta fun&ccedil;&atilde;o, os argumentos
do menu de opera&ccedil;&atilde;o &quot;CONSECTAB&quot; devem
ser informados, quais sejam:</FONT>
<P><dir><B><FONT SIZE=2 COLOR=#000000>CAMPOS DA TELA</FONT></B>
<P><dir><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>Tabela</FONT></B><FONT SIZE=2> -
C&oacute;digo da tabela cujos itens ser&atilde;o consultados,
no padr&atilde;o SADS (sssMnnnn);</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>Ambiente </FONT></B><FONT SIZE=2>-
Ambiente para tabelas que n&atilde;o utilizem o Sistema de Seguran&ccedil;a.</FONT>
<P>
<FONT SIZE=2>Os valores poss&iacute;veis s&atilde;o os seguintes:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;T&quot; - Para consultar tabela sem seguran&ccedil;a
em teste;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;P&quot; - Para consultar tabela sem seguran&ccedil;a
em produ&ccedil;&atilde;o.</dir>
<P>
<FONT SIZE=2>Para tabelas que utilizem o Sistema de Seguran&ccedil;a,
o ambiente utilizado ser&aacute; o informado no procedimento de
</FONT><I><FONT SIZE=2 COLOR=#000000>logon</FONT></I><FONT SIZE=2>.
A indica&ccedil;&atilde;o de uso do Sistema de Seguran&ccedil;a
&eacute; feita no cadastramento da tabela.</FONT>
<P>
<FONT SIZE=2>Ser&aacute; apresentada uma tela de processamento
com os seguintes campos:</dir>
<P>
<B><FONT SIZE=2 COLOR=#000000>CAMPOS DA TELA</FONT></B>
<P><dir><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TABELA</FONT></B><FONT SIZE=2> -
C&oacute;digo da tabela informada no menu; </FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>CHAVES</FONT></B><FONT SIZE=2> -
C&oacute;digos das chaves de acesso cadastradas para a tabela;</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>CHAVE</FONT></B><FONT SIZE=2> -
C&oacute;digo da chave de acesso a partir da qual a tabela ser&aacute;
consultada, que pode<BR>
ser: &quot;B&quot;, &quot;C&quot; ou &quot;D&quot;;</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>QTDE DE ITENS</FONT></B><FONT SIZE=2>
- N&uacute;mero de itens que devem ser apresentados na consulta.</FONT>
<P>
<FONT SIZE=2>Esta quantidade n&atilde;o deve ser informada quando
o argumento limite for especificado.</FONT>
<P>
<FONT SIZE=2>Se uma consulta de itens de dados for solicitada
sem que o argumento limite tenha sido informado na quantidade
de itens, ser&atilde;o apresentados no m&aacute;ximo 60 itens.
Para se obter uma consulta completa dos itens da tabela, deve-se
informar &quot;999&quot; no campo QTDE DE ITENS.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>ARGUMENTO</FONT></B><FONT SIZE=2>
- Chave do item a partir do qual a tabela ser&aacute; consultada.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>ARGUMENTO LIMITE</FONT></B><FONT SIZE=2>
- Chave do item at&eacute; o qual a tabela ser&aacute; consultada;</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>CONFIRME (S/N)</FONT></B><FONT SIZE=2>
- Indicador de confirma&ccedil;&atilde;o de opera&ccedil;&atilde;o.</FONT>
<P>
<FONT SIZE=2>Pode assumir os seguintes valores:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;S&quot; - Para que sejam consultados os itens
da tabela via chave secund&aacute;ria conforme os argumentos informados;
</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;N&quot; - Para que seja cancelada a consulta
aos itens da tabela via chave secund&aacute;ria.</dir></dir></dir>
<P>
<A NAME="Tabpri"><B><FONT SIZE=4>Listagem de itens de tabela via
chave prim&aacute;ria</FONT></B></A>
<P>
<FONT SIZE=2>O Gerenciador de Tabelas permite imprimir os itens
de uma tabela cadastrada no SADS em impressora remota ou central
</FONT><I><FONT SIZE=2 COLOR=#000000>(printer</FONT></I><FONT SIZE=2>),
na ordem definida por sua chave prim&aacute;ria.</FONT>
<P>
<FONT SIZE=2>Esta fun&ccedil;&atilde;o n&atilde;o est&aacute;
relacionada a nenhuma tela de processamento. Para efetu&aacute;-la,
basta transmitir os argumentos do menu de opera&ccedil;&atilde;o
&quot;LISITETAB&quot;, cujos campos s&atilde;o apresentados a
seguir:</FONT>
<P><dir>
<B><FONT SIZE=2 COLOR=#000000>CAMPOS DA TELA</FONT></B>
<P><dir><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>Tabela</FONT></B><FONT SIZE=2> -
C&oacute;digo da tabela cujos itens ser&atilde;o impressos, no
padr&atilde;o SADS (sssMnnnn);</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>Impressora </FONT></B><FONT SIZE=2>-
C&oacute;digo da impressora na qual os itens ser&atilde;o impressos.</FONT>
<P>
<FONT SIZE=2>Pode assumir os seguintes valores:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;&lt;&lt;C&oacute;digo da impressora remota&gt;&gt;&quot;
- Para impress&atilde;o do manual na impressora remota informada
(esta impressora deve estar cadastrada na rede de terminais);</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;PRINTER&quot; - Para impress&atilde;o do manual
na impressora central, no formul&aacute;rio de 132 posi&ccedil;&otilde;es;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;PRINxx&quot; - Para impress&atilde;o do manual
na impressora central em formul&aacute;rio especial, onde &quot;xx&quot;
&eacute; um </FONT><I><FONT SIZE=2 COLOR=#000000>formid</FONT></I><FONT SIZE=2>
definido na instala&ccedil;&atilde;o.</dir>
<P>
<FONT SIZE=2>Caso a impressora n&atilde;o seja informada, ser&aacute;
assumida a impressora </FONT><I><FONT SIZE=2 COLOR=#000000>default</FONT></I><FONT SIZE=2>
do usu&aacute;rio.</FONT>
<P>
<FONT SIZE=2>Detalhes sobre o cadastramento da impressora </FONT><I><FONT SIZE=2 COLOR=#000000>default</FONT></I><FONT SIZE=2>
do usu&aacute;rio podem ser obtidos na Se&ccedil;&atilde;o VI,
&quot;Sistema de Seguran&ccedil;a&quot;, item &quot;Usu&aacute;rios
e Habilita&ccedil;&otilde;es&quot;, neste manual. </FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>Argumento</FONT></B><FONT SIZE=2>
- Chave do item a partir do qual a tabela ser&aacute; impressa.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>Argumento limite </FONT></B><FONT SIZE=2>-
Chave do item at&eacute; o qual a tabela ser&aacute; impressa;</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>Qtde de itens</FONT></B><FONT SIZE=2>
- N&uacute;mero de itens que devem ser impressos.</FONT>
<P>
<FONT SIZE=2>Esta quantidade n&atilde;o deve ser informada quando
o argumento limite for especificado.</FONT>
<P>
<FONT SIZE=2>Se uma listagem de itens de dados for solicitada
sem que o argumento limite tenha sido informado na quantidade
de itens, ser&atilde;o apresentados no m&aacute;ximo 60 itens.
Para se obter uma listagem completa dos itens da tabela, deve-se
informar &quot;999&quot; no campo &quot;Qtde de itens&quot;.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>Ambiente</FONT></B><FONT SIZE=2>
- Ambiente para tabelas que n&atilde;o utilizam o Sistema de Seguran&ccedil;a.</FONT>
<P>
<FONT SIZE=2>Os valores poss&iacute;veis s&atilde;o os seguintes:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;T&quot; - Para listar tabela sem seguran&ccedil;a
em teste;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;P&quot; - Para listar tabela sem seguran&ccedil;a
em produ&ccedil;&atilde;o.</dir>
<P>
<FONT SIZE=2>Para tabelas que utilizem o Sistema de Seguran&ccedil;a,
o ambiente utilizado ser&aacute; o informado no procedimento de
</FONT><I><FONT SIZE=2 COLOR=#000000>logon</FONT></I><FONT SIZE=2>.
A indica&ccedil;&atilde;o de uso do Sistema de Seguran&ccedil;a
&eacute; feita no cadastramento da tabela.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>Data e Hora</FONT></B><FONT SIZE=2>
- Indicador de listagem de data e hora da &uacute;ltima atualiza&ccedil;&atilde;o
do item.</FONT>
<P>
<FONT SIZE=2>Os valores poss&iacute;veis s&atilde;o os seguintes:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;S&quot; - Para listar data e hora da atualiza&ccedil;&atilde;o
do item.</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;N&quot; - Para n&atilde;o listar data e hora
da atualiza&ccedil;&atilde;o do item.</dir></dir></dir>
<P>
<A NAME="Tabsec"><B><FONT SIZE=4>Listagem de itens de tabela via
chave secund&aacute;ria</FONT></B></A>
<P>
<FONT SIZE=2>O Gerenciador de Tabelas permite imprimir os itens
de uma tabela cadastrada no SADS em impressora remota ou central,
na ordem definida por qualquer uma de suas chaves secund&aacute;rias.</FONT>
<P>
<FONT SIZE=2>Para efetuar esta fun&ccedil;&atilde;o os argumentos
do menu de opera&ccedil;&atilde;o &quot;LISCHASEC&quot; devem
ser informados, quais sejam:</FONT>
<P><dir><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>CAMPOS DA TELA</FONT></B>
<P><dir><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>Tabela</FONT></B><FONT SIZE=2> -
C&oacute;digo da tabela cujos itens ser&atilde;o listados, no
padr&atilde;o SADS (sssMnnnn);</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>Ambiente</FONT></B><FONT SIZE=2>
- Ambiente para tabelas que n&atilde;o utilizam o Sistema de Seguran&ccedil;a.</FONT>
<P>
<FONT SIZE=2>Os valores poss&iacute;veis s&atilde;o os seguintes:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;T&quot; - Para listar tabela sem seguran&ccedil;a
em teste;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;P&quot; - Para listar tabela sem seguran&ccedil;a
em produ&ccedil;&atilde;o.</dir>
<P>
<FONT SIZE=2>Para tabelas que utilizam o Sistema de Seguran&ccedil;a,
o ambiente utilizado ser&aacute; o informado no procedimento de
</FONT><I><FONT SIZE=2 COLOR=#000000>logon</FONT></I><FONT SIZE=2>.
A indica&ccedil;&atilde;o de uso do Sistema de Seguran&ccedil;a
&eacute; feita no cadastramento da tabela.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>Data e Hora </FONT></B><FONT SIZE=2>-
Indicador de listagem de data e hora da &uacute;ltima atualiza&ccedil;&atilde;o
do item.</FONT>
<P>
<FONT SIZE=2>Os valores poss&iacute;veis s&atilde;o os seguintes:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;S&quot; - Para listar data e hora da atualiza&ccedil;&atilde;o
do item.</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;N&quot; - Para n&atilde;o listar data e hora
da atualiza&ccedil;&atilde;o do item.</dir>
<P>
<FONT SIZE=2>Ser&aacute; apresentada uma tela de processamento
com os seguintes campos:</FONT>
<P>
<B><FONT SIZE=2 COLOR=#000000>CAMPOS DA TELA</FONT></B>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TABELA</FONT></B><FONT SIZE=2> -
C&oacute;digo da tabela informada no menu;</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>CHAVES</FONT></B><FONT SIZE=2> -
C&oacute;digos das chaves de acesso cadastradas para a tabela;</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>CHAVE </FONT></B><FONT SIZE=2>-
C&oacute;digo da chave de acesso a partir da qual a tabela ser&aacute;
listada, que pode ser : &quot;B&quot;,&quot;C&quot;ou &quot;D&quot;;</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>QTDE DE ITENS </FONT></B><FONT SIZE=2>-
N&uacute;mero de itens que devem ser impressos.</FONT>
<P>
<FONT SIZE=2>Esta quantidade n&atilde;o deve ser informada quando
o argumento limite for especificado.</FONT>
<P>
<FONT SIZE=2>Se uma listagem de itens de dados for solicitada
via chave secund&aacute;ria sem que o argumento limite tenha sido
informado na quantidade de itens, ser&atilde;o apresentados no
m&aacute;ximo 60 itens. Para se obter uma listagem completa dos
itens da tabela via chave secund&aacute;ria, deve-se informar
&quot;999&quot; no campo QTDE DE ITENS.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>ARGUMENTO</FONT></B><FONT SIZE=2>
- Chave do item a partir do qual a tabela ser&aacute; listada.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>ARGUMENTO LIMITE</FONT></B><FONT SIZE=2>
- Chave do item at&eacute; o qual a tabela ser&aacute; listada;</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>IMPRESSORA</FONT></B><FONT SIZE=2>
- C&oacute;digo da impressora na qual os itens ser&atilde;o impressos.</FONT>
<P>
<FONT SIZE=2>Pode assumir os seguintes valores:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;&lt;C&oacute;digo da impressora remota&gt;&quot;
- Para impress&atilde;o do manual na impressora remota informada
(esta impressora deve estar cadastrada na rede de terminais);</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;PRINTER&quot; - Para impress&atilde;o do manual
na impressora central, no formul&aacute;rio de 132 posi&ccedil;&otilde;es;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;PRINxx&quot; - Para impress&atilde;o do manual
na impressora central em formul&aacute;rio especial, onde &quot;xx&quot;
&eacute; um </FONT><I><FONT SIZE=2 COLOR=#000000>formid</FONT></I><FONT SIZE=2>
definido na instala&ccedil;&atilde;o.</dir>
<P>
<FONT SIZE=2>Caso a impressora n&atilde;o seja informada, ser&aacute;
assumida a impressora </FONT><I><FONT SIZE=2 COLOR=#000000>default</FONT></I><FONT SIZE=2>
do usu&aacute;rio.</FONT>
<P>
<FONT SIZE=2>Detalhes sobre o cadastramento da impressora </FONT><I><FONT SIZE=2 COLOR=#000000>default</FONT></I><FONT SIZE=2>
do usu&aacute;rio podem ser obtidos na Se&ccedil;&atilde;o VI,
&quot;Sistema de Seguran&ccedil;a&quot;, item &quot;Usu&aacute;rios
e Habilita&ccedil;&otilde;es&quot;, neste manual. </FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>CONFIRME (S/N) </FONT></B><FONT SIZE=2>-
Indicador de confirma&ccedil;&atilde;o de opera&ccedil;&atilde;o.</FONT>
<P>
<FONT SIZE=2>Pode assumir os seguintes valores:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;S&quot; - Para que sejam impressos os itens
da tabela via chave secund&aacute;ria conforme os argumentos informados;
</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;N&quot; - Para que seja cancelada a impress&atilde;o
dos itens da tabela via chave secund&aacute;ria.</dir></dir></dir>
<P>
<A NAME="Funca"><B><FONT SIZE=5>Fun&ccedil;&otilde;es de apoio</FONT></B></A>
<HR>
<P>
<A NAME="Esptab"><B><FONT SIZE=5>Espec&iacute;ficas de tabela</FONT></B></A>
<P>
<FONT SIZE=2>As fun&ccedil;&otilde;es de apoio oferecidas pelo
SADS, especificamente para tratamento de tabelas, s&atilde;o as
seguintes:</FONT>
<P><dir><img src="Bullet1.gif" width=8 heigth=8>C&oacute;pia de itens entre ambientes;</FONT>
<P><img src="Bullet1.gif" width=8 heigth=8>Manuten&ccedil;&otilde;es nos itens por local de
armazenamento;</FONT>
<P><img src="Bullet1.gif" width=8 heigth=8>Reorganiza&ccedil;&atilde;o de itens de tabela;</FONT>
<P><img src="Bullet1.gif" width=8 heigth=8>Exclus&atilde;o de itens de tabela em um ambiente;</FONT>
<P><img src="Bullet1.gif" width=8 heigth=8>Exclus&atilde;o total de tabela;</FONT>
<P><img src="Bullet1.gif" width=8 heigth=8>Duplica&ccedil;&atilde;o de par&acirc;metros de
tabela;</FONT>
<P><img src="Bullet1.gif" width=8 heigth=8>Consulta tabelas por sistema;</FONT>
<P><img src="Bullet1.gif" width=8 heigth=8>Transfer&ecirc;ncia de tabelas entre computadores;</FONT>
<P><img src="Bullet1.gif" width=8 heigth=8>Jun&ccedil;&atilde;o de tabelas.</dir>
<P>
<FONT SIZE=2>A utiliza&ccedil;&atilde;o de fun&ccedil;&otilde;es
de gerenciamento e controle de tabelas devem ser restritas aos
respons&aacute;veis pelos sistemas desenvolvidos no SADS, sendo
desaconselh&aacute;vel o uso das mesmas por usu&aacute;rios finais
de sistemas aplicativos.</FONT>
<P>
<FONT SIZE=2>A identifica&ccedil;&atilde;o das pessoas habilitadas
a trabalhar com estas fun&ccedil;&otilde;es &eacute; feita atrav&eacute;s
da interface com o Sistema de Seguran&ccedil;a do SADS.</FONT>
<P>
<FONT SIZE=2>Detalhes sobre habilita&ccedil;&otilde;es de usu&aacute;rios
para opera&ccedil;&otilde;es com tabelas cadastradas no SADS est&atilde;o
descritos na Se&ccedil;&atilde;o VI, &quot;Sistema de Seguran&ccedil;a&quot;,
item &quot;Habilita&ccedil;&atilde;o de usu&aacute;rios SADS&quot;,
neste manual.</dir>
<P>
<A NAME="Copite"><B><FONT SIZE=4>C&oacute;pia de itens entre ambientes</FONT></B></A>
<P>
<FONT SIZE=2>Esta fun&ccedil;&atilde;o tem como objetivo facilitar
a transfer&ecirc;ncia dos itens de uma mesma tabela entre os ambientes
de teste e produ&ccedil;&atilde;o de um mesmo computador. Portanto,
esta fun&ccedil;&atilde;o n&atilde;o pode ser utilizada para transfer&ecirc;ncia
de itens entre computadores diferentes. Esta opera&ccedil;&atilde;o
&eacute; poss&iacute;vel e encontra-se descrita no t&oacute;pico
&quot;Transfer&ecirc;ncia de tabelas entre computadores&quot;,
nesta se&ccedil;&atilde;o. </FONT>
<P>
<FONT SIZE=2>Para efetuar a c&oacute;pia, a tabela deve estar
dispon&iacute;vel (liberada) para os dois ambientes (teste e produ&ccedil;&atilde;o),
devendo ainda possuir os mesmos crit&eacute;rios de armazenamento
e de valida&ccedil;&atilde;o por data.</FONT>
<P>
<FONT SIZE=2>Antes de efetuar a c&oacute;pia, deve-se verificar
a compatibilidade do desenho e da estrutura da tabela nos ambientes
de teste e produ&ccedil;&atilde;o. A incompatibilidade no tamanho
dos campos dos itens pode ocasionar truncamento ou deslocamento
dos dados armazenados.</FONT>
<P><dir>
<B><FONT SIZE=2 COLOR=#000000>CAMPOS DA TELA</FONT></B>
<P><dir><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TABELA</FONT></B><FONT SIZE=2> -
C&oacute;digo do tabela no padr&atilde;o SADS (sssMnnnn).</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>UNIDADE DE ARMAZENAMENTO </FONT></B><FONT SIZE=2>-
Informa&ccedil;&atilde;o que exibe o crit&eacute;rio de unidade
de armazenamento definido para a tabela cujos itens ser&atilde;o
copiados.</FONT>
<P>
<FONT SIZE=2>Caso a tabela possua algum crit&eacute;rio definido
no ambiente de origem, a c&oacute;pia de itens poder&aacute; ser
feita de maneira seletiva, de acordo com as unidades informadas
no campo EMP/EST/UNIDADE.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>DE AMBIENTE (T/P) </FONT></B><FONT SIZE=2>-
Ambiente origem de onde os itens da tabela ser&atilde;o copiados.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>EMP/EST/UNIDADE</FONT></B><FONT SIZE=2>
- C&oacute;digos da empresa, estabelecimento e unidade dos itens
a serem copiados (opcional).</FONT>
<P>
<FONT SIZE=2>Se alguma unidade de armazenamento for informada,
somente os itens pertencentes a ela ser&atilde;o copiados para
o outro ambiente.</FONT>
<P>
<FONT SIZE=2>Somente as unidades que estiverem compat&iacute;veis
com o crit&eacute;rio de unidade de armazenamento definido para
a tabela poder&atilde;o ser informadas.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>PARA AMBIENTE(T/P) </FONT></B><FONT SIZE=2>-
Ambiente destino para onde os itens da tabela ser&atilde;o copiados.</FONT>
<P>
<FONT SIZE=2>Este ambiente deve, obrigatoriamente, ser diferente
do ambiente de origem dos itens.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>EMP/EST/UNIDADE</FONT></B><FONT SIZE=2>
- C&oacute;digos da empresa, estabelecimento e unidade com os
quais os itens ser&atilde;o copiados (opcional).</FONT>
<P>
<FONT SIZE=2>O c&oacute;digo de unidade de armazenamento especifica
com qual unidade ser&atilde;o copiados os itens extra&iacute;dos
do ambiente de origem da tabela.</FONT>
<P>
<FONT SIZE=2>Se a unidade de armazenamento origem for informada
e a de destino n&atilde;o, o Gerenciador de Tabelas ir&aacute;
consider&aacute;-las iguais.</FONT>
<P>
<FONT SIZE=2>Somente unidades que estiverem compat&iacute;veis
com o crit&eacute;rio de unidade de armazenamento definido para
a tabela poder&atilde;o ser informados.</FONT>
<P>
<FONT SIZE=2>N&atilde;o &eacute; poss&iacute;vel informar unidades
de armazenamento de destino sem informar as unidades de armazenamento
de origem.</FONT>
<P>
<FONT SIZE=2>Para melhor explicar o processo de c&oacute;pia de
itens com especifica&ccedil;&atilde;o de unidades de armazenamento,
a seguir &eacute; apresentado um exemplo no qual o crit&eacute;rio de unidade
de armazenamento estabelecido para a tabela &eacute; &quot;EST&quot;
(Estabelecimento):</FONT>
<Pre><FONT SIZE=3>
  DE   AMBIENTE: <u>T</u>     EMP/EST/UNIDADE:   <u>0</u> <u>0</u> <u>1</u>   <u> </u> <u> </u> <u> </u> <u> </u>   <u> </u> <u> </u> <u> </u>
  PARA AMBIENTE: <u>P</u>     EMP/EST/UNIDADE:   <u> </u> <u> </u> <u> </u>   <u> </u> <u> </u> <u> </u> <u> </U>   <u> </u> <u> </u> <u> </u>
</Pre></font>

<P><FONT SIZE=2>Como n&atilde;o houve especifica&ccedil;&atilde;o
de unidade de armazenamento para a tabela destino, a
c&oacute;pia dos itens ser&aacute; efetuada com a mesma especifica&ccedil;&atilde;o
da tabela de origem (&quot;001&quot;).</FONT>
<P>
<FONT SIZE=2>Considerando que o crit&eacute;rio de armazenamento
definido para a tabela &eacute; &quot;EST&quot;, a c&oacute;pia
poderia ter sido solicitada com especifica&ccedil;&atilde;o de
estabelecimento .</FONT>
<P>
<FONT SIZE=2>Caso fosse informada uma empresa destino diferente
da empresa origem, os itens copiados seriam carregados para outra empresa na tabela destino.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>MERGE</FONT></B><FONT SIZE=2> -
Determina se haver&aacute; ou n&atilde;o perda de itens na tabela
de destino.</FONT>
<P>
<FONT SIZE=2>Pode assumir os seguintes valores:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>&quot;S&quot; - Para que a c&oacute;pia seja feita
sem perda dos itens j&aacute; existentes na tabela destino.</FONT>
<P>
<FONT SIZE=2>Neste caso, poder&atilde;o ocorrer as seguintes situa&ccedil;&otilde;es:</FONT>
<ul type=disc><li>Os itens de mesmo argumento ser&atilde;o atualizados;</FONT>
<li>Os itens da origem que n&atilde;o existem no destino
ser&atilde;o inclu&iacute;dos;</FONT>
<li>Os demais itens permanecer&atilde;o inalterados.</ul>
<P><img src="Bullet7.gif" width=13 heigth=13>&quot;N&quot; - Para que a c&oacute;pia seja feita
com perda dos itens j&aacute; existentes na tabela destino.
<P>
<FONT SIZE=2>Neste caso, a c&oacute;pia dos itens novos ser&aacute;
efetuada a partir da exclus&atilde;o dos itens do destino, permanecendo
nesta tabela apenas os itens transferidos.</dir>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>CONFIRME</FONT></B><FONT SIZE=2>
- Indicador de confirma&ccedil;&atilde;o da c&oacute;pia dos itens.</FONT>
<P>
<FONT SIZE=2>Os valores poss&iacute;veis s&atilde;o os seguintes:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;S&quot; - Para confirmar a c&oacute;pia dos
itens;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;N&quot; - Para retornar ao menu sem efetuar
a c&oacute;pia dos itens.</dir></dir></dir>
<P>
<A NAME="Armaze"><B><FONT SIZE=4>Manuten&ccedil;&otilde;es nos
itens por local de armazenamento</FONT></B></A>
<P>
<FONT SIZE=2>O Gerenciador de Tabelas do SADS oferece fun&ccedil;&otilde;es
para apoiar manuten&ccedil;&otilde;es espec&iacute;ficas de itens
de tabelas com especifica&ccedil;&atilde;o de crit&eacute;rio
de armazenamento (EMP, EST, UND).</FONT>
<P>
<FONT SIZE=2>As manuten&ccedil;&otilde;es por local de armazenamento
que podem ser efetuadas s&atilde;o as seguintes:</FONT>
<P><dir><img src="Bullet1.gif" width=8 heigth=8>Copiar itens de uma unidade de armazenamento para
outra; </FONT>
<P><img src="Bullet1.gif" width=8 heigth=8>Alterar as unidade de armazenamento dos itens de
uma tabela;</FONT>
<P><img src="Bullet1.gif" width=8 heigth=8>Consultar as unidades de armazenamento que possuem
itens cadastrados;</FONT>
<P><img src="Bullet1.gif" width=8 heigth=8>Excluir itens cadastrados em uma unidade de armazenamento;</FONT>
<P><img src="Bullet1.gif" width=8 heigth=8>Proceder altera&ccedil;&otilde;es livres, ou seja,
alterar as unidades de armazenamento dos itens de uma tabela sem
que os mesmos sejam consistidos contra o crit&eacute;rio de armazenamento
especificado para a tabela. Utilizada para tornar &iacute;ntegros
os itens das tabelas que tiveram seu crit&eacute;rio de armazenamento
alterado, esta opera&ccedil;&atilde;o &eacute; muito &uacute;til
nas jun&ccedil;&otilde;es de tabelas, pois, em vers&otilde;es
do SADS anteriores &agrave; 3.0, elas precisavam ser desenvolvidas
individualmente para cada empresa, estabelecimento e unidade,
uma vez que o crit&eacute;rio de armazenamento ainda n&atilde;o
tinha sido implementado.</dir>
<P>
<FONT SIZE=2>Quando o crit&eacute;rio unidade de armazenamento
&eacute; definido para uma tabela, os c&oacute;digos de empresa,
estabelecimento e unidade, informados pelo usu&aacute;rio no momento
do </FONT><I><FONT SIZE=2 COLOR=#000000>logon,</FONT></I><FONT SIZE=2>
s&atilde;o armazenados em todos os itens da tabela, conforme &eacute;
mostrado no quadro a seguir:</FONT>
<P>
<TABLE BORDER=1>
<TR><TD COLSPAN=4 WIDTH=472><CENTER>UNIDADES ARMAZENADAS NOS ITENS</CENTER>
</TD></TR>
<TR><TD WIDTH=118>CRIT&Eacute;RIO</TD><TD WIDTH=118>EMPRESA</TD>
<TD WIDTH=118>ESTABEL.</TD><TD WIDTH=118>UNIDADE</TD></TR>
<TR><TD WIDTH=118>S/ ESPECIF</TD><TD WIDTH=118>000</TD><TD WIDTH=118>0000
</TD><TD WIDTH=118>000</TD></TR>
<TR><TD WIDTH=118>EMPRESA</TD><TD WIDTH=118>do <I><FONT SIZE=2 COLOR=#000000>logon</FONT></I>
</TD><TD WIDTH=118>0000</TD><TD WIDTH=118>000</TD></TR>
<TR><TD WIDTH=118>ESTABEL.</TD><TD WIDTH=118>do <I><FONT SIZE=2 COLOR=#000000>logon</FONT></I>
</TD><TD WIDTH=118>do <I><FONT SIZE=2 COLOR=#000000>logon</FONT></I>
</TD><TD WIDTH=118>000</TD></TR>
<TR><TD WIDTH=118>UNIDADE</TD><TD WIDTH=118>do<I><FONT SIZE=2 COLOR=#000000> logon</FONT></I>
</TD><TD WIDTH=118>do <I><FONT SIZE=2 COLOR=#000000>logon</FONT></I>
</TD><TD WIDTH=118>do <I><FONT SIZE=2 COLOR=#000000>logon</FONT></I>
</TD></TR>
</TABLE>
<P>
Se o crit&eacute;rio de armazenamento de uma tabela que contiver
itens for alterado, ap&oacute;s a sua libera&ccedil;&atilde;o,
as transa&ccedil;&otilde;es <I><FONT SIZE=2 COLOR=#000000>on-line</FONT></I><FONT SIZE=2>
do Gerenciador de Tabelas far&atilde;o acesso apenas aos itens
que estiverem compat&iacute;veis com o novo crit&eacute;rio informado.
Entretanto, para acesso via sub-rotina SSTS01, quaisquer itens
podem ser obtidos, seja pelo crit&eacute;rio novo ou pelo antigo,
pois, para estes acessos, valem apenas as unidades informadas
para a sub-rotina, independentemente do crit&eacute;rio especificado
para a tabela.</FONT>
<P>
<FONT SIZE=2>Os itens antigos poder&atilde;o ser adequados ao
novo crit&eacute;rio se, atrav&eacute;s da utiliza&ccedil;&atilde;o
da fun&ccedil;&atilde;o &quot;LIV&quot; (Altera&ccedil;&atilde;o
livre), as unidades de armazenamento forem alteradas.</FONT>
<P>
<FONT SIZE=2>Para utiliza&ccedil;&atilde;o dessa fun&ccedil;&atilde;o,
&eacute; obrigat&oacute;rio informar o c&oacute;digo completo
da unidade de armazenamento, inclusive os zeros. Por exemplo:
quando n&atilde;o se desejar especificar estabelecimento, deve-se
informar &quot;0000&quot;.</FONT>
<P><dir>
<B><FONT SIZE=2 COLOR=#000000>CAMPOS DA TELA</FONT></B>
<P><dir><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TABELA</FONT></B><FONT SIZE=2> -
C&oacute;digo da tabela no padr&atilde;o SADS (sssMnnnn).</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13><B><FONT SIZE=2 COLOR=#000000>AMBIENTE</FONT></B><FONT SIZE=2>
- Ambiente da tabela informado no menu de opera&ccedil;&atilde;o.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>NOME</FONT></B><FONT SIZE=2> - Descri&ccedil;&atilde;o
resumida da tabela.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>USUARIO</FONT></B><FONT SIZE=2>
- Usu&aacute;rio respons&aacute;vel pela tabela.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>UNID.ARMAZENAMENTO</FONT></B><FONT SIZE=2>
- Unidade de armazenamento definida para a tabela.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>VALIDACAO P/ DATA</FONT></B><FONT SIZE=2>
- Crit&eacute;rio de valida&ccedil;&atilde;o por data especificado
para a tabela.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>DE EMP/EST/UND </FONT></B><FONT SIZE=2>-
C&oacute;digos das unidades de armazenamento origem, cujos itens
ter&atilde;o suas unidades trocadas.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>PARA EMP/EST/UND </FONT></B><FONT SIZE=2>-
C&oacute;digos das unidades de armazenamento destino para as quais
os itens ser&atilde;o trocados.</FONT>
<P>
<FONT SIZE=2>Para alterar o c&oacute;digo de uma empresa, deve-se
informar o c&oacute;digo atual e aquele que o substituir&aacute;.
N&atilde;o &eacute; necess&aacute;rio informar um c&oacute;digo
de estabelecimento e de unidade espec&iacute;ficos (diferente
de zero), a n&atilde;o ser em caso de altera&ccedil;&atilde;o
dos mesmos.</FONT>
<P>
<FONT SIZE=2>Para efetuar a altera&ccedil;&atilde;o livre, todas
as unidades devem sempre ser informadas.</FONT>
<P><FONT SIZE=2>A seguir, &eacute; apresentado um exemplo de altera&ccedil;&atilde;o
livre:<pre><font size=3>
  DE    EMP/EST/UND      <u>0</u> <u>0</u> <u>1</u>  <u>0</u> <u>0</u> <u>0</u> <u>0</u>  <u>0</u> <u>0</u> <u>0</u>
  PARA  EMP/EST/UND      <u>0</u> <u>0</u> <u>2</u>  <u>0</u> <u>0</u> <u>0</u> <u>1</u>  <u>0</u> <u>0</u> <u>0</u>
</pre>
</FONT>
<P>
<FONT SIZE=2>Pelo processo de altera&ccedil;&atilde;o livre, a
fim de especificar qual estabelecimento est&aacute; relacionado
a cada um dos itens, esta tabela teve seu crit&eacute;rio de unidade
de armazenamento alterado de empresa (&quot;EMP&quot;) para estabelecimento
(&quot;EST&quot;).</FONT>
<P>
<FONT SIZE=2>Deve-se observar que as unidades n&atilde;o utilizadas
como crit&eacute;rio de armazenamento devem ser preenchidas com
0 (zero).</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>CONFIRME</FONT></B><FONT SIZE=2>
- Indicador de confirma&ccedil;&atilde;o da opera&ccedil;&atilde;o.</FONT>
<P>
<FONT SIZE=2>Os valores poss&iacute;veis s&atilde;o os seguintes:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>&quot;S&quot; - Para confirmar a c&oacute;pia dos
itens;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>&quot;N&quot; - Para retornar ao menu sem efetuar
a altera&ccedil;&atilde;o.</dir></dir></dir>
<P>
<A NAME="Reorg"><B><FONT SIZE=4>Reorganiza&ccedil;&atilde;o de
itens de tabela</FONT></B></A>
<P>
<FONT SIZE=2>A reorganiza&ccedil;&atilde;o de itens de tabela
tem o objetivo de evitar que altera&ccedil;&otilde;es efetuadas
no seu desenho, estrutura ou em alguma de suas chaves secund&aacute;rias,
ocasionem truncamentos ou perdas de conte&uacute;do dos itens
j&aacute; cadastrados.</FONT>
<P>
<FONT SIZE=2>Reorganizar uma tabela &eacute; converter o conte&uacute;do
dos itens cadastrados na estrutura anterior para a estrutura atual.
Esta fun&ccedil;&atilde;o reorganiza os campos de informa&ccedil;&otilde;es
e chaves secund&aacute;rias. A reorganiza&ccedil;&atilde;o de
campos que comp&otilde;em a chave prim&aacute;ria somente ser&aacute;
efetuada caso tenha sido aumentado o tamanho de uma data, em uma
tabela que possui crit&eacute;rio de valida&ccedil;&atilde;o de
datas. Portanto, caso tenha sido efetuada qualquer outra altera&ccedil;&atilde;o
nos campos que comp&otilde;em a chave prim&aacute;ria diferente
desta anteriormente citada, todos os itens que se encontrarem
para ela cadastrados ser&atilde;o perdidos.</FONT>
<P>
<FONT SIZE=2>A reorganiza&ccedil;&atilde;o &eacute; uma fun&ccedil;&atilde;o
solicitada para determinados tipos de altera&ccedil;&atilde;o,
quais sejam:</FONT>
<P><dir><img src="Bullet1.gif" width=8 heigth=8>Altera&ccedil;&atilde;o da estrutura da tabela ou
de alguma das suas chaves secund&aacute;rias;</FONT>
<P><img src="Bullet1.gif" width=8 heigth=8>Aumento no tamanho de uma data que comp&otilde;e
a chave prim&aacute;ria, em uma tabela que possui crit&eacute;rio
de valida&ccedil;&atilde;o de data e cujo &uacute;ltimo campo
da chave (data) possui 6 </FONT><I><FONT SIZE=2 COLOR=#000000>bytes</FONT></I><FONT SIZE=2>;</FONT>
<P><img src="Bullet1.gif" width=8 heigth=8>Altera&ccedil;&atilde;o do formato ou tamanho de
algum atributo ou campo pertencente &agrave; estrutura da tabela;</FONT>
<P><img src="Bullet1.gif" width=8 heigth=8>Inclus&atilde;o ou exclus&atilde;o de uma chave
secund&aacute;ria da tabela;</FONT>
<P><img src="Bullet1.gif" width=8 heigth=8>Altera&ccedil;&atilde;o do crit&eacute;rio de valida&ccedil;&atilde;o
por data da tabela.</dir>
<P>
<FONT SIZE=2>Cumpre ressaltar que, caso haja altera&ccedil;&atilde;o
no n&uacute;mero de casas decimais de um atributo que comp&otilde;e
a tabela, sem haver altera&ccedil;&atilde;o em seu tamanho, a
reorganiza&ccedil;&atilde;o da tabela n&atilde;o ser&aacute; exigida
e, por isso mesmo, poder&aacute; haver uma atribui&ccedil;&atilde;o
indesejada do valor do atributo.</FONT>
<P>
<FONT SIZE=2>Tomando como exemplo um atributo definido com tamanho
6, com 3 casas decimais (PIC 9(03)V9(03)) e com valor 234,456,
tem-se:</FONT>
<P>
<FONT SIZE=2>Se o n&uacute;mero de casas decimais deste atributo
for aumentado para 4 e o tamanho deste permanecer o mesmo, a reorganiza&ccedil;&atilde;o
da tabela n&atilde;o ser&aacute; exigida e o atributo passar&aacute;
a ser tratado com o valor 23,4456. Pode-se perceber que nesta
altera&ccedil;&atilde;o houve um deslocamento na v&iacute;rgula
para adequar o atributo &agrave; nova quantidade de casas decimais
(divis&atilde;o por dez, neste caso). Portanto, quando se quiser
alterar o n&uacute;mero de casas decimais com que um atributo
&eacute; tratado, sem que o valor do mesmo seja adulterado, deve-se
efetuar igual altera&ccedil;&atilde;o no seu tamanho. </FONT>
<P>
<FONT SIZE=2>No exemplo anterior, o tamanho do atributo deveria
ter sido tamb&eacute;m aumentado, passando para 7, para que, ap&oacute;s
a reorganiza&ccedil;&atilde;o, assumisse o valor 234,4560.</FONT>
<P>
<FONT SIZE=2>Somente &eacute; poss&iacute;vel alterar a chave
prim&aacute;ria de uma tabela quando a mesma possuir o crit&eacute;rio
de valida&ccedil;&atilde;o de datas e quando o &uacute;ltimo campo
da chave, que &eacute; uma data, possuir seis bytes e for desej&aacute;vel
aument&aacute;-lo para 8 </FONT><I><FONT SIZE=2 COLOR=#000000>bytes</FONT></I><FONT SIZE=2>.
Se o crit&eacute;rio de valida&ccedil;&atilde;o de data for o
&quot;3&quot; (De-at&eacute;), o primeiro campo n&atilde;o chave
da tabela, que &eacute; a data limite (At&eacute;), tamb&eacute;m
dever&aacute; ter seu tamanho aumentado para oito posi&ccedil;&otilde;es.</FONT>
<P>
<FONT SIZE=2>A necessidade ou n&atilde;o da reorganiza&ccedil;&atilde;o
de uma tabela, ap&oacute;s sua libera&ccedil;&atilde;o, pode ser
verificada atrav&eacute;s da consulta aos seus par&acirc;metros
no ambiente espec&iacute;fico (teste ou produ&ccedil;&atilde;o).
Esta informa&ccedil;&atilde;o est&aacute; contida no campo ESTADO,
mantido automaticamente pelo sistema.</FONT>
<P>
<FONT SIZE=2>As tabelas que necessitam de reorganiza&ccedil;&atilde;o
ficam bloqueadas para manuten&ccedil;&otilde;es </FONT><I><FONT SIZE=2 COLOR=#000000>on-line</FONT></I><FONT SIZE=2>,
via Gerenciador de Tabelas do SADS, at&eacute; sua efetiva&ccedil;&atilde;o.
Por&eacute;m, o acesso a estes itens poder&aacute; ser feito via
sub-rotina SSTS01. Como os programas aplicativos utilizam a </FONT><I><FONT SIZE=2 COLOR=#000000>library</FONT></I><FONT SIZE=2>
Cobol da tabela para tratamento dos itens, &eacute; necess&aacute;rio
que haja uma compatibilidade total entre a </FONT><I><FONT SIZE=2 COLOR=#000000>library</FONT></I><FONT SIZE=2>
com a qual o programa foi compilado e o </FONT><I><FONT SIZE=2 COLOR=#000000>layout</FONT></I><FONT SIZE=2>
dos itens da tabela. Assim, os programas compilados com a </FONT><I><FONT SIZE=2 COLOR=#000000>library</FONT></I><FONT SIZE=2>
antiga da tabela far&atilde;o acesso aos itens antes da reorganiza&ccedil;&atilde;o
e os programas compilados com a </FONT><I><FONT SIZE=2 COLOR=#000000>library</FONT></I><FONT SIZE=2>
nova, ap&oacute;s a reorganiza&ccedil;&atilde;o.</FONT>
<P>
<FONT SIZE=2>Conforme a quantidade de itens cadastrados para a
tabela, &eacute; aconselh&aacute;vel disparar a reorganiza&ccedil;&atilde;o
da mesma em hor&aacute;rios de pouca utiliza&ccedil;&atilde;o
do sistema, pois enquanto a reorganiza&ccedil;&atilde;o estiver
sendo executada nenhuma outra transa&ccedil;&atilde;o do Gerenciador
de Tabelas poder&aacute; ser utilizada.</FONT>
<P><dir>
<B><FONT SIZE=2 COLOR=#000000>CAMPOS DA TELA</FONT></B>
<P><dir><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TABELA </FONT></B><FONT SIZE=2>-
C&oacute;digo da tabela no padr&atilde;o SADS (sssMnnnn).</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>AMBIENTE</FONT></B><FONT SIZE=2>
- Ambiente da tabela que ser&aacute; reorganizada.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>CONFIRME</FONT></B><FONT SIZE=2>
- Indicador de confirma&ccedil;&atilde;o da reorganiza&ccedil;&atilde;o.</FONT>
<P>
<FONT SIZE=2>Os valores poss&iacute;veis s&atilde;o os seguintes:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>&quot;S&quot; - Para confirmar a opera&ccedil;&atilde;o
de reorganiza&ccedil;&atilde;o da tabela;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>&quot;N&quot; - Para retornar ao menu sem efetuar
a reorganiza&ccedil;&atilde;o da tabela.</dir>
<P>
<FONT SIZE=2>A reorganiza&ccedil;&atilde;o de itens da tabela
pode, opcionalmente, ser feita via rotina </FONT><I><FONT SIZE=2 COLOR=#000000>batch</FONT></I><FONT SIZE=2>,
utilizando o menu REOITEBAT, onde deve ser informado o c&oacute;digo
da tabela no padr&atilde;o SADS e o ambiente da mesma. Detalhes
a este respeito est&atilde;o descritos no item &quot;Utilit&aacute;rios
</FONT><I><FONT SIZE=2 COLOR=#000000>Batch</FONT></I><FONT SIZE=2>&quot;,
na Se&ccedil;&atilde;o III, &quot;Fun&ccedil;&otilde;es de apoio&quot;,
neste manual.</FONT></dir></dir>
<P>
<A NAME="Exctab"><B><FONT SIZE=4>Exclus&atilde;o de itens de tabela
em um ambiente</FONT></B></A>
<P>
<FONT SIZE=2>Esta fun&ccedil;&atilde;o permite excluir todos os
itens de uma tabela no ambiente especificado.</FONT>
<P><dir>
<B><FONT SIZE=2 COLOR=#000000>CAMPOS DA TELA</FONT></B>
<P><dir><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TABELA</FONT></B><FONT SIZE=2> -
C&oacute;digo da tabela no padr&atilde;o SADS (sssMnnnn).</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>AMBIENTE</FONT></B><FONT SIZE=2>
- Ambiente da tabela que ter&aacute; seus itens exclu&iacute;dos.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>NOME</FONT></B><FONT SIZE=2> - Nome
ou descri&ccedil;&atilde;o resumida da tabela.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>USUARIO</FONT></B><FONT SIZE=2>
- Usu&aacute;rio respons&aacute;vel pela tabela.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>UNID.ARMAZENAMENTO</FONT></B><FONT SIZE=2>
- Crit&eacute;rio de unidade de armazenamento definido para a
tabela.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>VALIDACAO P/ DATA</FONT></B><FONT SIZE=2>
- Crit&eacute;rio de valida&ccedil;&atilde;o por data definido
para a tabela.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>CONFIRME</FONT></B><FONT SIZE=2>
(S/N) - Indicador de confirma&ccedil;&atilde;o da exclus&atilde;o.</FONT>
<P>
<FONT SIZE=2>Os valores poss&iacute;veis s&atilde;o os seguintes:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;S&quot; - Para confirmar a opera&ccedil;&atilde;o
de exclus&atilde;o de itens;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;N&quot; - Para n&atilde;o confirmar a opera&ccedil;&atilde;o
e retornar ao menu.</dir></dir></dir>
<P>
<A NAME="Exctot"><B><FONT SIZE=4>Exclus&atilde;o total de tabela</FONT></B></A>
<P>
<FONT SIZE=2>Esta opera&ccedil;&atilde;o possibilita a exclus&atilde;o
de uma tabela (par&acirc;metros e desenhos) e de seus elementos
(itens de dados, chaves secund&aacute;rias) nos ambientes em que
ela estiver cadastrada (teste e produ&ccedil;&atilde;o).</FONT>
<P>
<FONT SIZE=2>Entretanto, esta fun&ccedil;&atilde;o n&atilde;o
exclui os elementos do reposit&oacute;rio de dados (especifica&ccedil;&atilde;o,
estrutura da tabela, chaves secund&aacute;rias e consist&ecirc;ncia
gen&eacute;rica).</FONT>
<P><dir>
<B><FONT SIZE=2 COLOR=#000000>CAMPOS DA TELA</FONT></B>
<P><dir><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TABELA</FONT></B><FONT SIZE=2> -
C&oacute;digo da tabela no padr&atilde;o SADS (sssMnnnn).</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>AMBIENTES EXISTENTES</FONT></B><FONT SIZE=2>
- Descri&ccedil;&atilde;o dos ambientes existentes para a tabela
informada.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>CONFIRME (S/N)</FONT></B><FONT SIZE=2>
- Indicador de confirma&ccedil;&atilde;o da exclus&atilde;o total.</FONT>
<P>
<FONT SIZE=2>Os valores poss&iacute;veis s&atilde;o os seguintes:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;S&quot; - Para confirmar a opera&ccedil;&atilde;o
de exclus&atilde;o total de tabela;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;N&quot; - Para n&atilde;o confirmar a opera&ccedil;&atilde;o
e retornar ao menu.</dir></dir></dir>
<P>
<A NAME="Duplic"><B><FONT SIZE=4>Duplica&ccedil;&atilde;o de par&acirc;metros
de tabela</FONT></B></A>
<P>
<FONT SIZE=2>O Gerenciador de Tabelas permite criar os par&acirc;metros
e o desenho de uma tabela a partir dos par&acirc;metros e desenho
de outra j&aacute; cadastrada no SADS.</FONT>
<P>
<FONT SIZE=2>Esta opera&ccedil;&atilde;o n&atilde;o duplica os
elementos da tabela (especifica&ccedil;&atilde;o, estrutura, chaves
secund&aacute;rias e consist&ecirc;ncia geral) no reposit&oacute;rio
de dados do SADS. Portanto, ap&oacute;s a duplica&ccedil;&atilde;o,
para que a tabela possa ser utilizada, todos estes elementos dever&atilde;o
ser cadastrados para a mesma.</FONT>
<P>
<FONT SIZE=2>Este cadastramento tamb&eacute;m pode ser efetuado
atrav&eacute;s da duplica&ccedil;&atilde;o de uma tabela j&aacute;
cadastrada, por&eacute;m utilizando-se de uma outra fun&ccedil;&atilde;o
de apoio do SADS contida no menu de opera&ccedil;&atilde;o &quot;DUPELE&quot;
e descrita na Se&ccedil;&atilde;o III, &quot;Fun&ccedil;&otilde;es
de apoio&quot;, neste manual.</FONT>
<P>
<FONT SIZE=2>A fun&ccedil;&atilde;o de duplica&ccedil;&atilde;o
de par&acirc;metros de tabela permite tamb&eacute;m duplicar os
itens da tabela informada.</FONT>
<P>
<FONT SIZE=2>Quando uma tabela for duplicada sem duplicar seus
itens, a nova tabela ser&aacute; criada no ambiente de desenvolvimento.
Caso contr&aacute;rio, ser&aacute; criada no ambiente de teste,
independentemente do ambiente original escolhido.</FONT>
<P>
<FONT SIZE=2>Quando a duplica&ccedil;&atilde;o de itens for efetuada,
&eacute; aconselhavel duplicar tamb&eacute;m a defini&ccedil;&atilde;o
e a consist&ecirc;ncia gen&eacute;rica da tabela, atrav&eacute;s
do menu de opera&ccedil;&atilde;o &quot;DUPELE&quot;. Isto porque,
qualquer diferen&ccedil;a entre a estrutura da nova tabela e a
da tabela original implicaria na reorganiza&ccedil;&atilde;o da
tabela rec&eacute;m-criada e, consequentemente, no risco de truncamento
ou perda do conte&uacute;do de seus itens.</FONT>
<P>
<FONT SIZE=2>As tabelas convertidas de vers&atilde;o anterior
&agrave; 3.0 do SADS, antes de serem duplicadas, necessitam de
libera&ccedil;&atilde;o para o seu ambiente efetivo (teste ou
produ&ccedil;&atilde;o). Detalhes a este respeito est&atilde;o
descritos no t&oacute;pico</FONT><B><FONT SIZE=2 COLOR=#000000>
</FONT></B><FONT SIZE=2>&quot;Funcionamento das tabelas anteriores
&agrave; vers&atilde;o 3.0&quot;, nesta se&ccedil;&atilde;o.</FONT>
<P><dir>
<B><FONT SIZE=2 COLOR=#000000>CAMPOS DA TELA</FONT></B>
<P><dir><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TABELA A DUPLICAR</FONT></B><FONT SIZE=2>
- C&oacute;digo da tabela a ser duplicada no padr&atilde;o SADS
(sssMnnnn).</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>AMBIENTE</FONT></B><FONT SIZE=2>
- Ambiente no qual a tabela ser&aacute; duplicada.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>NOVO CODIGO</FONT></B><FONT SIZE=2>
- C&oacute;digo da tabela a ser criada (sssMnnnn).</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>USUARIO</FONT></B><FONT SIZE=2>
- Usu&aacute;rio da nova tabela.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>DUPLICACAO DOS ITENS DE DADOS (S/N)</FONT></B><FONT SIZE=2>
- Tipo de duplica&ccedil;&atilde;o para a tabela.</FONT>
<P>
<FONT SIZE=2>Os valores poss&iacute;veis s&atilde;o os seguintes:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;S&quot; - Para duplicar par&acirc;metros, desenho
e itens da tabela.</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;N&quot; - Para duplicar apenas par&acirc;metros
e desenho.</dir>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>DE EMP/EST/UND</FONT></B><FONT SIZE=2>
- Unidade de armazenamento dos itens a serem duplicados (opcional).</FONT>
<P>
<FONT SIZE=2>Quando este campo &eacute; informado, haver&aacute;
uma restri&ccedil;&atilde;o para duplica&ccedil;&atilde;o dos
itens de uma unidade de armazenamento espec&iacute;fica. Estes
campos dever&atilde;o ser informados de acordo com o crit&eacute;rio
de armazenamento definido para a tabela.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>CONFIRME (S/N) </FONT></B><FONT SIZE=2>-
Indicador de confirma&ccedil;&atilde;o da opera&ccedil;&atilde;o.
</FONT>
<P>
<FONT SIZE=2>Os valores poss&iacute;veis s&atilde;o os seguintes:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;S&quot; - Para confirmar a opera&ccedil;&atilde;o
de duplica&ccedil;&atilde;o;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;N&quot; - Para n&atilde;o confirmar a opera&ccedil;&atilde;o
e retornar ao menu.</dir></dir></dir>
<P>
<A NAME="Contab"><B><FONT SIZE=4>Consulta tabelas por sistema</FONT></B></A>
<P>
<FONT SIZE=2>Esta fun&ccedil;&atilde;o permite consultar as tabelas
cadastradas no reposit&oacute;rio de dados do SADS pertencentes
a um dado sistema.</FONT>
<P>
<FONT SIZE=2>A consulta pode ser feita para todas as tabelas ou
para um grupo de tabelas, conforme o argumento informado.</FONT>
<P>
<FONT SIZE=2>Por exemplo, se for informado &quot;FGHM&quot; como
argumento da consulta, ser&atilde;o exibidas todas as tabelas
do sistema &quot;FGH&quot;. Por outro lado, se for informado &quot;FGHM50&quot;
como argumento da consulta, ser&atilde;o exibidas apenas as tabelas
do sistema &quot;FGH&quot; que possuam c&oacute;digo diferenciador
iniciado com &quot;50&quot;. Exemplo: &quot;FGHM5003&quot;, &quot;FGHM5011&quot;,
&quot;FGHM5099&quot;, etc.</FONT>
<P>
<FONT SIZE=2>A consulta de tabelas por sistema, a exemplo das
outras consultas do Gerenciador de Tabelas, &eacute; feita atrav&eacute;s
do Paginador de Consulta do SADS (STP03).</FONT>
<P><dir>
<B><FONT SIZE=2 COLOR=#000000>CAMPOS DA TELA</FONT></B>
<P><dir><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TABELA</FONT></B><FONT SIZE=2> -
C&oacute;digo da tabela no padr&atilde;o SADS (sssMnnnn).</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>AMB</FONT></B><FONT SIZE=2> - Ambiente
onde a tabela est&aacute; armazenada.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>STATUS</FONT></B><FONT SIZE=2> -
Status da tabela. </FONT>
<P>
<FONT SIZE=2>Neste campo &eacute; indicada a necessidade de reorganiza&ccedil;&atilde;o
ou libera&ccedil;&atilde;o da tabela.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>NOME/USUARIO</FONT></B><FONT SIZE=2>
- Nome da tabela e do usu&aacute;rio respons&aacute;vel pela manuten&ccedil;&atilde;o
da mesma.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>UN.ARMAZ</FONT></B><FONT SIZE=2>
- Crit&eacute;rio de armazenamento da tabela no ambiente.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>VAL.DATA</FONT></B><FONT SIZE=2>
- Crit&eacute;rio de valida&ccedil;&atilde;o por data da tabela
no ambiente.</dir></dir>
<P>
<A NAME="Transf"><B><FONT SIZE=4>Transfer&ecirc;ncia de tabelas
entre computadores </FONT></B></A>
<P>
<FONT SIZE=2>O Gerenciador de Tabelas permite que uma tabela seja
transferida entre ambientes de um mesmo computador ou entre computadores
distintos. Por&eacute;m, antes de efetuar a transfer&ecirc;ncia
propriamente dita, deve-se registrar, no reposit&oacute;rio de
dados do SADS, uma solicita&ccedil;&atilde;o para a execu&ccedil;&atilde;o
da mesma.</FONT>
<P>
<FONT SIZE=2>A transfer&ecirc;ncia somente ser&aacute; concretizada
atrav&eacute;s da execu&ccedil;&atilde;o de rotinas </FONT><I><FONT SIZE=2 COLOR=#000000>batch</FONT></I><FONT SIZE=2>,
pelos </FONT><I><FONT SIZE=2 COLOR=#000000>jobs</FONT></I><FONT SIZE=2>
SSTJ01 e SSTJ02, de extra&ccedil;&atilde;o e carga de tabelas,
respectivamente.</FONT>
<P>
<A NAME="Soltra"><b>Solicita&ccedil;&atilde;o de transfer&ecirc;ncia</b></A>
<P>
<FONT SIZE=2>A solicita&ccedil;&atilde;o de transfer&ecirc;ncia
pode ser feita apenas para tabela (par&acirc;metros e desenho)
ou para tabela e seus itens cadastrados.</FONT>
<P>
<FONT SIZE=2>As solicitac&otilde;es de transfer&ecirc;ncias podem
ser feitas somente para tabelas do ambiente de teste ou produ&ccedil;&atilde;o
e que possuam o </FONT><I><FONT SIZE=2 COLOR=#000000>status</FONT></I><FONT SIZE=2>
&quot;NORMAL&quot;, isto &eacute;, que n&atilde;o necessitem de
libera&ccedil;&atilde;o ou de reorganiza&ccedil;&atilde;o.</FONT>
<P>
<FONT SIZE=2>Quando a rotina de transfer&ecirc;ncia de tabelas
via solicita&ccedil;&atilde;o for executada, as consist&ecirc;ncias
associadas &agrave;s tabelas tamb&eacute;m ser&atilde;o transferidas.</FONT>
<P>
<FONT SIZE=2>Tabelas da vers&atilde;o anterior &agrave; 3.0 s&atilde;o
convertidas automaticamente para os ambientes de teste e produ&ccedil;&atilde;o,
por&eacute;m elas n&atilde;o podem ser submetidas &agrave; opera&ccedil;&atilde;o
de transfer&ecirc;ncia enquanto n&atilde;o sofrerem pelo menos
uma libera&ccedil;&atilde;o para os ambientes citados.</FONT>
<P><dir>
<B><FONT SIZE=2 COLOR=#000000>CAMPOS DA TELA</FONT></B>
<P><dir><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TABELA</FONT></B><FONT SIZE=2> -
C&oacute;digo da tabela no padr&atilde;o SADS (sssMnnnn).</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>UNIDADE ARMAZENAMENTO (T)</FONT></B><FONT SIZE=2>
- Crit&eacute;rio de armazenamento da tabela que est&aacute; no
ambiente de teste.</FONT>
<P>
<FONT SIZE=2>Este campo &eacute; apresentado para indicar qual
crit&eacute;rio de unidade de armazenamento (empresa, estabelecimento
ou unidade) a tabela possui no ambiente de teste.</FONT>
<P>
<FONT SIZE=2>Quando a solicita&ccedil;&atilde;o estiver sendo
feita para fam&iacute;lia de tabelas, este campo n&atilde;o &eacute;
apresentado.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>UNIDADE ARMAZENAMENTO (P) </FONT></B><FONT SIZE=2>-
Crit&eacute;rio de armazenamento da tabela que est&aacute; no
ambiente de produ&ccedil;&atilde;o.</FONT>
<P>
<FONT SIZE=2>Este campo &eacute; apresentado para indicar qual
crit&eacute;rio de unidade de armazenamento (empresa, estabelecimento
ou unidade) a tabela possui no ambiente de produ&ccedil;&atilde;o.</FONT>
<P>
<FONT SIZE=2>Este campo n&atilde;o &eacute; apresentado quando
a solicita&ccedil;&atilde;o estiver sendo feita para uma fam&iacute;lia
de tabelas ou quando a tabela n&atilde;o estiver liberada para
o ambiente de produ&ccedil;&atilde;o.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>AMBIENTE ORIGEM(T/P) </FONT></B><FONT SIZE=2>-
Ambiente da tabela de onde ser&aacute; feita a transfer&ecirc;ncia
(teste ou produ&ccedil;&atilde;o).</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>AMBIENTE DESTINO(T/P) </FONT></B><FONT SIZE=2>-
Ambiente da tabela para o qual ser&aacute; efetuada a transfer&ecirc;ncia
(teste ou produ&ccedil;&atilde;o).</FONT>
<P>
<FONT SIZE=2>Esse campo assumir&aacute; o ambiente informado em
AMBIENTE ORIGEM, caso o mesmo n&atilde;o tenha sido informado
no menu de opera&ccedil;&atilde;o. Neste caso, a transfer&ecirc;ncia
da tabela ser&aacute; efetuada para um mesmo ambiente de um outro
computador. Por exemplo: Ao transferir uma tabela em produ&ccedil;&atilde;o
do computador de produ&ccedil;&atilde;o, a tabela ir&aacute; se
alojar no ambiente de produ&ccedil;&atilde;o do computador de
desenvolvimento.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>NATUREZA DE TRANSFERENCIA</FONT></B><FONT SIZE=2>
- Indica&ccedil;&atilde;o para substitui&ccedil;&atilde;o ou atualiza&ccedil;&atilde;o
da tabela no destino.</FONT>
<P>
<FONT SIZE=2>Os valores poss&iacute;veis s&atilde;o os seguintes:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;S&quot; - Para substitui&ccedil;&atilde;o da
tabela no destino;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;A&quot; - Para efetuar apenas a atualiza&ccedil;&atilde;o
dos itens da tabela.</dir>
<P>
<FONT SIZE=2>Se o &quot;S&quot; for informado, a tabela existente
no ambiente de destino ser&aacute; substitu&iacute;da pela tabela
do ambiente de origem. Neste caso, a carga &eacute; precedida
da exclus&atilde;o da tabela destino, juntamente com os par&acirc;metros
e desenho (e itens) para ela existentes. Caso a tabela n&atilde;o
exista no destino, ser&aacute; feita apenas a carga.</FONT>
<P>
<FONT SIZE=2>A substitui&ccedil;&atilde;o pode ser feita de duas
formas, de acordo com a op&ccedil;&atilde;o de transfer&ecirc;ncia
de itens :</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>Parcial - Substitui apenas os par&acirc;metros e
desenho da tabela;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>Total - Substitui os par&acirc;metros, desenho e
itens de dados da tabela.</dir>
<P>
<FONT SIZE=2>Sempre que uma transfer&ecirc;ncia de tabelas for
solicitada com a op&ccedil;&atilde;o de substitui&ccedil;&atilde;o,
os itens que est&atilde;o cadastrados na tabela destino ser&atilde;o
perdidos.</FONT>
<P>
<FONT SIZE=2>Se o &quot;A&quot; for informado, a tabela existente
no ambiente de destino ser&aacute; atualizada a partir da tabela
do ambiente de origem.</FONT>
<P>
<FONT SIZE=2>Esta atualiza&ccedil;&atilde;o tamb&eacute;m pode
ser feita de duas formas, de acordo com a op&ccedil;&atilde;o
de transfer&ecirc;ncia de itens :</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>Parcial - Atualiza apenas os par&acirc;metros e desenho
da tabela;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>Total - Atualiza os par&acirc;metros, desenho e itens
de dados da tabela.</dir>
<P>
<FONT SIZE=2>Sempre que uma transfer&ecirc;ncia de tabelas for
solicitada com a op&ccedil;&atilde;o de atualiza&ccedil;&atilde;o,
os itens que est&atilde;o cadastrados na tabela destino n&atilde;o
ser&atilde;o perdidos.</FONT>
<P>
<FONT SIZE=2>Se a tabela destino j&aacute; possuir itens cadastrados,
a transfer&ecirc;ncia (atualiza&ccedil;&atilde;o) somente ser&aacute;
efetuada se as duas tabelas, de origem e de destino, possu&iacute;rem
a mesma estrutura e os mesmos crit&eacute;rios de valida&ccedil;&atilde;o
de data e de unidade de armazenamento.
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TRANSFERENCIA DE ITENS(S/N)</FONT></B><FONT SIZE=2>
- Indicador de transfer&ecirc;ncia de itens da tabela.</FONT>
<P>
<FONT SIZE=2>Os valores poss&iacute;veis s&atilde;o os seguintes:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;S&quot; - Para transferir os itens de dados;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;N&quot; - Para n&atilde;o transferir itens
de dados.</dir>
<P>
<FONT SIZE=2>Se a atualiza&ccedil;&atilde;o de tabelas for solicitada
com a tranfer&ecirc;ncia de seus itens e a tabela destino j&aacute;
possuir itens cadastrados, a opera&ccedil;&atilde;o somente ser&aacute;
efetuada se ambas as tabelas possu&iacute;rem a mesma estrutura,
os mesmos par&acirc;metros, desenho, crit&eacute;rios de valida&ccedil;&atilde;o
de data e de unidade de armazenamento.</FONT>
<P>
<FONT SIZE=2>A atualiza&ccedil;&atilde;o dos itens da tabela &eacute;
feita da seguinte forma:</FONT>
<ul type=disc><li>Os itens atualizados s&atilde;o aqueles cuja chave
&eacute; a mesma tanto na origem quanto no destino.</FONT>
<li>Os itens que existem na origem e n&atilde;o existem
no destino s&atilde;o inclu&iacute;dos no destino.</FONT>
<li>Os itens que existem no destino e n&atilde;o existem
na origem n&atilde;o s&atilde;o alterados nem exclu&iacute;dos.</ul>
<P>
<FONT SIZE=2>Ap&oacute;s a transfer&ecirc;ncia, a tabela atualizada
no destino poder&aacute; necessitar de reorganiza&ccedil;&atilde;o,
caso seus itens n&atilde;o tenham sido transferidos (somente par&acirc;metros
e desenho) e a tabela destino j&aacute; possuir itens cadastrados.</FONT>
<P>
<FONT SIZE=2>A necessidade de reorganiza&ccedil;&atilde;o pode
ser verificada atrav&eacute;s do relat&oacute;rio SSTR03 (Relat&oacute;rio
das Tabelas Carregadas), emitido pelo </FONT><I><FONT SIZE=2 COLOR=#000000>job</FONT></I><FONT SIZE=2>
SSTJ02 no momento da carga da tabela, no ambiente e computador
destino.</FONT>
<P>
<FONT SIZE=2>As tabelas que necessitam de reorganiza&ccedil;&atilde;o
ficam bloqueadas para manuten&ccedil;&otilde;es </FONT><I><FONT SIZE=2 COLOR=#000000>on-line</FONT></I><FONT SIZE=2>,
via Gerenciador de Tabelas do SADS, at&eacute; sua efetiva&ccedil;&atilde;o.
Por&eacute;m, o acesso a esses itens poder&aacute; ser feito via
sub-rotina SSTS01. Como os programas aplicativos utilizam a </FONT><I><FONT SIZE=2 COLOR=#000000>library</FONT></I><FONT SIZE=2>
Cobol da tabela para tratamento dos itens, &eacute; necess&aacute;rio
que haja uma compatibilidade total entre a </FONT><I><FONT SIZE=2 COLOR=#000000>library</FONT></I><FONT SIZE=2>
com a qual o programa foi compilado e o </FONT><I><FONT SIZE=2 COLOR=#000000>layout</FONT></I><FONT SIZE=2>
dos itens da tabela. Assim, programas compilados com a </FONT><I><FONT SIZE=2 COLOR=#000000>library</FONT></I><FONT SIZE=2>
antiga da tabela far&atilde;o acesso aos itens antes da reorganiza&ccedil;&atilde;o
e os programas compilados com a </FONT><I><FONT SIZE=2 COLOR=#000000>library</FONT></I><FONT SIZE=2>
nova, ap&oacute;s a reorganiza&ccedil;&atilde;o.</FONT>
<P>
<FONT SIZE=2>Quando uma tabela for reorganizada devido a altera&ccedil;&otilde;es
efetuadas no desenho ou estrutura da mesma, os programas que fazem
acesso a ela dever&atilde;o ser compilados com sua nova </FONT><I><FONT SIZE=2 COLOR=#000000>library</FONT></I><FONT SIZE=2>.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>EMP/EST/UND A TRANSFERIR</FONT></B><FONT SIZE=2>
- Unidade de armazenamento de onde os itens ser&atilde;o transferidos
(opcional).</FONT>
<P>
<FONT SIZE=2>Se este campo for informado, haver&aacute; uma sele&ccedil;&atilde;o
dos itens a serem transferidos, isto &eacute;, haver&aacute; uma
restri&ccedil;&atilde;o para a transfer&ecirc;ncia dos itens de
uma unidade de armazenamento espec&iacute;fica. </FONT>
<P>
<FONT SIZE=2>Este campo somente poder&aacute; ser preenchido caso
a tabela tenha o crit&eacute;rio de unidade de armazenamento especificado
e caso tenha sido selecionado &quot;S&quot; no campo TRANSFERENCIA
DE ITENS.</FONT>
<P>
<FONT SIZE=2>Se nenhuma unidade for informada, ser&aacute; feita
a transfer&ecirc;ncia total dos itens da tabela de origem.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>CONFIRME (S/N) </FONT></B><FONT SIZE=2>-
Indicador de confirma&ccedil;&atilde;o de solicita&ccedil;&atilde;o
de transfer&ecirc;ncia. </FONT>
<P>
<FONT SIZE=2>Os valores poss&iacute;veis s&atilde;o os seguintes:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;S&quot; - Para confirmar a solicita&ccedil;&atilde;o
de transfer&ecirc;ncia da(s) tabela(s);</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;N&quot; - Para cancelar a opera&ccedil;&atilde;o.</dir>
<P>
<A NAME="Solfam"><B><FONT SIZE=2>Solicita&ccedil;&atilde;o de
transfer&ecirc;ncia de fam&iacute;lia de tabelas</FONT></B></A>
<P>
<FONT SIZE=2>A solicita&ccedil;&atilde;o de transfer&ecirc;ncia
pode ser feita para uma tabela ou para um grupo de tabelas, conforme
o argumento informado, sendo que o maior grupo poss&iacute;vel
de ser solicitado s&atilde;o todas as tabelas de um sistema.</FONT>
<P>
<FONT SIZE=2>Exemplo:</FONT>
<P>
<FONT SIZE=2>Se for informado &quot;FGHM&quot;, ser&atilde;o inclu&iacute;das
solicita&ccedil;&otilde;es de transfer&ecirc;ncia de todas as
tabelas do sistema &quot;FGH&quot;. Por outro lado, se for informado
&quot;FGHM5011&quot; como argumento da solicita&ccedil;&atilde;o
de transfer&ecirc;ncia, ser&aacute; inclu&iacute;da solicita&ccedil;&atilde;o
para transfer&ecirc;ncia apenas da tabela FGHM5011.</FONT>
<P>
<FONT SIZE=2>Quando &eacute; solicitada a transfer&ecirc;ncia
de uma fam&iacute;lia de tabelas, somente ser&atilde;o inclu&iacute;das
solicita&ccedil;&otilde;es para as tabelas do grupo que n&atilde;o
estejam com</FONT><I><FONT SIZE=2 COLOR=#000000> status</FONT></I><FONT SIZE=2>
&quot;A LIBERAR&quot; ou &quot;A REORGANIZAR&quot;.</FONT>
<P>
<FONT SIZE=2>Ap&oacute;s a solicita&ccedil;&atilde;o de transfer&ecirc;ncia,
o Gerenciador de Tabelas exibe uma tela contendo o c&oacute;digo
e o ambiente das tabelas para as quais n&atilde;o foi poss&iacute;vel
incluir solicita&ccedil;&atilde;o. A situa&ccedil;&atilde;o destas
tabelas dever&aacute; ser normalizada para que elas possam ser
transferidas.</FONT>
<P>
<A NAME="Excsol"><B><FONT SIZE=2>Exclus&atilde;o de solicita&ccedil;&otilde;es
de transfer&ecirc;ncia</FONT></B></A>
<P>
<FONT SIZE=2>O Gerenciador de Tabelas permite que qualquer solicita&ccedil;&atilde;o
de transfer&ecirc;ncia anteriormente cadastrada no SADS possa
ser exclu&iacute;da antes que seja executada a extra&ccedil;&atilde;o
das tabelas selecionadas.</FONT>
<P>
<FONT SIZE=2>A exclus&atilde;o de solicita&ccedil;&otilde;es de
transfer&ecirc;ncia n&atilde;o est&aacute; associada a nenhuma
tela de processamento. Portanto, para efetu&aacute;-la, basta
transmitir os argumentos do menu de opera&ccedil;&atilde;o &quot;SOLTRATAB&quot;,
cujos campos s&atilde;o explicados a seguir: </FONT>
<P>
<B><FONT SIZE=2 COLOR=#000000>CAMPOS DA TELA</FONT></B>
<P><dir><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>Operacao</FONT></B><FONT SIZE=2>
- &quot;EXC&quot;.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>Tabela</FONT></B><FONT SIZE=2> -
C&oacute;digo de uma tabela no padr&atilde;o SADS ou de uma fam&iacute;lia
de tabelas (&quot;sssM&quot;), caso seja necess&aacute;rio excluir
a solicita&ccedil;&atilde;o de transfer&ecirc;ncia de todas as
tabelas de um sistema.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>Ambiente origem</FONT></B><FONT SIZE=2>
- Ambiente origem da(s) tabela(s) que ter&aacute;(&atilde;o) sua(s)
solicita&ccedil;&atilde;o(&otilde;es) exclu&iacute;da(s) (opcional).
</FONT>
<P>
<FONT SIZE=2>Se nenhum ambiente for informado, ser&atilde;o exclu&iacute;das
todas as solicita&ccedil;&otilde;es de transfer&ecirc;ncia efetuadas
para as tabelas do sistema selecionado que se enquadrem nas especifica&ccedil;&otilde;es
do Ambiente destino.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>Ambiente destino</FONT></B><FONT SIZE=2>
- Ambiente destino da(s) tabela(s) que ter&aacute;(&atilde;o)
sua(s) solicita&ccedil;&atilde;o(&otilde;es) exclu&iacute;da(s)
(opcional).</FONT>
<P>
<FONT SIZE=2>Se nenhum ambiente for especificado, ser&atilde;o
exclu&iacute;das todas as solicita&ccedil;&otilde;es de transfer&ecirc;ncia
efetuadas para as tabelas do sistema selecionado que se enquadrem
nas especifica&ccedil;&otilde;es do Ambiente origem.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>Empresa</FONT></B><FONT SIZE=2>
- C&oacute;digo da empresa (Opcional).</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>Estabelecimento </FONT></B><FONT SIZE=2>-
C&oacute;digo do estebelecimento (Opcional).</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>Unidade </FONT></B><FONT SIZE=2>-
C&oacute;digo da Unidade (opcional).</FONT>
<P>
<FONT SIZE=2>Os c&oacute;digos de empresa, estabelecimento e unidade
devem ser informados quando se deseja excluir somente as solicita&ccedil;&otilde;es
com especifica&ccedil;&atilde;o de unidades de armazenamento para
transfer&ecirc;ncia dos itens. Caso n&atilde;o sejam informados,
ser&atilde;o exclu&iacute;dos todos os itens que se enquadrem
nas demais especifica&ccedil;&otilde;es.</dir>
<P>
<A NAME="Consol"><B><FONT SIZE=2>Consulta solicita&ccedil;&otilde;es
de transfer&ecirc;ncia</FONT></B></A>
<P>
<FONT SIZE=2>O Gerenciador de Tabelas permite consultar as solicita&ccedil;&otilde;es
de transfer&ecirc;ncia cadastradas para uma determinada tabela,
para uma fam&iacute;lia de tabelas ou para todas as solicita&ccedil;&otilde;es
cadastradas.</FONT>
<P>
<FONT SIZE=2>A consulta &agrave;s solicita&ccedil;&otilde;es de
transfer&ecirc;ncia &eacute; efetuada utilizando-se do Paginador
de Sa&iacute;da do SADS (STP03).</FONT>
<P>
<B><FONT SIZE=2 COLOR=#000000>CAMPOS DA TELA</FONT></B>
<P><dir><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TABELA</FONT></B><FONT SIZE=2> -
C&oacute;digo da tabela com solicita&ccedil;&atilde;o de transfer&ecirc;ncia
no padr&atilde;o SADS (sssMnnnn).</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>AMBIENTE ORIGEM</FONT></B><FONT SIZE=2>
- Ambiente de onde a tabela ser&aacute; extra&iacute;da.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>AMBIENTE DESTINO</FONT></B><FONT SIZE=2>
- Ambiente para onde ser&aacute; feita a carga da tabela.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>NATUREZA</FONT></B><FONT SIZE=2>
- Natureza da transfer&ecirc;ncia (substitui&ccedil;&atilde;o
ou atualiza&ccedil;&atilde;o);</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TRANSF. ITENS</FONT></B><FONT SIZE=2>
- Indica se os itens de dados ser&atilde;o transferidos ou n&atilde;o;</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>EMP/EST/UND</FONT></B><FONT SIZE=2>
- C&oacute;digo das unidades de armazenamento cujos itens ser&atilde;o
transferidos.</dir>
<P>
<A NAME="Execu"><B><FONT SIZE=2>Execu&ccedil;&atilde;o da transfer&ecirc;ncia
</FONT></B></A>
<P>
<FONT SIZE=2>A transfer&ecirc;ncia das tabelas selecionadas somente
ser&aacute; concretizada atrav&eacute;s da execu&ccedil;&atilde;o
de rotinas </FONT><I><FONT SIZE=2 COLOR=#000000>batch</FONT></I><FONT SIZE=2>,
pelos </FONT><I><FONT SIZE=2 COLOR=#000000>jobs</FONT></I><FONT SIZE=2>
SSTJ01 e SSTJ02, de extra&ccedil;&atilde;o e carga de tabelas,
respectivamente.</FONT>
<P>
<FONT SIZE=2>O processo de extra&ccedil;&atilde;o consiste na
gera&ccedil;&atilde;o de um arquivo a partir das tabelas selecionadas
(para as quais as solicita&ccedil;&otilde;es foram efetuadas)
e dos par&acirc;metros informados no momento das solicita&ccedil;&otilde;es.
As solicita&ccedil;&otilde;es s&atilde;o automaticamente exclu&iacute;das
ap&oacute;s a execu&ccedil;&atilde;o do processo </FONT><I><FONT SIZE=2 COLOR=#000000>batch</FONT></I><FONT SIZE=2>
de extra&ccedil;&atilde;o do arquivo. </FONT>
<P>
<FONT SIZE=2>No momento da carga das tabelas e de seus itens para
o ambiente destino s&atilde;o feitas as consist&ecirc;ncias, tomando
por base as informa&ccedil;&otilde;es contidas nos arquivos extra&iacute;dos
e o ambiente destino. A partir destas consist&ecirc;ncias, &eacute;
gerado um relat&oacute;rio informativo das tabelas n&atilde;o
transferidas com as especifica&ccedil;&otilde;es das irregularidades
nelas detectadas (SSTR03).</FONT>
<P>
<FONT SIZE=2>As irregularidades que poder&atilde;o ocorrer e que
impedem a carga das tabelas nas quais ocorrem, s&atilde;o as seguintes:</FONT>
<p><dir> - Tabela no destino com </FONT><I><FONT SIZE=2 COLOR=#000000>status</FONT></I><FONT SIZE=2>
&quot;a reorganizar&quot;.</dir>
<P>
<FONT SIZE=2>Neste caso, deve-se reorganizar a tabela no destino
antes de efetuar a sua transfer&ecirc;ncia.</FONT>
<P><dir>-Tabela no destino com </FONT><I><FONT SIZE=2 COLOR=#000000>status</FONT></I><FONT SIZE=2>
&quot;a liberar&quot;.</dir>
<P>
<FONT SIZE=2>Neste caso, deve-se liberar a tabela no destino antes
de efetuar a sua transfer&ecirc;ncia.</FONT>
<P><dir>-Diverg&ecirc;ncia entre as estruturas, par&acirc;metros
ou desenho das tabelas origem e destino.</dir>
<P>
<FONT SIZE=2>Esta incompatibilidade n&atilde;o &eacute; aceit&aacute;vel
para transfer&ecirc;ncias de tabelas com atualiza&ccedil;&atilde;o
de itens. A transfer&ecirc;ncia com atualiza&ccedil;&atilde;o
de itens s&oacute; &eacute; feita nos casos em que os par&acirc;metros,
a estrutura, o desenho e as chaves secund&aacute;rias da tabela
forem as mesmas.</FONT>
<P>
<FONT SIZE=2>Se o usu&aacute;rio quiser atualizar a tabela e seus
itens sem perder os itens cadastrados na tabela destino, esta
transfer&ecirc;ncia dever&aacute; ser feita em tr&ecirc;s etapas:</FONT>
<ol type=1><li>Atualiza&ccedil;&atilde;o da tabela (par&acirc;metros,
estrutura, desenho e as chaves secund&aacute;rias) sem transfer&ecirc;ncia
de itens;</FONT>
<li>Reorganiza&ccedil;&atilde;o dos itens na tabela
do ambiente e no computador destino;</FONT>
<li> Atualiza&ccedil;&atilde;o da tabela (seus elementos
j&aacute; estar&atilde;o compat&iacute;veis) com transfer&ecirc;ncia
de itens.</ol>
<P><dir>
<FONT SIZE=2>-Crit&eacute;rios de valida&ccedil;&atilde;o de datas
incompat&iacute;veis.</dir>
<P>
<FONT SIZE=2>Esta irregularidade ocorre quando for solicitada
a atualiza&ccedil;&atilde;o de uma tabela que tem o crit&eacute;rio
de valida&ccedil;&atilde;o por data na origem incompat&iacute;vel
com o destino.</FONT>
<P>
<FONT SIZE=2>Caso o usu&aacute;rio queira atualizar a tabela e
seus itens sem perder os itens cadastrados na tabela destino,
esta transfer&ecirc;ncia dever&aacute; ser feita em tr&ecirc;s
etapas:</FONT>
<ol type=1><li>Atualiza&ccedil;&atilde;o da tabela (par&acirc;metros,
estrutura, desenho e as chaves secund&aacute;rias) sem transfer&ecirc;ncia
de itens;</FONT>
<li>Reorganiza&ccedil;&atilde;o dos itens na tabela
destino;</FONT>
<li>Atualiza&ccedil;&atilde;o da tabela (seus elementos
j&aacute; estar&atilde;o compat&iacute;veis) com transfer&ecirc;ncia
de itens.</ol>
<P>
<A NAME="Jobta"><B><FONT SIZE=2>Jobs para transfer&ecirc;ncia
de tabelas</FONT></B></A>
<P>
<FONT SIZE=2>Os </FONT><I><FONT SIZE=2 COLOR=#000000>jobs</FONT></I><FONT SIZE=2>
encarregados de efetuar a transfer&ecirc;ncia das tabelas s&atilde;o
os seguites:</FONT>
<P><dir><b>SSTJ01 - </b><I><FONT SIZE=2 COLOR=#000000>Job</FONT></I><FONT SIZE=2>
para extra&ccedil;&atilde;o das tabelas selecionadas do ambiente
e computador origem;</FONT>
<P>
<b>SSTJ02 - </b><I><FONT SIZE=2 COLOR=#000000>Job</FONT></I><FONT SIZE=2>
para carga das tabelas no ambiente e computador destino.</dir>
<P>
<FONT SIZE=2>Segue uma descri&ccedil;&atilde;o detalhada de cada
um destes </FONT><I><FONT SIZE=2 COLOR=#000000>jobs</FONT></I><FONT SIZE=2>:</FONT>
<p><ol type=a><li><I><B><FONT SIZE=2 COLOR=#000000>Job</FONT></B></I><B><FONT SIZE=2 COLOR=#000000>
SSTJ01</FONT></B>
<P>
<FONT SIZE=2>O </FONT><I><FONT SIZE=2 COLOR=#000000>job</FONT></I><FONT SIZE=2>
SSTJ01, encarregado pela extra&ccedil;&atilde;o das tabelas do
ambente de origem, &eacute; composto pelos seguintes programas
de extra&ccedil;&atilde;o:</FONT>
<p>
<ul type=disc><li>SSTP11 - Extra&ccedil;&atilde;o de par&acirc;metros
de tabelas;</FONT>
<li>SSTP12 - Extra&ccedil;&atilde;o de itens de tabelas;</FONT>
<li>SSTP13 - Extra&ccedil;&atilde;o de </FONT><I><FONT SIZE=2 COLOR=#000000>layouts</FONT></I><FONT SIZE=2>
de tabelas;</FONT>
<li>SSTP18 - Exclus&atilde;o de solicita&ccedil;&otilde;es
de transfer&ecirc;ncias de tabelas.
<P>
<FONT SIZE=2>Os arquivos por ele gerados s&atilde;o:</FONT>
<li>SS/T/AW/53 - Par&acirc;metros e desenho das tabelas;</FONT>
<li>SS/T/AW/55 - Itens de dados das tabelas (opcional);</FONT>
<li>SS/T/AW/56 - </FONT><I><FONT SIZE=2 COLOR=#000000>Layout</FONT></I><FONT SIZE=2>
das tabelas.
</FONT>
<P>
<FONT SIZE=2>O relat&oacute;rio por ele gerado &eacute; :</FONT>
<li>SSTR04 - Relat&oacute;rio de tabelas extra&iacute;das.</ul>
<p>
<li></FONT><I><B><FONT SIZE=2 COLOR=#000000>Job</FONT></B></I><B><FONT SIZE=2 COLOR=#000000>
SSTJ02:</FONT></B>
<P>
<FONT SIZE=2>O </FONT><I><FONT SIZE=2 COLOR=#000000>job</FONT></I><FONT SIZE=2>
SSTJ02, encarregado pela carga das tabelas no ambiente destino,
&eacute; composto pelos seguintes programas de carga:</FONT>
<p>
<ul type=disc><li>SSTP14 - Gerenciador da rotina de carga de tabelas;</FONT>
<li>SSTP15 - Carga de par&acirc;metros de tabelas;</FONT>
<li>SSTP16 - Carga de </FONT><I><FONT SIZE=2 COLOR=#000000>layouts</FONT></I><FONT SIZE=2>
de tabelas;</FONT>
<li>SSTP17 - Carga de itens de tabelas;</FONT>
<li>SSTP19 - Exclus&atilde;o de controles do processo
de carga.</FONT>
<P>
<FONT SIZE=2>Os arquivos por ele carregados e que foram extra&iacute;dos
pelo </FONT><I><FONT SIZE=2 COLOR=#000000>job</FONT></I><FONT SIZE=2>
SSTJ01, s&atilde;o:</FONT>
<p>
<li>SS/T/AW/53 - Par&acirc;metros e desenho das tabelas;</FONT>
<li>SS/T/AW/55 - Itens de dados das tabelas;</FONT>
<li>SS/T/AW/56 - </FONT><I><FONT SIZE=2 COLOR=#000000>Layout</FONT></I><FONT SIZE=2>
das tabelas.</FONT>
<P>
<FONT SIZE=2>Os relat&oacute;rios por ele gerados s&atilde;o:</FONT>
<P>
<li>SSTR06 - Tabelas carregadas;</FONT>
<li>SSTR03 - Tabelas n&atilde;o carregadas.</ul></ol>
<P>
<FONT SIZE=2>&Eacute; importante ressaltar que este </FONT><I><FONT SIZE=2 COLOR=#000000>job</FONT></I><FONT SIZE=2>
possui controles pr&oacute;prios para a execuc&atilde;o dos seus
programas e, em caso de ser descontinuado por qualquer motivo,
pode-se execut&aacute;-lo novamente sem nenhuma interfer&ecirc;ncia
no processo final. Entretanto, para que o </FONT><I><FONT SIZE=2 COLOR=#000000>job</FONT></I><FONT SIZE=2>
possa finalizar devidamente o processo descontinuado, os arquivos
utilizados para a nova execu&ccedil;&atilde;o devem ser obrigatoriamente
os mesmos que os da execu&ccedil;&atilde;o anterior .</FONT>
<P>
<FONT SIZE=2>Os arquivos utilizados para a carga s&atilde;o removidos
no final da execu&ccedil;&atilde;o do </FONT><I><FONT SIZE=2 COLOR=#000000>job</FONT></I><FONT SIZE=2>.</FONT>
<P>
<A NAME="Relat"><B><FONT SIZE=2>Relat&oacute;rios gerados durante
a transfer&ecirc;ncia de tabelas</FONT></B></A>
<P><Dir><b>SSTR04</b> - Relat&oacute;rio de Extra&ccedil;&atilde;o
de Tabelas. </dir>
<P>
<FONT SIZE=2>Este relat&oacute;rio &eacute; emitido atrav&eacute;s
da execu&ccedil;&atilde;o do </FONT><I><FONT SIZE=2 COLOR=#000000>job</FONT></I><FONT SIZE=2>
SSTJ01 e imprime dados referentes &agrave;s tabelas que efetivamente
est&atilde;o sendo extra&iacute;das.</FONT>
<P><dir><b>SSTR06</b> - Relat&oacute;rio das Tabelas Carregadas.</dir>
<P>
<FONT SIZE=2>Este relat&oacute;rio &eacute; emitido atrav&eacute;s
da execu&ccedil;&atilde;o do </FONT><I><FONT SIZE=2 COLOR=#000000>job</FONT></I><FONT SIZE=2>
SSTJ02 e cont&eacute;m informa&ccedil;&otilde;es a respeito da
natureza das tabelas efetivamente carregadas, da atualiza&ccedil;&atilde;o
ou altera&ccedil;&atilde;o ocorrida e, caso necess&aacute;rio,
dos procedimentos que devem ser tomados ap&oacute;s esta execu&ccedil;&atilde;o.</FONT>
<P><dir><b>SSTR03</b> - Relat&oacute;rio das Tabelas n&atilde;o
Carregadas.</dir>
<P>
<FONT SIZE=2>Este relat&oacute;rio &eacute; emitido atrav&eacute;s
da execu&ccedil;&atilde;o do </FONT><I><FONT SIZE=2 COLOR=#000000>job</FONT></I><FONT SIZE=2>
SSTJ02. Sua fun&ccedil;&atilde;o &eacute; listar todas as tabelas
extra&iacute;das que se encontram com irregularidades que impedem
a sua transfer&ecirc;ncia.</FONT>
<P>
<FONT SIZE=2>As irregularidades constatadas podem ser as seguintes:</FONT>
<P><dir><img src="Bullet1.gif" width=8 heigth=8>Tabela no destino com </FONT><I><FONT SIZE=2 COLOR=#000000>status</FONT></I><FONT SIZE=2>
&quot;a reorganizar&quot;; </FONT>
<P>
<img src="Bullet1.gif" width=8 heigth=8>Tabela no destino com </FONT><I><FONT SIZE=2 COLOR=#000000>status</FONT></I><FONT SIZE=2>
&quot;a liberar&quot;. </FONT>
<P>
<img src="Bullet1.gif" width=8 heigth=8>Diverg&ecirc;ncia entre as estruturas, par&acirc;metros
ou desenho das tabelas origem e destino, nas transfer&ecirc;ncias
com atualiza&ccedil;&atilde;o de itens;</FONT>
<P>
<img src="Bullet1.gif" width=8 heigth=8>Crit&eacute;rios de valida&ccedil;&atilde;o de data
das tabelas origem e destino imcompat&iacute;veis.</dir>
<P>
<FONT SIZE=2>Para contornar as irregularidades constatadas, deve-se
proceder de acordo com explica&ccedil;&otilde;es anteriores, descritas
na introdu&ccedil;&atilde;o do t&oacute;pico &quot;Transfer&ecirc;ncia
de Tabelas&quot;, nesta se&ccedil;&atilde;o.</FONT>
<P>
<A NAME="Execut"><B><FONT SIZE=2>Como executar a transfer&ecirc;ncia</FONT></B></A>
<P>
<FONT SIZE=2>A transfer&ecirc;ncia das tabelas deve ser efetuada
conforme os passos descritos a seguir:</FONT>
<ol type=1><li> No ambiente SADS de origem, deve-se executar
o </FONT><I><FONT SIZE=2 COLOR=#000000>job</FONT></I><FONT SIZE=2>
&quot;SS/T/JB/01&quot; para a extra&ccedil;&atilde;o das tabelas
selecionadas atrav&eacute;s das solicita&ccedil;&otilde;es de
transfer&ecirc;ncia e, ap&oacute;s a execu&ccedil;&atilde;o do
</FONT><I><FONT SIZE=2 COLOR=#000000>job</FONT></I><FONT SIZE=2>,
verificar, no relat&oacute;rio SSTR04, se todas as tabelas selecionadas
foram extra&iacute;das;</FONT>
<li> Os arquivos SS/T/AW/53, SS/T/AW/55 e SS/T/AW/56,
gerados pela execu&ccedil;&atilde;o do </FONT><I><FONT SIZE=2 COLOR=#000000>job</FONT></I><FONT SIZE=2>
SS/T/JB/01, devem ser copiados para o computador de destino, para
onde as tabelas ser&atilde;o transferidas; </FONT>
<li> No computador de destino, deve-se executar o
</FONT><I><FONT SIZE=2 COLOR=#000000>job</FONT></I><FONT SIZE=2>
&quot;SS/T/JB/02&quot; para carga das tabelas e, ap&oacute;s a
execu&ccedil;&atilde;o do </FONT><I><FONT SIZE=2 COLOR=#000000>job</FONT></I><FONT SIZE=2>,
verificar, no relat&oacute;rio SSTR06, se todas as tabelas extra&iacute;das
foram carregadas. Caso contr&aacute;rio, atrav&eacute;s do relat&oacute;rio
SSTR03, deve-se verificar os motivos pelos quais as tabelas n&atilde;o
foram carregadas. </ol></dir></dir></dir>
<P>
<A NAME="Juncao"><B><FONT SIZE=4>Jun&ccedil;&atilde;o de tabelas</FONT></B></A>
<P>
<FONT SIZE=2>O Sistema de Tabelas fornece uma fun&ccedil;&atilde;o
para unifica&ccedil;&atilde;o de tabelas, dentro de um mesmo ambiente,
que possuam os mesmos par&acirc;metros e desenhos e que n&atilde;o
possuam defini&ccedil;&atilde;o de chaves secund&aacute;rias.
</FONT>
<P>
<FONT SIZE=2>Esta fun&ccedil;&atilde;o possibilita a jun&ccedil;&atilde;o
de v&aacute;rias tabelas iguais que foram desenvolvidas para empresas,
estabelecimentos ou unidades diferentes em vers&otilde;es do SADS
anteriores &agrave; 3.0, que n&atilde;o contemplavam o crit&eacute;rio
de armazenamento de itens. Neste caso, deve-se, primeiramente,
alterar todas as tabelas para o mesmo crit&eacute;rio de armazenamento,
utilizando a fun&ccedil;&atilde;o &quot;LIV&quot; (Altera&ccedil;&atilde;o
Livre), descrita anteriormente no t&oacute;pico &quot;Manuten&ccedil;&otilde;es
por local de armazenamento&quot;, neste mesmo item, e adequar
cada grupo de itens para as unidades espec&iacute;ficas &agrave;s
quais eles se relacionar&atilde;o.</FONT>
<P>
<FONT SIZE=2>As tabelas a serem unidas devem, obrigatoriamente,
ter par&acirc;metros e desenho iguais, residir no mesmo ambiente
(teste ou produ&ccedil;&atilde;o) e n&atilde;o devem possuir especifica&ccedil;&otilde;es
de chaves secund&aacute;rias.</FONT>
<P>
<FONT SIZE=2>A jun&ccedil;&atilde;o de tabelas sem observar as
condi&ccedil;&otilde;es acima descritas pode causar a desorganiza&ccedil;&atilde;o
dos itens de dados da tabela destino da opera&ccedil;&atilde;o.
</FONT>
<P>
<FONT SIZE=2>Os itens da tabela destino ser&atilde;o mantidos
e os das tabelas origem ser&atilde;o adicionados.</FONT>
<P>
<FONT SIZE=2>Os itens em duplicata, isto &eacute;, aqueles cadastrados
na tabela destino, n&atilde;o ser&atilde;o inclu&iacute;dos. Portanto,
deve-se observar a unidade de armazenamento de cada tabela, a
fim de evitar redund&acirc;ncias e a consequente perda de itens
na tabela unificada.</FONT>
<P>
<FONT SIZE=2>As tabelas (par&acirc;metro, desenho e itens) n&atilde;o
s&atilde;o exclu&iacute;das automaticamente ap&oacute;s a unifica&ccedil;&atilde;o
das mesmas. Por isto, antes de exclui-las, &eacute; aconselh&aacute;vel
que se fa&ccedil;a uma confer&ecirc;ncia do resultado da opera&ccedil;&atilde;o.</FONT>
<P>
<FONT SIZE=2>Algumas medidas devem ser tomadas para prepara&ccedil;&atilde;o
das tabelas que sofrer&atilde;o a jun&ccedil;&atilde;o:</FONT>
<ol type=1><li> Certificar-se de que todas as tabelas integrantes
desta opera&ccedil;&atilde;o atendem &agrave;s especifica&ccedil;&otilde;es
acima descritas;</FONT>
<li> Garantir que todas as tabelas a serem unidas
tenham o mesmo crit&eacute;rio de armazenamento (empresa, estabelecimento
ou unidade);</FONT>
<li> As tabelas alteradas devem pertencer todas ao
mesmo ambiente, que dever&aacute; ser o mesmo onde a tabela destino
ser&aacute; utilizada;</FONT>
<li> Utilizar a opera&ccedil;&atilde;o &quot;LIV&quot;
(Altera&ccedil;&atilde;o Livre), da fun&ccedil;&atilde;o de &quot;Manuten&ccedil;&otilde;es
por local de armazenamento&quot;, para compatibilizar os itens
da tabela ao novo local de armazenamento.</ol>
<P>
<FONT SIZE=2>A seguir, &eacute; apresentado um exemplo pr&aacute;tico
de como proceder a jun&ccedil;&atilde;o de tabelas.</FONT>
<P>
<FONT SIZE=2>Em uma instala&ccedil;&atilde;o existem quatro tabelas
cadastradas no ambiente de produ&ccedil;&atilde;o com o mesmo
desenho e estrutura de dados e sem especifica&ccedil;&atilde;o
de crit&eacute;rio de armazenamento. </FONT>
<P>
<FONT SIZE=2>S&atilde;o elas:</FONT>
<P><dir>
<FONT SIZE=2>SXYM5001, utilizada pela empresa 001;</FONT>
<P>
<FONT SIZE=2>SXYM5002, utilizada pela empresa 002;</FONT>
<P>
<FONT SIZE=2>SXYM5003, utilizada pela empresa 003;</FONT>
<P>
<FONT SIZE=2>SXYM5004, utilizada pela empresa 004.</dir>
<P>
<FONT SIZE=2>O objetivo &eacute; unific&aacute;-las, utilizando-se
do c&oacute;digo SXYM5001, para que os programas fa&ccedil;am
acesso a uma &uacute;nica tabela.</FONT>
<P>
<FONT SIZE=2>O crit&eacute;rio de armazenamento a ser definido
para a tabela resultante &eacute; &quot;EMP&quot; (EMPRESA).</FONT>
<P>
<FONT SIZE=2>Antes de proceder a jun&ccedil;&atilde;o das tabelas,
&eacute; necess&aacute;rio realizar algumas altera&ccedil;&otilde;es
nos seus itens, de modo que cada item de cada tabela seja colocado
no local de armazenamento em que eles assumir&atilde;o no destino:
</FONT>
<P>
<TABLE BORDER=1>
<TR><TD WIDTH=118>TABELA</TD><TD WIDTH=130>DE EMP EST UND</TD>
<TD WIDTH=130>PARA EMP EST UND</TD></TR>
<TR><TD WIDTH=118>SXYM5001</TD><TD WIDTH=130>000 0000 000</TD>
<TD WIDTH=130>001 0000 000</TD></TR>
<TR><TD WIDTH=118>SXYM5002</TD><TD WIDTH=130>000 0000 000</TD>
<TD WIDTH=130>002 0000 000</TD></TR>
<TR><TD WIDTH=118>SXYM5003</TD><TD WIDTH=130>000 0000 000</TD>
<TD WIDTH=130>003 0000 000</TD></TR>
<TR><TD WIDTH=118>SXYM5004</TD><TD WIDTH=130>00 0000 000</TD>
<TD WIDTH=130>004 0000 000</TD></TR>
</TABLE>
<P><dir><B><FONT SIZE=2 COLOR=#000000>CAMPOS DA TELA</FONT></B>
<P><dir><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TABELA/AMBIENTE DESTINO</FONT></B><FONT SIZE=2>
- C&oacute;digo da tabela no padr&atilde;o SADS e ambiente onde
ser&atilde;o armazenados os itens das tabelas.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TABELAS ORIGEM </FONT></B><FONT SIZE=2>-
C&oacute;digo de no m&aacute;ximo 10 tabelas, cujos itens ser&atilde;o
armazenados na tabela destino e no ambiente especificado.</FONT>
<P>
<FONT SIZE=2>As tabelas e seus itens n&atilde;o s&atilde;o exclu&iacute;das
ap&oacute;s a opera&ccedil;&atilde;o de jun&ccedil;&atilde;o.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>CONFIRME (S/N)</FONT></B><FONT SIZE=2>
- Indicador de confirma&ccedil;&atilde;o de opera&ccedil;&atilde;o.</FONT>
<P>
<FONT SIZE=2>Os valores poss&iacute;veis s&atilde;o os seguintes:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;S&quot; - Para confirmar a opera&ccedil;&atilde;o
de jun&ccedil;&atilde;o de tabelas;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;N&quot; - Para cancelar a opera&ccedil;&atilde;o.</dir></dir></dir>
<P>
<A NAME="Gener"><B><FONT SIZE=5>Gen&eacute;ricas aplic&aacute;veis
&agrave;s tabelas</FONT></B></A>
<P><blockquote><img src="Bullet5.gif" width=13 heigth=13>Utilit&aacute;rios:</FONT>
<P><dir><img src="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>.Duplica&ccedil;&atilde;o de elemento;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>Descri&ccedil;&atilde;o de elemento;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>Exporta&ccedil;&atilde;o de descri&ccedil;&atilde;o
de elemento;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>Importa&ccedil;&atilde;o de descri&ccedil;&atilde;o
de elemento.</DIR>
<P><img src="Bullet5.gif" width=13 heigth=13>Consultas:</FONT>
<P><DIR><img src="Bullet7.gif" width=13 heigth=13>Elementos por sistema;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>Estrutura de dados, de tabelas e suas chaves secund&aacute;rias;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>Descri&ccedil;&atilde;o de elemento, de tabelas
e de suas chaves secund&aacute;rias;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>Fonte de </FONT><I><FONT SIZE=2 COLOR=#000000>library</FONT></I><FONT SIZE=2>.</DIR>
<P><img src="Bullet5.gif" width=13 heigth=13>Refer&ecirc;ncia cruzada:</FONT>
<P><DIR><img src="Bullet7.gif" width=13 heigth=13>Elementos x elemento - Programas que utilizam uma
tabela; Tabelas utilizadas por um programa.</DIR>
<P><img src="Bullet5.gif" width=13 heigth=13>Informativos impressos:</FONT>
<P><DIR><img src="Bullet7.gif" width=13 heigth=13>Lista elementos por sistema;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>Lista descri&ccedil;&atilde;o e validades de atributos
e campos por estrutura e de tabelas e suas chaves secund&aacute;rias;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>Lista estrutura de dados e de tabelas e suas chaves
secund&aacute;rias;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>Lista descri&ccedil;&otilde;es de elementos e de
tabelas e suas chaves secund&aacute;rias;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>Lista fonte de </FONT><I><FONT SIZE=2 COLOR=#000000>library</FONT></I><FONT SIZE=2>;</FONT>
<P><img src="Bullet7.gif" width=13 heigth=13>Lista desenhos de tabelas.</DIR>
<P>
<FONT SIZE=2>Todos estes utilit&aacute;rios, consultas, refer&ecirc;ncia
cruzada e informativos impressos encontram-se detalhadamente descritos
na Se&ccedil;&atilde;o III, &quot;Fun&ccedil;&otilde;es de apoio&quot;,
neste manual.</FONT></blockquote></DIR></DIR>
<P>
<A NAME="Interf"><B><FONT SIZE=5>Interface com aplicativos</FONT></B></A>
<HR>
<P>
<FONT SIZE=2>A </FONT><I><FONT SIZE=2 COLOR=#000000>interface</FONT></I><FONT SIZE=2>
dos programas aplicativos com as tabelas criadas no SADS ocorre
atrav&eacute;s de duas sub-rotinas:</FONT>
<P><DIR><img src="Bullet1.gif" width=8 heigth=8>Sub-rotina para acesso aos itens de tabela;</FONT>
<P><img src="Bullet1.gif" width=8 heigth=8>Sub-rotina para tratamento de exclus&atilde;o de
itens de tabela.</DIR>
<P>
<FONT SIZE=2>A seguir, s&atilde;o apresentadas explica&ccedil;&otilde;es
detalhadas de cada uma dessas sub-rotinas e os procedimentos para
sua utiliza&ccedil;&atilde;o.</FONT>
<P>
<A NAME="Itens"><B><FONT SIZE=5>Sub-rotina para acesso aos itens
de tabela</FONT></B></A>
<P>
<FONT SIZE=2>O Sistema de Tabelas permite aos programas aplicativos
consultar os itens das tabelas cadastradas no SADS. Esta consulta
&eacute; possibilitada pela sub-rotina SSTS01, que busca os itens
desejados na base de dados do SADS e os devolve para o programa
aplicativo.</FONT>
<P>
<A NAME="SSTS01"><B><FONT SIZE=4>&Aacute;rea de Comunica&ccedil;&atilde;o
com a sub-rotina SSTS01 (Library SS/T/SL/01)</FONT></B></A>
<P>
<FONT SIZE=2>Para executar o acesso aos itens via sub-rotina SSTS01,
os programas aplicativos devem utilizar os atributos contidos
na </FONT><I><FONT SIZE=2 COLOR=#000000>library</FONT></I><FONT SIZE=2>
de &aacute;rea de comunica&ccedil;&atilde;o descrita a seguir:</FONT>
<PRE><FONT SIZE=3>
  01  TS0101-SSTS01.
    10 TS0101-VERSAO             PIC 9(004).
    10 TS0101-RESULT             PIC 9(002).
    10 TS0101-OPCAO              PIC 9(002).
    10 TS0101-UNDUSUSADS         PIC 9(002).
    10 TS0101-EMPCOD             PIC 9(003).
    10 TS0101-ETBCOD             PIC 9(004).
    10 TS0101-UNDCOD             PIC 9(003).
    10 TS0101-TBLCOD             PIC X(008).
    10 TS0101-TBLARG             PIC X(030).
    10 TS0101-TBLPESQ            PIC X(001).
    10 TS0101-TBLSTA             PIC 9(001).
    10 TS0101-TBLDATATU          PIC 9(006).
    10 TS0101-TBLHORATU          PIC 9(006).
    10 TS0101-TBLITEM            PIC X(300).
    10 TS0101-TABTIPDAT          PIC 9(001).
    10 TS0101-TABAMBI            PIC X(001).
    10 TS0101-CSTIDT             PIC X(001).
    10 TS0101-CCSARGUM           PIC X(050).
    10 TS0101-MENSCOD            PIC X(005).
</PRE></FONT>
<P>O acesso aos itens das tabelas somente ser&aacute;
poss&iacute;vel se cada um destes campos for devidamente preenchido
nos programas aplicativos, conforme a seguir:</FONT>
<P><dir><img SRC="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TS0101-UNDUSUSADS </FONT></B><FONT SIZE=2>-
Unidade de usu&aacute;rio SADS.
Este campo n&atilde;o precisa ser composto, pois sua utiliza&ccedil;&atilde;o
n&atilde;o se encontra implementada na vers&atilde;o corrente
do SADS.</FONT>
<P><IMG SRC="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TS0101-EMPCOD</FONT></B><FONT SIZE=2>
- C&oacute;digo da empresa.<BR>
Em programas </FONT><I><FONT SIZE=2 COLOR=#000000>on-line</FONT></I><FONT SIZE=2>
que utilizam o Sistema de Seguran&ccedil;a do SADS e conforme
o crit&eacute;rio de unidade de&nbsp;armazenamento especificado
para a tabela, este campo deve ser sempre composto com GBL-EMPCOD.
Em programas </FONT><I><FONT SIZE=2 COLOR=#000000>batch</FONT></I><FONT SIZE=2>
e sub-rotinas, deve-se compor este campo de acordo com a necessidade
espec&iacute;fica de cada um.</FONT>
<P><IMG SRC="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TS0101-ETBCOD</FONT></B><FONT SIZE=2>
- C&oacute;digo do estabelecimento.</FONT>
<P>
<FONT SIZE=2>Em programas </FONT><I><FONT SIZE=2 COLOR=#000000>on-line</FONT></I><FONT SIZE=2>
que utilizam o Sistema de Seguran&ccedil;a do SADS e conforme
o crit&eacute;rio de unidade de&nbsp;armazenamento especificado
para a tabela, este campo deve ser sempre composto com GBL-ETBCOD.
Em programas </FONT><I><FONT SIZE=2 COLOR=#000000>batch</FONT></I><FONT SIZE=2>
e sub-rotinas, deve-se compor este campo de acordo com a necessidade
espec&iacute;fica de cada um.</FONT>
<P><IMG SRC="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TS0101-UNDCOD</FONT></B><FONT SIZE=2>
- C&oacute;digo da unidade.</FONT>
<P>
<FONT SIZE=2>Em programas </FONT><I><FONT SIZE=2 COLOR=#000000>on-line</FONT></I><FONT SIZE=2>
que utilizam o Sistema de Seguran&ccedil;a do SADS e conforme
o crit&eacute;rio de unidade de&nbsp;armazenamento especificado
para a tabela, este campo deve ser sempre composto com GBL-UNDCOD.
Em programas </FONT><I><FONT SIZE=2 COLOR=#000000>batch</FONT></I><FONT SIZE=2>
e sub-rotinas, deve-se compor este campo de acordo com a necessidade
espec&iacute;fica de cada um.</FONT>
<P>
<FONT SIZE=2>A tabela abaixo exemplifica como compor os campos
TS0101-EMPCOD, TS0101-ETBCOD e TS0101-UNDCOD da &aacute;rea de
comunica&ccedil;&atilde;o com a sub-rotina, conforme o crit&eacute;rio
de unidade de armazenamento especificado para a tabela:</FONT>
<P>
<TABLE BORDER=1>
<TR><td><TD COLSPAN=4 WIDTH=457><CENTER>CRIT&Eacute;RIO DE ARMAZENAMENTO</CENTER>
</TD></TR>
<TR><TD WIDTH=133>CAMPOS</TD><TD WIDTH=108>NENHUM</TD><TD WIDTH=108>EMPRESA
</TD><TD WIDTH=108>ESTABELEC</TD><TD WIDTH=108>UNIDADE</TD></TR>
<TR><TD WIDTH=133>TS0101-EMPCOD</TD><TD WIDTH=108>ZERO</TD><TD WIDTH=108>GBL-EMPCOD
</TD><TD WIDTH=108>GBL-EMPCOD</TD><TD WIDTH=108>GBL-EMPCOD</TD>
</TR>
<TR><TD WIDTH=133>TS0101-ETBCOD</TD><TD WIDTH=108>ZERO</TD><TD WIDTH=108>ZERO
</TD><TD WIDTH=108>GBL-ETBCOD</TD><TD WIDTH=108>GBL-ETBCOD</TD>
</TR>
<TR><TD WIDTH=133>TS0101-UNDCOD</TD><TD WIDTH=108>ZERO </TD><TD WIDTH=108>ZERO
</TD><TD WIDTH=108>ZERO</TD><TD WIDTH=108>GBL-UNDCOD</TD></TR>
</TABLE>
<P>
Os campos GBL-EMPCOD, GBL-ETBCOD e GBL-UNDCOD somente podem ser
utilizados por programas on-<I><FONT SIZE=2 COLOR=#000000>line</FONT></I><FONT SIZE=2>
que utilizam o Sistema de Seguran&ccedil;a do SADS. Caso contr&aacute;rio,
eles devem ser compostos de acordo com a necessidade espec&iacute;fica.</FONT>
<P><IMG SRC="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TS0101-TBLCOD</FONT></B><FONT SIZE=2>
- C&oacute;digo da tabela, no padr&atilde;o SADS (sssMnnmm), cujos
itens ser&atilde;o acessados .</FONT>
<P><IMG SRC="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TS0101-TABAMBI</FONT></B><FONT SIZE=2>
- Ambiente da tabela (T ou P).</FONT>
<P>
<FONT SIZE=2>Em programas </FONT><I><FONT SIZE=2 COLOR=#000000>on-line</FONT></I><FONT SIZE=2>
que utilizam o Sistema de Seguran&ccedil;a do SADS, este campo
deve ser composto com GBL-USUAMBI, que &eacute; o ambiente onde
o usu&aacute;rio efetuou o </FONT><I><FONT SIZE=2 COLOR=#000000>logon</FONT></I><FONT SIZE=2>.
Em programas </FONT><I><FONT SIZE=2 COLOR=#000000>batch</FONT></I><FONT SIZE=2>
e sub-rotinas, deve-se compor este campo de acordo com a necessidade
espec&iacute;fica.</FONT>
<P><IMG SRC="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TS0101-TBLPESQ</FONT></B><FONT SIZE=2>
- Tipo de pesquisa.</FONT>
<P>
<FONT SIZE=2>Os valores poss&iacute;veis s&atilde;o os seguintes:</FONT>
<P><dir><IMG SRC="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;S&quot; (Sequencial);</FONT>
<P><IMG SRC="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;R&quot; (Rand&ocirc;mico);</FONT>
<P><IMG SRC="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;C&quot; (Teste de exist&ecirc;ncia do item);</FONT>
<P><IMG SRC="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;E&quot; (Teste de exist&ecirc;ncia da tabela);</FONT>
<P><IMG SRC="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;L&quot; (Acesso sequencial invertido);</FONT>
<P><IMG SRC="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;U&quot; (Acesso ao &uacute;ltimo item da tabela);</FONT>
<P><IMG SRC="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;P&quot; (Acesso rand&ocirc;mico ao pr&oacute;ximo
item) - Caso o item especificado n&atilde;o exista, o acesso ser&aacute;
ao pr&oacute;ximo item;</FONT>
<P><IMG SRC="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;A&quot; (Acesso rand&ocirc;mico ao item anterior)
- Caso o item especificado n&atilde;o exista, acessa o item anterior;</FONT>
<P><IMG SRC="Bullet7.gif" width=13 heigth=13>
<FONT SIZE=2>&quot;D&quot; (Pesquisa rand&ocirc;mica por validade
de data).</dir>
<P><IMG SRC="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TS0101-TBLARG</FONT></B><FONT SIZE=2>
- Argumento de pesquisa da tabela via chave prim&aacute;ria.</FONT>
<P>
<FONT SIZE=2>Para iniciar uma pesquisa sequencial, deve-se informar
brancos ou a chave anterior ao primeiro item a ser lido.</FONT>
<P>
<FONT SIZE=2>Caso a tabela tenha especifica&ccedil;&atilde;o de
crit&eacute;rio de valida&ccedil;&atilde;o por data, ela deve
ser informada no formato AAMMDD (ano, m&ecirc;s, dia) no argumento
de pesquisa.</FONT>
<P>
<TABLE BORDER=1>
<TR><TD WIDTH=94><B><FONT SIZE=2 COLOR=#000000>TBLPESQ</FONT></B>
</TD><TD WIDTH=438><B><FONT SIZE=2 COLOR=#000000>TBLARG</FONT></B>
</TD></TR>
<TR><TD WIDTH=94>&quot;S&quot;</TD><TD WIDTH=438>Opcional. A partir da segunda leitura por acesso sequencial, n&atilde;o &eacute; necess&aacute;rio compor novamente os campos da &aacute;rea de comunica&ccedil;&atilde;o.
</TD></TR>
<TR><TD WIDTH=94>&quot;R&quot;</TD><TD WIDTH=438>Obrigat&oacute;rio.
</TD></TR>
<TR><TD WIDTH=94>&quot;C&quot;</TD><TD WIDTH=438>Obrigat&oacute;rio.
</TD></TR>
<TR><TD WIDTH=94>&quot;U&quot;</TD><TD WIDTH=438>N&atilde;o precisa ser informado. O sistema busca o &uacute;ltimo item da tabela. A partir da segunda leitura desta forma de acesso, n&atilde;o &eacute; necess&aacute;rio compor novamente os campos da &aacute;rea de comunica&ccedil;&atilde;o.
</TD></TR>
<TR><TD WIDTH=94>&quot;A&quot;</TD><TD WIDTH=438>Obrigat&oacute;rio. O sistema busca o item especificado. Caso n&atilde;o o encontre, o acesso ser&aacute; feito ao item imediatamente anterior ao informado.
</TD></TR>
<TR><TD WIDTH=94>&quot;P&quot;</TD><TD WIDTH=438>Obrigat&oacute;rio. O sistema busca o item especificado. Caso n&atilde;o o encontre, o acesso ser&aacute; feito ao item imediatamente.
</TD></TR>
</TABLE>
<P><IMG SRC="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TS0101-TBLSTA</FONT></B><FONT SIZE=2>
- Indica o resultado da pesquisa processada.</FONT>
<P>
<FONT SIZE=2>Os valores informados s&atilde;o os seguintes: </FONT>
<P><dir><b>0</b>- Opera&ccedil;&atilde;o efetuada com sucesso;
</FONT>
<P><b>1</b>- Tabela ou item n&atilde;o encontrado, tipo de
pesquisa inv&aacute;lido ou fim de pesquisa.</dir>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TS0101-TBLITEM</FONT></B><FONT SIZE=2>
- Retorna os dados contidos no item pesquisado.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TS0101-CSTIDT</FONT></B><FONT SIZE=2>
- Indicador da chave secund&aacute;ria que ser&aacute; utilizada
no acesso, podendo assumir os valores &quot;B, &quot;C&quot; ou
&quot;D&quot;.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TS0101-CCSARGUM</FONT></B><FONT SIZE=2>
- Argumento para pesquisa via chave secund&aacute;ria.</FONT>
<P>
<FONT SIZE=2>Para iniciar uma&nbsp;pesquisa sequencial, informe
brancos&nbsp;ou a chave anterior ao primeiro item a ser lido,
na chave secund&aacute;ria.</FONT>
<P>
<FONT SIZE=2>Este campo pode ser opcional ou obrigat&oacute;rio,
conforme o tipo de pesquisa - TS0101-TBLPESQ. Ver quadro a seguir:
<BR>
</FONT>
<P>
<TABLE BORDER=1>
<TR><TD WIDTH=94><B><FONT SIZE=2 COLOR=#000000>TBLPESQ</FONT></B>
</TD><TD WIDTH=414><B><FONT SIZE=2 COLOR=#000000>CCSARGUM</FONT></B>
</TD></TR>
<TR><TD WIDTH=94>&quot;S&quot;</TD><TD WIDTH=414>Opcional. A partir da segunda leitura por acesso sequencial, n&atilde;o &eacute; necess&aacute;rio compor os campos da &aacute;rea de comunica&ccedil;&atilde;o.
</TD></TR>
<TR><TD WIDTH=94>&quot;R&quot;</TD><TD WIDTH=414>Informa&ccedil;&atilde;o obrigat&oacute;ria. Se houver v&aacute;rios itens com a chave especificada, o acesso ser&aacute; executado para o primeiro item.
</TD></TR>
<TR><TD WIDTH=94>&quot;C&quot;</TD><TD WIDTH=414>Informa&ccedil;&atilde;o obrigat&oacute;ria. Se o retorno do TS0101-TBLSTA for diferente de zero, significa que nenhum item foi encontrado com o valor da chave secund&aacute;ria especificado.
</TD></TR>
<TR><TD WIDTH=94>&quot;U&quot;</TD><TD WIDTH=414>N&atilde;o informar. O sistema busca o item de maior valor na chave secund&aacute;ria.
</TD></TR>
<TR><TD WIDTH=94>&quot;L&quot;</TD><TD WIDTH=414>Opcional. A partir da segunda leitura, n&atilde;o &eacute; necess&aacute;ria a composi&ccedil;&atilde;o dos campos da &aacute;rea de comunica&ccedil;&atilde;o.
</TD></TR>
<TR><TD WIDTH=94>&quot;A&quot;</TD><TD WIDTH=414>Informa&ccedil;&atilde;o obrigat&oacute;ria. O sistema busca o item especificado. Caso n&atilde;o o encontre, procurar&aacute; ter acesso ao item de chave secund&aacute;ria cujo valor &eacute; imediatamente inferior ao informado.
</TD></TR>
<TR><TD WIDTH=94>&quot;P&quot;</TD><TD WIDTH=414>Informa&ccedil;&atilde;o obrigat&oacute;ria. O sistema busca o item com a chave secund&aacute;ria especificada. Caso n&atilde;o o encontre, procurar&aacute; o item cujo valor da chave secund&aacute;ria &eacute; imediatamente superior ao informado.
</TD></TR>
</TABLE>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TS0101-TABTIPDAT</FONT></B><FONT SIZE=2>
- Crit&eacute;rio&nbsp;de valida&ccedil;&atilde;o por data (1,
2 ou 3) especificado nos par&acirc;metros da tabela (opcional).</FONT>
<P>
<FONT SIZE=2>&Eacute; obrigat&oacute;rio informar somente quando
o tipo de pesquisa for por valida&ccedil;&atilde;o de&nbsp;data
(TS0101-TBLPESQ = &quot;D&quot;).</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TS0101-MENSCOD</FONT></B><FONT SIZE=2>
- C&oacute;digo da mensagem de erro.</FONT>
<P>
<FONT SIZE=2>Toda vez que o acesso n&atilde;o for efetivado, a
sub-rotina preenche este campo com o c&oacute;digo relativo ao
erro ocorrido, que, por sua vez, tem sua descri&ccedil;&atilde;o
na tabela &quot;SSTM5099&quot;. </FONT>
<P>
<FONT SIZE=2>Este c&oacute;digo de erro deve ser utilizado quando
o valor retornado em TS0101-TBLSTA for diferente de zero, caso
em que o acesso n&atilde;o foi completado com &ecirc;xito.</FONT>
<P>
<FONT SIZE=2>A seguir, &eacute; apresentado um exemplo de tratamento
de erro da sub-rotina efetuado por um programa aplicativo:</FONT>
<Pre><FONT SIZE=3>
  IF  TS0101-TBLSTA NOT EQUAL 0 
      MOVE TS0101-MENSCOD TO GBL-MENSCOD 
      MOVE 5              TO GBL-ERRO
      MOVE &quot;SSTM5099&quot;     TO GBL-TBLCOD 
      GO TO 99000-99-EXIT-PROGRAM.
</pre></font>
<P>
<A NAME="Forace"><B><FONT SIZE=4>Formas de acesso aos itens de
uma tabela</FONT></B></A>
<P>
<FONT SIZE=2>O acesso aos itens da tabela pode ser feito de tr&ecirc;s
diferentes formas:</FONT>
<P><dir><img src="Bullet1.gif" width=8 heigth=8>Via chave prim&aacute;ria;</FONT>
<P><img src="Bullet1.gif" width=8 heigth=8>Via chave secund&aacute;ria;</FONT>
<P><img src="Bullet1.gif" width=8 heigth=8>Por validade de data.</dir>
<P>
<FONT SIZE=2>Se uma tabela for definida no reposit&oacute;rio
de dados como recurso de um programa e na l&oacute;gica deste
estiver previsto consulta aos itens desta tabela, todas as declara&ccedil;&otilde;es
e comandos de prepara&ccedil;&atilde;o para acesso aos itens da
mesma ser&atilde;o gerados automaticamente, quais sejam:</FONT>
<P>
<FONT SIZE=2>Na WORKING-STORAGE SECTION:<Pre><FONT SIZE=3>  COPY &quot;ss/s/ML/nn/mm&quot; - <I>Library</I> da tabela.
  COPY &quot;SS/T/SL/01&quot;    - &Aacute;rea de Comunica&ccedil;&atilde;o c/ a sub-rotina.
</Pre></font>
<p><FONT SIZE=2>Na PROCEDURE DIVISION:<Pre><FONT SIZE=3>  MOVE &quot;SS/T/SC/01&quot;                  TO GBL-NOMEXT.
  CHANGE ATTRIBUTE TITLE OF &quot;SSTS01&quot; TO GBL-CHANGE.
</Pre></font>
<FONT SIZE=2>Existem campos da &aacute;rea de comunica&ccedil;&atilde;o
da sub-rotina que, independentemente da forma de acesso aos seus
itens, t&ecirc;m obrigatoriedade de informa&ccedil;&atilde;o,
s&atilde;o eles:<Pre><FONT SIZE=3>   TS0101 - TBLCOD;
   TS0101 - TABAMBI;
   TS0101 - TBLPESQ;
   TS0101 - EMPCOD;
   TS0101 - ETBCOD;
   TS0101 - UNDCOD.
</Pre></font>
<p><FONT SIZE=2>Estes campos devem ser preenchidos conforme descrito
anteriormente no t&oacute;pico &quot;&Aacute;rea de comunica&ccedil;&atilde;o
com a sub-rotina SSTS01&quot; (Library SS/T/SL/01), neste mesmo
item.</FONT>
<P>
<FONT SIZE=2>Os demais campos da &aacute;rea de comunica&ccedil;&atilde;o
dever&atilde;o ser preenchidos de acordo com o tipo de acesso
que ser&aacute; feito aos itens da tabela. Para isso, segue uma
explica&ccedil;&atilde;o detalhada:</FONT>
<P>
<FONT SIZE=2>Todos comandos de movimenta&ccedil;&atilde;o de valores
para os campos da &aacute;rea de comunica&ccedil;&atilde;o com
a sub-rotina devem ser definidos antes de executar acesso aos
seus itens, via SSTS01, que &eacute; gerado pelo SADS atrav&eacute;s
do seguinte comando:</FONT>
<Pre><FONT SIZE=3>  CALL &quot;SSTS01 OF SSTS01&quot; USING SST01-LINKAREA.</FONT></pre>
<P>
<FONT SIZE=2>O tratamento </FONT><I><FONT SIZE=2 COLOR=#000000>default</FONT></I><FONT SIZE=2>
do gerador de programas do SADS que testa o retorno do acesso
aos itens de tabela &eacute; o seguinte:<Pre><FONT SIZE=3>  IF  TS0101-TBLSTA NOT EQUAL 0 
      MOVE SPACES TO TS0101-TBLITEM.</pre></font>
<P>
<FONT SIZE=2>Caso seja necess&aacute;rio enviar uma mensagem de
erro, deve-se proceder conforme exemplifica&ccedil;&atilde;o a
seguir:<Pre><FONT SIZE=3>  IF  TS0101-TBLSTA NOT EQUAL 0 
      MOVE TS0101-MENSCOD       TO GBL-MENSCOD
      MOVE 5                    TO GBL-ERRO
      MOVE &quot;SSTM5099&quot;           TO GBL-TBLCOD
      GO TO 99000-99-EXIT-PROGRAM.</font></pre>
<P>
<A NAME="Acepri"><B><FONT SIZE=2>Acesso via chave prim&aacute;ria</FONT></B></A>
<P>
<FONT SIZE=2>O acesso aos itens de uma tabela via chave prim&aacute;ria
&eacute; executado atrav&eacute;s dos seguintes comandos de composi&ccedil;&atilde;o
dos campos da &aacute;rea de comunica&ccedil;&atilde;o:</FONT>
<Pre><FONT SIZE=3>  MOVE &lt;tabela no padr&atilde;o sssMnnnn&gt;    TO TS0101-TBLCOD.
  MOVE &lt;ambiente ou GBL-USUAMBI&gt;      TO TS0101-TABAMBI.
  MOVE &lt;tipo de pesquisa&gt;             TO TS0101-TBLPESQ.
</Pre></font>
<p>
<FONT SIZE=2>Todos os tipos de pesquisa s&atilde;o v&aacute;lidos,
exceto o tipo &quot;D&quot; que &eacute; reservado para o acesso
por validade de data.</FONT>
<Pre><FONT SIZE=3>  MOVE &lt;empresa ou GBL-EMPCOD&gt;            TO TS0101-EMPCOD.
  MOVE &lt;estabelecimento ou GBL-ETBCOD&gt;    TO TS0101-ETBCOD.
  MOVE &lt;unidade ou GBL-UNDCOD&gt;            TO TS0101-UNDCOD.</pre></font>
<P>
<FONT SIZE=2>Os campos TS0101-EMPCOD, TS0101-ETBCOD e TS0101-UNDCOD
que n&atilde;o se enquadrarem no crit&eacute;rio da tabela que
estiver sendo acessada devem ser preenchidos com zeros.</FONT>
<P>
<A NAME="Acesec"><B><FONT SIZE=2>Acesso via chave secund&aacute;ria</FONT></B></A>
<P>
<FONT SIZE=2>O acesso aos itens de uma tabela via chave secund&aacute;ria
&eacute; executado atrav&eacute;s dos seguintes comandos de composi&ccedil;&atilde;o
dos campos da &aacute;rea de comunica&ccedil;&atilde;o:</FONT>
<Pre><FONT SIZE=3>  MOVE &lt;tabela no padrao sssMnnmm&gt;        TO TS0101-TBLCOD.
  MOVE &lt;ambiente ou GBL-USUAMBI&gt;          TO TS0101-TABAMBI.
  MOVE &lt;tipo de pesquisa&gt;                 TO TS0101-TBLPESQ.
</Pre></font>
<FONT SIZE=2>Todos os tipos de pesquisa s&atilde;o v&aacute;lidos,
exceto o tipo &quot;D&quot; que &eacute; reservado para o acesso
por validade de data.</FONT>
<Pre><FONT SIZE=3>  MOVE &lt;empresa ou GBL-EMPCOD&gt;            TO TS0101-EMPCOD.
  MOVE &lt;estabelecimento ou GBL-ETBCOD&gt;    TO TS0101-ETBCOD.
  MOVE &lt;unidade ou GBL-UNDCOD&gt;            TO TS0101-UNDCOD.
</Pre></font>
<FONT SIZE=2>Os campos TS0101-EMPCOD, TS0101-ETBCOD e TS0101-UNDCOD
que n&atilde;o se enquadrarem no crit&eacute;rio da tabela que
estiver sendo acessada devem ser preenchidos com zeros.</FONT>
<Pre><FONT SIZE=3>  MOVE &lt;identif. da chave secund&aacute;ria (B, C ou D)&gt; 
                                          TO TS0101-CSTIDT.
  MOVE &lt;argumento de pesquisa&gt;            TO TS0101-CCSARGUM.</pre></font>
<P>
<FONT SIZE=2>Este campo deve ser preenchido de acordo com o tipo
de acesso e conforme orienta&ccedil;&atilde;o descrita nteriormente,
neste mesmo t&oacute;pico.</FONT>
<P>
<A NAME="Aceval"><B><FONT SIZE=2>Acesso por validade de data</FONT></B></A>
<P>
<FONT SIZE=2>O cadastramento de validade de itens por data para
tabelas encontra-se descrito no item &quot;Tabelas&quot;, no t&oacute;pico
&quot;Cadastramento dos par&acirc;metros de tabela&quot;, nesta
mesma se&ccedil;&atilde;o.</FONT>
<P>
<FONT SIZE=2>O &uacute;nico tipo de pesquisa com validade de data
&eacute; o rand&ocirc;mico.</FONT>
<P>
<FONT SIZE=2>Nos acessos por valida&ccedil;&atilde;o de data,
a data utilizada como argumento de pesquisa da sub-rotina SSTS01
tem de ser informada no formato AAMMDD (ano, m&ecirc;s,dia).</FONT>
<P>
<FONT SIZE=2>O acesso aos itens de uma tabela por validade de
data &eacute; executado atrav&eacute;s dos seguintes comandos
de composi&ccedil;&atilde;o dos campos da &aacute;rea de comunica&ccedil;&atilde;o:</FONT>
<Pre><FONT SIZE=3>  MOVE &lt;tabela no padr&atilde;o sssMnnmm&gt;       TO TS0101-TBLCOD.
  MOVE &lt;ambiente ou GBL-USUAMBI&gt;         TO TS0101-TABAMBI.
  MOVE &quot;D&quot;                               TO TS0101-TBLPESQ.</pre></font>
<P>
<FONT SIZE=2>O &uacute;nico tipo de pesquisa v&aacute;lido &eacute;
o tipo &quot;D&quot;, acesso rand&ocirc;mico por validade de data.</FONT>
<Pre><FONT SIZE=3>  MOVE &lt;empresa ou GBL-EMPCOD&gt;            TO TS0101-EMPCOD.
  MOVE &lt;estabelecimento ou GBL-ETBCOD&gt;    TO TS0101-ETBCOD.
  MOVE &lt;unidade ou GBL-UNDCOD&gt;            TO TS0101-UNDCOD.</pre></font>
<P>
<FONT SIZE=2>Os campos TS0101-EMPCOD, TS0101-ETBCOD e TS0101-UNDCOD
que n&atilde;o se enquadrarem no crit&eacute;rio da tabela que
estiver sendo acessada devem ser preenchidos comzeros.</FONT>
<Pre><FONT SIZE=3>  MOVE &lt;argumento de pesquisa&gt;            TO TS0101-TBLARG.</FONT></pre>
<P>
<FONT SIZE=2>Como a data faz parte do argumento de pesquisa, ela
deve ser informada no formato AAMMDD e na posi&ccedil;&atilde;o
correta, caso a chave seja composta por outros campos al&eacute;m
daquele destinado &agrave; data.</FONT></dir></dir></dir>
<P>
<A NAME="Tratam"><B><FONT SIZE=5>Sub-rotina para tratamento de
exclus&atilde;o de itens da tabela</FONT></B></A>
<P>
<FONT SIZE=2>As sub-rotinas para tratamento de exclus&atilde;o
de itens s&atilde;o recursos oferecidos com o objetivo de evitar
a exclus&atilde;o indevida de determinados itens da tabela.</FONT>
<P>
<FONT SIZE=2>Esta sub-rotina, quando especificada, ser&aacute;
executada sempre que uma transa&ccedil;&atilde;o de exclus&atilde;o
de itens for solicitada, seja para excluir um item ou uma lista
de itens.</FONT>
<P>
<FONT SIZE=2>Em ambos os casos, as transa&ccedil;&otilde;es de
exclus&atilde;o s&oacute; ser&atilde;o efetuadas se a sub-rotina
assim permitir.</FONT>
<P>
<A NAME="Tratex"><B><FONT SIZE=4>&Aacute;rea de Comunica&ccedil;&atilde;o
com a sub-rotina para tratamento de exclus&atilde;o de itens (Library</FONT></B><FONT SIZE=4 COLOR=#000000>
SS/T/SL/99)</FONT></A>
<P>
<FONT SIZE=2>A &aacute;rea de comunica&ccedil;&atilde;o da sub-rotina
deve ser definida atrav&eacute;s da </FONT><I><FONT SIZE=2 COLOR=#000000>library</FONT></I><FONT SIZE=2>
SS/T/SL/99.</FONT>
<P>
<FONT SIZE=2>A </FONT><I><FONT SIZE=2 COLOR=#000000>library</FONT></I><FONT SIZE=2>
SS/T/SL/99 possui os seguintes campos :</FONT>
<Pre><FONT SIZE=3>  
  10 TS9901-OPCAO         PIC 9(001).
  10 TS9901-USUNIVACES    PIC 9(002).
  10 TS9901-USUNUM        PIC 9(006).
  10 TS9901-UNDUSUSADS    PIC 9(002).
  10 TS9901-TABCOD        PIC X(008).
  10 TS9901-TABAMBI       PIC X(001).
  10 TS9901-EMPCOD        PIC 9(003).
  10 TS9901-ETBCOD        PIC 9(004).
  10 TS9901-UNDCOD        PIC 9(030).
  10 TS9901-ITMARGUM      PIC X(008).
  10 TS9901-ITMCONT       PIC X(300).
  10 TS9901-RESPOSTA      PIC X(030).</pre></font>
<P>
<FONT SIZE=2>A seguir, encontra-se uma explica&ccedil;&atilde;o
resumida sobre o preenchimento de cada um dos campos anteriormente
citados:</FONT>
<P><dir><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TS9901-OPCAO</FONT></B><FONT SIZE=2>
- C&oacute;digo de erro a ser retornado.</FONT>
<P>
<FONT SIZE=2>Caso o item da tabela n&atilde;o possa ser exclu&iacute;do,
a sub-rotina tem de mover 9 (nove) para TS9901-OPCAO. Caso contr&aacute;rio,
deve mover zero.</FONT>
<P>
<FONT SIZE=2>Os programas do Sistema de Tabelas respons&aacute;veis
pelas exclus&otilde;es de itens, ao receberem TS9901-OPCAO igual
a 9, n&atilde;o permitir&atilde;o que a exclus&atilde;o seja efetuada.
Neste caso, ser&aacute; exibida na tela a mensagem de erro contida
no campo TS9901-RESPOSTA.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TS9901-USUNIVACES</FONT></B><FONT SIZE=2>
- N&iacute;vel de acesso do usu&aacute;rio que requisitou a exclus&atilde;o
de item de tabela.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TS9901-USUNUM</FONT></B><FONT SIZE=2>
- N&uacute;mero do usu&aacute;rio que requisitou a exclus&atilde;o
de item de tabela.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TS9901-UNDUSUSADS</FONT></B><FONT SIZE=2>
- Unidade SADS do usu&aacute;rio (campo para utiliza&ccedil;&atilde;o
futura, ser&aacute; preenchido com 01).</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TS9901-TABCOD</FONT></B><FONT SIZE=2>
- C&oacute;digo da tabela para a qual uma exclus&atilde;o de itens
foi requisitada.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TS9901-EMPCOD</FONT></B><FONT SIZE=2>
- C&oacute;digo da empresa na qual o usu&aacute;rio, que requisitou
a exclus&atilde;o do item da tabela, efetuou o </FONT><I><FONT SIZE=2 COLOR=#000000>logon</FONT></I><FONT SIZE=2>.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TS9901-ETBCOD</FONT></B><FONT SIZE=2>
- C&oacute;digo do estabelecimento no qual o usu&aacute;rio, que
requisitou a exclus&atilde;o do item da tabela, efetuou o </FONT><I><FONT SIZE=2 COLOR=#000000>logon</FONT></I><FONT SIZE=2>.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TS9901-UNDCOD</FONT></B><FONT SIZE=2>
- C&oacute;digo da unidade na qual o usu&aacute;rio, que requisitou
a exclus&atilde;o do item da tabela, efetuou o </FONT><I><FONT SIZE=2 COLOR=#000000>logon</FONT></I><FONT SIZE=2>.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TS9901-ITMARGUM</FONT></B><FONT SIZE=2>
- Argumento do item a ser exclu&iacute;do.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TS9901-ITMCONT</FONT></B><FONT SIZE=2>
- Dados do item a ser exclu&iacute;do.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>TS9901-RESPOSTA</FONT></B><FONT SIZE=2>
- Mensagem de erro.</FONT>
<P>
<FONT SIZE=2>Caso o item da tabela n&atilde;o possa ser exclu&iacute;do,
a sub-rotina dever&aacute; compor o campo TS9901-RESPOSTA com
uma mensagem indicando o impedimento.</FONT>
<P>
<FONT SIZE=2>Deve-se atentar para o fato de que os campos TS9901-OPCAO
e TS9901-RESPOSTA s&atilde;o os &uacute;nicos campos que devem
ser compostos pela sub-rotina para retorno ao Sistema de Tabelas.
Os demais s&atilde;o passados para a sub-rotina para que ela possa
executar os testes necess&aacute;rios.</dir>
<P>
<A NAME="Codsub"><B><FONT SIZE=4>Codifica&ccedil;&atilde;o da
sub-rotina para tratamento de exclus&atilde;o de itens</FONT></B></A>
<P>
<FONT SIZE=2>A sub-rotina de tratamento de exclus&atilde;o de
itens de tabela pode ter qualquer c&oacute;digo, desde que esteja
no padr&atilde;o SADS - sssSxn. Deve ser constru&iacute;da pelo
analista respons&aacute;vel pela tabela e ser relacionada &agrave;
mesma no momento da defini&ccedil;&atilde;o de seus par&acirc;metros.</FONT>
<P>
<FONT SIZE=2>Nesta sub-rotina podem ser codificados testes contra
cadastro, testes de habilita&ccedil;&atilde;o de usu&aacute;rio
ou qualquer outro que identifique exclus&otilde;es indesejadas
de itens.</FONT>
<P>
<FONT SIZE=2>Al&eacute;m do c&oacute;digo no padr&atilde;o SADS,
existem outras regras para a sua codifica&ccedil;&atilde;o, quais
sejam:</FONT>
<P><dir>
<img src="Bullet1.gif" width=8 heigth=8>O </FONT><I><FONT SIZE=2 COLOR=#000000>Program-id</FONT></I><FONT SIZE=2>
da sub-rotina tem de ser SSTS99;</FONT>
<P>
<img src="Bullet1.gif" width=8 heigth=8>O nome do fonte da sub-rotina deve ter o formato
ss/s/SF/xn. Como exemplo temos, no sistema &quot;XYZ&quot;, a
sub-rotina &quot;XYZS90&quot;, cujo fonte possui o c&oacute;digo
&quot;XY/Z/SF/90&quot;.</FONT>
<P>
<img src="Bullet1.gif" width=8 heigth=8>A</FONT><I><FONT SIZE=2 COLOR=#000000> library</FONT></I><FONT SIZE=2>
da &aacute;rea de comunica&ccedil;&atilde;o da sub-rotina deve
estar declarada na WORKING-STORAGE SECTION da mesma, atrav&eacute;s
dos seguintes comandos:</FONT>
<Pre><FONT SIZE=3>  01 TS9901-SSTS99 RECEIVED BY REFERENCE. 
  COPY &quot;SS/T/SL/99&quot; FROM 100300 THRU 101700.
</FONT></pre>
<P>
<img src="Bullet1.gif" width=8 heigth=8>Na PROCEDURE DIVISION:</FONT>
<ul type=disc><li>Deve conter comandos USING TS9901-SSTS99;</FONT>
<li>Atrav&eacute;s das informa&ccedil;&otilde;es contidas
na &aacute;rea de comunica&ccedil;&atilde;o, a sub-rotina dever&aacute;
efetuar os testes necess&aacute;rios;</FONT>
<li>Sempre que houver uma condi&ccedil;&atilde;o que
impe&ccedil;a a exclus&atilde;o do item da tabela, a sub-rotina
dever&aacute;:</ul>
<Pre><FONT SIZE=3>  mover 9                         para TS9901-OPCAO e
  mover &lt;a mensagem do erro&gt;      para TS9901-RESPOSTA.</font></pre>
<P>
<FONT SIZE=2>Se os campos forem compostos pela sub-rotina conforme
descri&ccedil;&atilde;o anterior, os programas do Sistema de Tabelas
respons&aacute;veis pelas exclus&otilde;es de itens, ao receberem
TS9901-OPCAO igual a 9, n&atilde;o efetuar&atilde;o a exclus&atilde;o.
Neste caso, ser&aacute; exibida na tela a mensagem de erro contida
no campo TS9901-RESPOSTA.</dir></dir></dir>
<P>
<A NAME="Funver"><B><FONT SIZE=5>Funcionamento das tabelas anteriores
&agrave; vers&atilde;o 3.0</FONT></B></A>
<HR>
<P>
<FONT SIZE=2>No momento da instala&ccedil;&atilde;o do SADS, as
tabelas cadastradas nas vers&otilde;es anteriores &agrave; 3.0
foram convertidas diretamente para teste e produ&ccedil;&atilde;o
sem passar pelos processos normais de libera&ccedil;&atilde;o.</FONT>
<P>
<FONT SIZE=2>Apesar dos itens destas tabelas poderem ser mantidos
normalmente e do acesso poder ser feito via sub-rotina SSTS01,
a utiliza&ccedil;&atilde;o das fun&ccedil;&otilde;es de apoio
de tabelas, duplica&ccedil;&atilde;o, c&oacute;pia de itens entre
ambientes e transfer&ecirc;ncia de tabelas, e as manuten&ccedil;&otilde;es
no desenho ou nos par&acirc;metros ficam bloqueadas.</FONT>
<P>
<FONT SIZE=2>Estas tabelas podem ser identificadas pelo processo
de consulta &agrave;s tabelas do sistema, atrav&eacute;s do </FONT><I><FONT SIZE=2 COLOR=#000000>status</FONT></I><FONT SIZE=2>
&quot;A LIBERAR&quot;.</FONT>
<P>
<FONT SIZE=2>Para que estas tabelas voltem a ser tratadas normalmente,
elas dever&atilde;o ser submetidas a uma libera&ccedil;&atilde;o
complementar para os dois ambientes. S&oacute; assim o Sistema
de Tabelas regularizar&aacute; a situa&ccedil;&atilde;o ou </FONT><I><FONT SIZE=2 COLOR=#000000>status</FONT></I><FONT SIZE=2>
das mesmas.</FONT>
<P>
<FONT SIZE=2>No momento da libera&ccedil;&atilde;o, ser&aacute;
criado o</FONT><I><FONT SIZE=2 COLOR=#000000> layout</FONT></I><FONT SIZE=2>
da tabela, que &eacute; uma estrutura imprescind&iacute;vel para
as fun&ccedil;&otilde;es de reorganiza&ccedil;&atilde;o de itens
e utiliza&ccedil;&atilde;o de chaves secund&aacute;rias, facilidades
estas introduzidas na vers&atilde;o 3.0.</FONT>
<P>
<FONT SIZE=2>Os procedimentos para regularizar uma tabela convertida
automaticamente de vers&otilde;es anteriores s&atilde;o os seguintes:</FONT>
<ol type=1><li> Verificar a compatibilidade entre a estrutura
da tabela definida no reposit&oacute;rio de dados e o desenho.</FONT>
<li> Acionar a altera&ccedil;&atilde;o dos par&acirc;metros
e desenho da tabela. Na realidade esta opera&ccedil;&atilde;o
n&atilde;o permite altera&ccedil;&atilde;o no desenho, mas apenas
a confirma&ccedil;&atilde;o dos par&acirc;metros apresentados
sem nenhuma modifica&ccedil;&atilde;o.</FONT>
<P>
<FONT SIZE=2>Ao acionar esta fun&ccedil;&atilde;o, ser&aacute;
criada uma tabela no ambiente de manuten&ccedil;&atilde;o, id&ecirc;ntica
&agrave;quela do ambiente de teste ou produ&ccedil;&atilde;o,
para que possa posteriormente sofrer uma nova libera&ccedil;&atilde;o.</FONT>
<P>
<FONT SIZE=2>Ap&oacute;s confirmar a altera&ccedil;&atilde;o dos
par&acirc;metros, n&atilde;o ser&aacute; permitida uma nova altera&ccedil;&atilde;o
at&eacute; que a tabela de manuten&ccedil;&atilde;o seja liberada
para o ambiente de teste.</FONT>
<li> Liberar a tabela para o ambiente de teste e posteriormente
para o de produ&ccedil;&atilde;o.</FONT>
<P>
<FONT SIZE=2>Ap&oacute;s a libera&ccedil;&atilde;o, ser&aacute;
exibida a mensagem &quot;Tabela liberada sem a organiza&ccedil;&atilde;o
anterior&quot;. A partir deste momento, a tabela adquire o </FONT><I><FONT SIZE=2 COLOR=#000000>status</FONT></I><FONT SIZE=2>
normal e pode ser utilizada em todas as fun&ccedil;&otilde;es
do Sistema Gerenciador de Tabelas, incluindo as fun&ccedil;&otilde;es
de apoio.</Ol>
<P>
<A NAME="Robatc"><B><FONT SIZE=5>Composi&ccedil;&atilde;o das
rotinas batch</FONT></B></A>
<HR>
<P>
<A NAME="Tabsol"><B><FONT SIZE=4>Extra&ccedil;&atilde;o de arquivos
para transfer&ecirc;ncia das tabelas solicitadas - JOB SS/T/JB/01
e SR/B/JF/22</FONT></B></A>
<P>
<TABLE BORDER=3>
<TR><TD WIDTH=98>PROGRAMA</TD><TD WIDTH=138>N O M E</TD><TD WIDTH=111>PARAMETRO
</TD><TD WIDTH=91>ENTRADA</TD><TD WIDTH=132>SAIDA</TD></TR>
<TR><TD WIDTH=98>SS/T/PC/11</TD><TD WIDTH=138>Ext. Desenho</TD>
<TD WIDTH=111>&quot;Arquivo 1&quot;</TD><TD WIDTH=91>SDDB01</TD>
<TD WIDTH=132>SS/T/AW/53</TD></TR>
<TR><TD WIDTH=98>SS/T/PC/12</TD><TD WIDTH=138>Ext.Itens</TD><TD WIDTH=111>&quot;Arquivo 1&quot;
</TD><TD WIDTH=91>SDDB01</TD><TD WIDTH=132>SS/T/AW/55</TD></TR>
<TR><TD WIDTH=98>SS/T/PC/13</TD><TD WIDTH=138>Ext. <I><FONT SIZE=2 COLOR=#000000>layout</FONT></I>
</TD><TD WIDTH=111>&quot;Arquivo 1&quot;</TD><TD WIDTH=91>SDDB01
</TD><TD WIDTH=132>SS/T/AW/56</TD></TR>
<TR><TD WIDTH=98>SS/T/PC/18</TD><TD WIDTH=138>Dele&ccedil;&atilde;o Solicita&ccedil;&otilde;es
</TD><TD WIDTH=111>&quot;Arquivo 1&quot;</TD><TD WIDTH=91>SDDB01
</TD><TD WIDTH=132>SDDB01</TD></TR>
<TR><TD WIDTH=98>SS/C/PC/72</TD><TD WIDTH=138>Ext. de consist&ecirc;ncias
</TD><TD WIDTH=111>&quot;Arquivo 2&quot;</TD><TD WIDTH=91>SDDB01
</TD><TD WIDTH=132>SS/C/AW/71/TAB SS/C/AW/72/TAB</TD></TR>
</TABLE>
<P>
Na coluna &quot;PARAMETRO&quot;, &quot;Arquivo n&quot; indica
que o par&acirc;metro &eacute; passado por via de um arquivo (&quot;DATA
sssAnn&quot;).
<P><ul type=square><li> Para &quot;Arquivo 1&quot; - DATA SSTA60 - deve-se informar &quot;01&quot;
para extrair todas as tabelas, onde:
<P><b>01</b> - &eacute; uma constante.
<li>Para &quot;Arquivo2&quot; - DATA SSCA90 - deve-se informar &quot;01bbbbbbbbM&quot;
para extrair todas as consist&ecirc;ncias das tabelas solicitadas,
onde:
<P><b>01</b> - &eacute; uma constante;
<P><b>bbbbbbbb</b> - s&atilde;o oito posi&ccedil;&otilde;es em branco;
<P><b>M</b> - &eacute; uma constante.</ul>
<P>
<I><B><FONT SIZE=2 COLOR=#000000>Relat&oacute;rio:</FONT></B></I>
<dir>SSTR04 - Relat&oacute;rio das tabelas extra&iacute;das</dir>
<P>
<A NAME="Carga"><B><FONT SIZE=4>Carga das tabelas extra&iacute;das
via solicita&ccedil;&atilde;o - JOB SS/T/JB/02 e SR/B/JF/23</FONT></B></A>
<P>
<TABLE BORDER=2>
<TR><TD WIDTH=94>PROG.</TD><TD WIDTH=131>N O M E</TD><TD WIDTH=106>PARAMETRO
</TD><TD WIDTH=158>ENTRADA</TD><TD WIDTH=85>SAIDA</TD></TR>
<TR><TD WIDTH=94>SS/T/PC/14</TD><TD WIDTH=131>Gerenciador de carga
</TD><TD WIDTH=106>----</TD><TD WIDTH=158>SS/T/AW/53 SS/T/AW/55 SS/T/AW/56
</TD><TD WIDTH=85>SDDB01</TD></TR>
<TR><TD WIDTH=94>SS/T/PC/15</TD><TD WIDTH=131>Carga desenho</TD>
<TD WIDTH=106>----</TD><TD WIDTH=158>SS/T/AW/53</TD><TD WIDTH=85>SDDB01
</TD></TR>
<TR><TD WIDTH=94>SS/T/PC/16</TD><TD WIDTH=131>Carga de <I><FONT SIZE=2 COLOR=#000000>layout</FONT></I>
</TD><TD WIDTH=106>----</TD><TD WIDTH=158>SS/T/AW/56</TD><TD WIDTH=85>SDDB01
</TD></TR>
<TR><TD WIDTH=94>SS/T/PC/17</TD><TD WIDTH=131>Carga de itens dados
</TD><TD WIDTH=106>----</TD><TD WIDTH=158>SS/T/AW/55</TD><TD WIDTH=85> &nbsp;&nbsp;&nbsp;&nbsp;  
  </TD></TR>
<TR><TD WIDTH=94>SS/T/PC/19</TD><TD WIDTH=131>Exclus&atilde;o de controles
</TD><TD WIDTH=106>----</TD><TD WIDTH=158> &nbsp;&nbsp;&nbsp;&nbsp; </TD><TD WIDTH=85> &nbsp;&nbsp;&nbsp;&nbsp; </TD>
</TR>
<TR><TD WIDTH=94>SS/C/PC/73</TD><TD WIDTH=131>Carga de consist&ecirc;ncias
</TD><TD WIDTH=106>----</TD><TD WIDTH=158>SS/C/AW/71/TAB SS/C/AW/72/TAB
</TD><TD WIDTH=85>SDDB01</TD></TR>
</TABLE>
<P>
<I><B><FONT SIZE=2 COLOR=#000000>Relat&oacute;rios:</FONT></B></I>
<dir>SSTR03 - Relat&oacute;rio de tabelas n&atilde;o carregadas
e motivos;</FONT>
<P>
<FONT SIZE=2>SSTR06 - Relat&oacute;rio das tabelas carregadas.</dir>
<P>
<A NAME="Extra"><B><FONT SIZE=4>Extra&ccedil;&atilde;o de tabelas
para transfer&ecirc;ncia sem solicita&ccedil;&atilde;o - JOB SS/T/JB/11
e SR/B/JF/03</FONT></B></A>
<P>
<TABLE BORDER=1>
<TR><TD WIDTH=116>PROGRAMA</TD><TD WIDTH=116>N O M E</TD><TD WIDTH=116>PARAMETRO
</TD><TD WIDTH=116>ENTRADA</TD><TD WIDTH=116>SAIDA</TD></TR>
<TR><TD WIDTH=116>SS/T/PC/31</TD><TD WIDTH=116>Ext. Par&acirc;metros
</TD><TD WIDTH=116>&quot;Arquivo 1&quot;</TD><TD WIDTH=116>SDDB01
</TD><TD WIDTH=116>ss/s/SS/T/AF/53</TD></TR>
<TR><TD WIDTH=116>SS/T/PC/32</TD><TD WIDTH=116>Ext. Itens</TD>
<TD WIDTH=116>&quot;Arquivo 1&quot;</TD><TD WIDTH=116>SDDB01</TD>
<TD WIDTH=116>ss/s/SS/T/AF/55</TD></TR>
<TR><TD WIDTH=116>SS/T/PC/33</TD><TD WIDTH=116>Ext. <I><FONT SIZE=2 COLOR=#000000>layout</FONT></I>
</TD><TD WIDTH=116>&quot;Arquivo 1&quot;</TD><TD WIDTH=116>SDDB01
</TD><TD WIDTH=116>ss/s/SS/T/AF/56</TD></TR>
</TABLE>
<P>
Na coluna &quot;PARAMETRO&quot;, &quot;Arquivo n&quot; indica
que o par&acirc;metro &eacute; passado por via de um arquivo (&quot;DATA
sssAnn&quot;).
<ul type=disc><li>Para &quot;Arquivo 1&quot; - DATA SSTA60 - deve-se informar o
seguinte:
Para extrair uma tabela espec&iacute;fica: &quot;01sssMnnnn&quot;,
onde:
<p><b>01</b> - &eacute; uma constante;
<p><b>sss</b> - &eacute; o c&oacute;digo do sistema;
<p><b>M</b> - &eacute; a constante do elemento tabela e,
<p><b>nnnn</b> - &eacute; o c&oacute;digo identificador da tabela.
<p>Para extrair todas as tabelas de um sistema: &quot;01sss&quot;,
onde:
<p><b>01</b> - &eacute; uma constante;
<p><b>sss</b> - &eacute; o c&oacute;digo do sistema.
<p>Para extrair todas as tabelas: &quot;01&quot;, que &eacute; uma
constante.
</ul>
<P>
<A NAME="Cartran"><B><FONT SIZE=4>Carga de tabelas extra&iacute;das
para transfer&ecirc;ncia sem solicita&ccedil;&atilde;o - JOB SS/T/JB/12
e SR/B/JF/04</FONT></B></A>
<P>
<TABLE BORDER=1>
<TR><TD WIDTH=101>PROG.</TD><TD WIDTH=156>N O M E</TD><TD WIDTH=113>PARAMETRO
</TD><TD WIDTH=98>ENTRADA</TD><TD WIDTH=98>SAIDA</TD></TR>
<TR><TD WIDTH=101>SS/T/PC/15</TD><TD WIDTH=156>Carga de par&acirc;metros 
</TD><TD WIDTH=113>---</TD><TD WIDTH=98>SS/T/AF/53</TD><TD WIDTH=98>SDDB01
</TD></TR>
<TR><TD WIDTH=101>SS/T/PC/16</TD><TD WIDTH=156>Carga de <I><FONT SIZE=2 COLOR=#000000>layout</FONT></I>
</TD><TD WIDTH=113>---</TD><TD WIDTH=98>SS/T/AF/56</TD><TD WIDTH=98>SDDB01
</TD></TR>
<TR><TD WIDTH=101>SS/T/PC/17</TD><TD WIDTH=156>Carga de itens de dados
</TD><TD WIDTH=113>---</TD><TD WIDTH=98>SS/T/AF/55</TD><TD WIDTH=98>SDDB01
</TD></TR>
</TABLE>
<P>
<A NAME="Delsis"><B><FONT SIZE=4>Dele&ccedil;&atilde;o de sistema
ou tabela em um ambiente espec&iacute;fico - JOB SSTJ34 e SR/B/JF/21</FONT></B></A>
<P>
<TABLE BORDER=1>
<TR><TD WIDTH=103>PROGRAMA</TD><TD WIDTH=287>PAR&Acirc;METROS
</TD></TR>
<TR><TD WIDTH=103>SSTP34</TD><TD WIDTH=287>01 + SISTEMA OU TABELA + AMBIENTE PARA DELE&Ccedil;&Atilde;O
</TD></TR>
</TABLE>
<P>
<A NAME="Delec"><B><FONT SIZE=4>Dele&ccedil;&atilde;o de tabelas
SADS do ambiente de testes - JOB SSTJ35</FONT></B></A>
<P>
<FONT SIZE=2>Programa: SSTP35.</FONT>
<P>
<A NAME="Forma"><B><FONT SIZE=5>Formata&ccedil;&atilde;o de arquivo
com itens de dados para carga em tabelas</FONT></B></A>
<P>
<FONT SIZE=2>&Eacute; poss&iacute;vel carregar informa&ccedil;&otilde;es
em tabelas cadastradas no SADS atrav&eacute;s da execu&ccedil;&atilde;o
do job SS/T/JB/13, evitando o trabalho de inclu&iacute;-los de
forma unit&aacute;ria atrav&eacute;s do Gerenciador de Tabelas.</FONT>
<P>
<FONT SIZE=2>Este </FONT><I><FONT SIZE=2 COLOR=#000000>job</FONT></I><FONT SIZE=2>
tem a finalidade de extrair e carregar dados externos no Sistema
de Tabelas do SADS. Para isto &eacute; necess&aacute;rio extrair
a representa&ccedil;&atilde;o f&iacute;sica - programa SS/T/PC/33
- e os par&acirc;metros - programa SS/T/PC/31 - da tabela desejada.
Ap&oacute;s isto, carregar a representa&ccedil;&atilde;o f&iacute;sica
- programa SS/T/PC/16, os par&acirc;metros - programa SS/T/PC/15
- e os itens de dados - programa SS/T/PC/17. Tamb&eacute;m s&atilde;o
executados neste </FONT><I><FONT SIZE=2 COLOR=#000000>job</FONT></I><FONT SIZE=2>
os programas SS/T/PC/14 e SS/T/PC/19 para cria&ccedil;&atilde;o
e remo&ccedil;&atilde;o de registros de controle de execu&ccedil;&atilde;o
do </FONT><I><FONT SIZE=2 COLOR=#000000>job</FONT></I><FONT SIZE=2>,
respectivamente.</FONT>
<P>
<FONT SIZE=2>Para carregar a representa&ccedil;&atilde;o f&iacute;sica
e os par&acirc;metros, deve-se utilizar os arquivos gerados na
extra&ccedil;&atilde;o. Para carregar os itens, deve-se utilizar
o arquivo SS/T/AF/55 que deve ter sido gerado contendo os dados
que ser&atilde;o carregados no Sistema de Tabelas. </FONT>
<P>
<FONT SIZE=2>Tabelas que possuem chaves secund&aacute;rias n&atilde;o
podem ter itens externos carregados. Caso a tabela a ser carregada
necessite de chaves secund&aacute;rias, elas devem ser especificadas
ap&oacute;s a carga dos itens e assim, ser&atilde;o geradas atrav&eacute;s
do processo de reorganiza&ccedil;&atilde;o.</FONT>
<P>
<FONT SIZE=2>A tabela na qual os itens ser&atilde;o agregados
j&aacute; deve existir no SADS no ambiente &quot;T&quot; ou &quot;P&quot;,
dependendo do ambiente definido nos itens do arquivo formatado.</FONT>
<P>
<FONT SIZE=2>&Eacute; aconselh&aacute;vel inicializar os campos
do arquivo com preenchimento opcional (n&atilde;o obrigat&oacute;rio)
com branco e zero, respectivamente, para os campos de formato
alfanum&eacute;rico e num&eacute;rico.</FONT>
<P>
<FONT SIZE=2>Deve-se atentar para a composi&ccedil;&atilde;o dos
campos num&eacute;ricos que s&atilde;o compactados na formata&ccedil;&atilde;o
do arquivo. </FONT>
<P>
<FONT SIZE=2>Para evitar o erro de efetuar a extra&ccedil;&atilde;o
e carga de tabela com programas de vers&otilde;es diferentes e
incompat&iacute;veis, &eacute; feita uma verifica&ccedil;&atilde;o
do </FONT><I><FONT SIZE=2 COLOR=#000000>release-id </FONT></I><FONT SIZE=2>do
arquivo que cont&eacute;m os dados a serem carregados. Devido
a esta verifica&ccedil;&atilde;o, antes de carregar informa&ccedil;&otilde;es
em tabelas cadastradas no SADS atrav&eacute;s da execu&ccedil;&atilde;o
do programa </FONT><I><FONT SIZE=2 COLOR=#000000>batch </FONT></I><FONT SIZE=2>SS/T/PC/17,
deve-se alterar o </FONT><I><FONT SIZE=2 COLOR=#000000>release</FONT></I><FONT SIZE=2>-</FONT><I><FONT SIZE=2 COLOR=#000000>id</FONT></I><FONT SIZE=2>
do arquivo SS/T/AF/55 a ser carregado, atrav&eacute;s do seguinte
comando:</FONT>
<Pre><font size=3><B>  ALTER &lt;arquivo de carga&gt;(RELEASEID = &quot;SADS/3-2&quot;).</B></font></pre>
<P>
<FONT SIZE=2>Para efetuar a carga, &eacute; necess&aacute;rio
que as informa&ccedil;&otilde;es estejam formatadas de acordo
com o </FONT><I><FONT SIZE=2 COLOR=#000000>layout</FONT></I><FONT SIZE=2>
do arquivo SSTA55.</FONT>
<P>
<FONT SIZE=2>Para formatar um grupo de itens conforme as caracter&iacute;sticas
do arquivo SSTA55, os campos da </FONT><I><FONT SIZE=2 COLOR=#000000>library</FONT></I><FONT SIZE=2>
SS/T/AL/55, de preenchimento obrigat&oacute;rio, devem ser compostos
na seguinte ordem:</FONT>
<P><dir><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>T5501F-TPREGISTRO PIC 9(02) COMP</FONT></B><FONT SIZE=2>
- Mover o tipo de registro do item da tabela, conforme o seu tamanho
(sem considerar o tamanho do argumento de pesquisa): </FONT>
<P><dir>De 001 a 050 TIPO &quot;01&quot;, de 051 a 100 TIPO
&quot;02&quot;, de 101 a 150 TIPO &quot;03&quot;, de 151 a 200
TIPO &quot;04&quot;, de 201 a 250 TIPO &quot;05&quot;, de 251
a 300 TIPO &quot;06&quot;.</Dir>
<P>
<FONT SIZE=2>A composic&atilde;o incorreta deste campo pode ocasionar
erros no acesso &agrave; tabela.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>T5501F-HDRDATA PIC 9(06) COMP</FONT></B><FONT SIZE=2>
- Mover a data da atualiza&ccedil;&atilde;o;</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>T5501F-HDRHORA PIC 9(06) COMP</FONT></B><FONT SIZE=2>
- Mover a hora da atualiza&ccedil;&atilde;o;</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>T5501F-HDRESTACAO PIC 9(03) COMP</FONT></B><FONT SIZE=2>
- Mover a esta&ccedil;&atilde;o da atualiza&ccedil;&atilde;o;</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>FILLER PIC 9(01) COMP</FONT></B><FONT SIZE=2>
- Mover zeros; </FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>T5501F-HDRPROGRAMA PIC X(06)</FONT></B><FONT SIZE=2>
- Mover c&oacute;digo programa de carga - SSTP17.</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>T5501F-HDRSTATGER PIC 9(01</FONT></B><FONT SIZE=2>)
- Mover 01 para este </FONT><I><FONT SIZE=2 COLOR=#000000>status;</FONT></I>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>T5501F-UNDUSUSADS PIC 9(02) COMP</FONT></B><FONT SIZE=2>
- Mover 01 para este campo;</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>T5501F-TABCOD PIC X(08)</FONT></B><FONT SIZE=2>
- Mover o c&oacute;digo da tabela no padr&atilde;o SADS (sssMnnnn);</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>T5501F-TABAMBI PIC X(01)</FONT></B><FONT SIZE=2>
- Mover o ambiente da tabela na qual os itens ser&atilde;o carregados
(&quot;T&quot; ou &quot;P&quot;);</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>T5501F-EMPCOD PIC 9(03) COMP</FONT></B><FONT SIZE=2>
- Mover zeros, caso a tabela n&atilde;o possua crit&eacute;rio
de unidade de armazenamento ou mover o c&oacute;digo da empresa
cujos itens ser&atilde;o inclu&iacute;dos;</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>T5501F-ETBCOD PIC 9(04) COMP</FONT></B><FONT SIZE=2>
- Mover zeros,caso a tabela n&atilde;o possua crit&eacute;rio
de unidade de armazenamento ou mover o c&oacute;digo do estab.
cujos itens ser&atilde;o inclu&iacute;dos;</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>T5501F-UNDCOD PIC 9(03) COMP</FONT></B><FONT SIZE=2>
- Mover zeros,caso a tabela n&atilde;o possua crit&eacute;rio
de unidade de armazenamento ou mover o c&oacute;digo da unidade
cujos itens ser&atilde;o inclu&iacute;dos;</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>T5501F-ITMARGUM PIC X(30)</FONT></B><FONT SIZE=2>
- Mover o argumento (a chave de pesquisa) do item. Seu tamanho
&eacute; limitado em 30 </FONT><I><FONT SIZE=2 COLOR=#000000>bytes</FONT></I><FONT SIZE=2>;</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>T5501F-TABTIPDAT PIC 9(01) COMP</FONT></B><FONT SIZE=2>
- Mover zero caso n&atilde;o tenha crit&eacute;rio de valida&ccedil;&atilde;o
por data ou o c&oacute;digo do crit&eacute;rio de valida&ccedil;&atilde;o
por data desejado (&quot;1&quot;, &quot;2&quot; ou &quot;3&quot;).</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>FILLER PIC 9(01) COMP</FONT></B><FONT SIZE=2>
- Mover zeros; </FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>T5501F-ITMCONT PIC X(300)</FONT></B><FONT SIZE=2>
- Mover o conte&uacute;do de cada item da tabela, exceto o seu
argumento. Seu tamanho &eacute; limitado em 300 </FONT><I><FONT SIZE=2 COLOR=#000000>bytes</FONT></I><FONT SIZE=2>;</FONT>
<P><img src="Bullet5.gif" width=13 heigth=13>
<B><FONT SIZE=2 COLOR=#000000>FILLER PIC X(16)</FONT></B><FONT SIZE=2>
- Mover espa&ccedil;os.</FONT>
</BODY>
</HTML>
