<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft Word 97">
<TITLE>Usuários e habilitações</TITLE>
<META NAME="Template" CONTENT="J:\MSOFFICE\OFFICE\html.dot">
</HEAD>
<BODY LINK="#0000ff" VLINK="#800080" BACKGROUND="DOC_B.GIF">

<B><FONT SIZE=6><P><A NAME="Usuhab">Usu&aacute;rios e habilita&ccedil;&otilde;es</A></B></FONT> </P>
<P><HR></P>
<B><FONT SIZE=5><P><A NAME="Intro">Introdu&ccedil;&atilde;o</A></B></FONT> </P>
<P><HR></P>
<FONT SIZE=2><P>O cadastro de usu&aacute;rios do Sistema de Seguran&ccedil;a &eacute; composto basicamente de quatro tipos de informa&ccedil;&otilde;es, a saber:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Os dados dos usu&aacute;rios, que s&atilde;o informa&ccedil;&otilde;es espec&iacute;ficas e que n&atilde;o dependem de aplicativos ou transa&ccedil;&otilde;es aos quais eles podem obter acesso, tais como n&uacute;mero, senha, nome, c&oacute;digo externo, empresa, &aacute;rea, unidades autorizadas, etc.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>As habilita&ccedil;&otilde;es de aplicativos, que determinam com quais aplicativos os usu&aacute;rios podem trabalhar.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>As habilita&ccedil;&otilde;es de transa&ccedil;&otilde;es, que determinam a quais transa&ccedil;&otilde;es, em cada um dos aplicativos anteriormente habilitados, os usu&aacute;rios podem obter acesso.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>As habilita&ccedil;&otilde;es de elementos, que determinam com quais elementos (valores de campos) os usu&aacute;rios poder&atilde;o trabalhar em um aplicativo ou lista de elementos.</FONT> </P></DIR>

<FONT SIZE=2><P>Para identifica&ccedil;&atilde;o de aplicativos, o Sistema de Seguran&ccedil;a segue os padr&otilde;es explicados na Se&ccedil;&atilde;o I, "Requisitos e conceitos para utiliza&ccedil;&atilde;o do SADS". </P>
<P>J&aacute; a codifica&ccedil;&atilde;o de listas de elementos ou elementos n&atilde;o segue nenhum padr&atilde;o, sendo determinada de acordo com a necessidade e especifica&ccedil;&atilde;o do aplicativo que os utilizar&aacute;.</FONT> </P>
<FONT SIZE=2><P>Maiores detalhes sobre esta identifica&ccedil;&atilde;o de listas de elementos e elementos est&atilde;o descritos no t&oacute;pico "N&iacute;veis de Seguran&ccedil;a dispon&iacute;veis", nesta se&ccedil;&atilde;o. </P>
</FONT><B><FONT SIZE=4><P>Respons&aacute;veis pelos cadastramentos</B></FONT> </P>
<FONT SIZE=2><P>As opera&ccedil;&otilde;es de manuten&ccedil;&atilde;o no cadastro e habilita&ccedil;&otilde;es dos usu&aacute;rios s&oacute; podem ser efetuadas pelo administrador de seguran&ccedil;a, n&iacute;vel de acesso 99, ou por usu&aacute;rios por ele devidamente habilitados, que devem possuir n&iacute;vel de acesso 98, denominados subadministradores de seguran&ccedil;a.</FONT> </P>
<FONT SIZE=2><P>Aos administradores de seguran&ccedil;a &eacute; permitido executar qualquer fun&ccedil;&atilde;o do Sistema de Seguran&ccedil;a, desde que esteja habilitado ao aplicativo e transa&ccedil;&atilde;o correspondentes.</FONT> </P>
<FONT SIZE=2><P>Para que um usu&aacute;rio de n&iacute;vel de acesso 98 possa efetuar manuten&ccedil;&otilde;es no cadastro e nas habilita&ccedil;&otilde;es de outros usu&aacute;rios, ele deve possuir as seguintes habilita&ccedil;&otilde;es e atender aos seguintes requisitos:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Todas as habilita&ccedil;&otilde;es a serem por ele cadastradas ou alteradas devem possuir unidades autorizadas (empresa, estabelecimento e unidade) iguais ou compat&iacute;veis &agrave;s suas, da seguinte forma:</FONT> </P></DIR>

<FONT SIZE=2><P>Caso o usu&aacute;rio de n&iacute;vel de acesso 98 possua unidades autorizadas gen&eacute;ricas (iguais a 9's), ent&atilde;o ele poder&aacute; efetuar manuten&ccedil;&otilde;es em habilita&ccedil;&otilde;es definidas em quaisquer unidades autorizadas, excetuando-se aquelas que n&atilde;o possuam unidades autorizadas cadastradas (iguais a brancos ou zeros );</FONT> </P>
<FONT SIZE=2><P>Caso o usu&aacute;rio de n&iacute;vel de acesso 98 possua unidades autorizadas espec&iacute;ficas, ent&atilde;o ele poder&aacute; efetuar manuten&ccedil;&otilde;es somente nas habilita&ccedil;&otilde;es definidas nestas mesmas unidades autorizadas;</FONT> </P>
<FONT SIZE=2><P>Caso o usu&aacute;rio de n&iacute;vel de acesso 98 n&atilde;o possua unidades autorizadas cadastradas (iguais <BR>
a brancos ou zeros ), ent&atilde;o ele poder&aacute; efetuar manuten&ccedil;&otilde;es somente naquelas habilita&ccedil;&otilde;es<BR>
que tamb&eacute;m n&atilde;o possu&iacute;rem unidades autorizadas informadas.</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>As unidades autorizadas do usu&aacute;rio afetado pela opera&ccedil;&atilde;o - altera&ccedil;&atilde;o, exclus&atilde;o, duplica&ccedil;&atilde;o, troca de senha, etc - devem ser compat&iacute;veis &agrave;s suas.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Ele n&atilde;o poder&aacute; cadastrar ou alterar o cadastramento de um outro usu&aacute;rio que possua n&iacute;vel de acesso 99 - Administrador de Seguran&ccedil;a -, o que somente poder&aacute; ser feito por outro usu&aacute;rio de n&iacute;vel de acesso 99.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Ele n&atilde;o poder&aacute; alterar seu pr&oacute;prio cadastramento ou suas pr&oacute;prias habilita&ccedil;&otilde;es.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Para que possa efetuar manuten&ccedil;&atilde;o no cadastro de um segundo usu&aacute;rio de n&iacute;vel de acesso menor que 98 - altera&ccedil;&atilde;o, exclus&atilde;o, duplica&ccedil;&atilde;o, troca de senha, etc -, ele dever&aacute; possuir todos os aplicativos que estiverem habilitados ao usu&aacute;rio definidos como elemento,na lista de elementos "SBT" ou "SBT01", com tipo de habilita&ccedil;&atilde;o igual a "2" (Atualizar). A &uacute;nica exce&ccedil;&atilde;o se faz na opera&ccedil;&atilde;o de libera&ccedil;&atilde;o de usu&aacute;rio, que o sub-administrador estar&aacute; habilitado a process&aacute;-la independentemente de suas habilita&ccedil;&otilde;es e das habilita&ccedil;&otilde;es dos usu&aacute;rios alvos da opera&ccedil;&atilde;o.</P>
</FONT><P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Para que possa habilitar elementos a um outro usu&aacute;rio, ele j&aacute; deve possuir igual habilita&ccedil;&atilde;o de elemento.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Para que possa habilitar um determinado aplicativo a um segundo usu&aacute;rio, o subadministrador de seguran&ccedil;a dever&aacute; possuir tal aplicativo habilitado como elemento, na lista de elementos "SBT" ou "SBT01", com tipo de habilita&ccedil;&atilde;o igual a "2" (Atualizar). </P>
<P>Caso o usu&aacute;rio a ser por ele habilitado possua tamb&eacute;m n&iacute;vel de acesso 98, ent&atilde;o este tipo de habilita&ccedil;&atilde;o deve ser "9" (Habilitar outro usu&aacute;rio 98). </P>
<P>S&oacute; um administrador de seguran&ccedil;a possui autoriza&ccedil;&atilde;o para especificar "9" no tipo de habilita&ccedil;&atilde;o e, assim mesmo, somente para um usu&aacute;rio 98 e apenas quando a lista de elementos for a "SBT" ou "SBT01".</FONT> </P>
<FONT SIZE=2><P>Como exemplo, para que o usu&aacute;rio de n&iacute;vel de acesso 98 possa autorizar um outro usu&aacute;rio a utilizar o aplicativo "GLH04", ele deve possuir a seguinte habilita&ccedil;&atilde;o de elemento:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><B><FONT SIZE=2>Aplicativo/Lista de Elementos</B>: "SBT" ou "SBT01"</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><B><FONT SIZE=2>Elemento</B>: "GLH04" ou "GLH" ou "GL" ou "G" ou " " (brancos)</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><B><FONT SIZE=2>Tipo da habilita&ccedil;&atilde;o</B>: 2</FONT> </P></DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Para que possa habilitar uma transa&ccedil;&atilde;o de um aplicativo a um segundo usu&aacute;rio, o subadministrador de seguran&ccedil;a dever&aacute; possuir tal aplicativo habilitado como elemento, na lista de elementos "SBT" ou "SBT01", com tipo de habilita&ccedil;&atilde;o igual a "2" (Atualizar). </P>
<P>Caso o subadministrador tamb&eacute;m esteja habilitado ao aplicativo, ele deve ent&atilde;o possuir habilita&ccedil;&atilde;o &agrave; mesma transa&ccedil;&atilde;o do aplicativo, para que possa habilit&aacute;-la a outro usu&aacute;rio.</FONT> </P></DIR>

<FONT SIZE=2><P>Para realizar manuten&ccedil;&otilde;es no cadastro e habilita&ccedil;&otilde;es de usu&aacute;rios, deve-se utilizar o menu de opera&ccedil;&atilde;o "CADUSU" e nele informar os argumentos de acordo com a opera&ccedil;&atilde;o a ser processada.</FONT> </P>
<B><FONT SIZE=5><P><A NAME="Cadusu">Cadastramento de usu&aacute;rio/perfil </A></P>
</B></FONT><P><HR></P>
<FONT SIZE=2><P>Existem dois tipos de usu&aacute;rios no Sistema de Seguran&ccedil;a:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>O usu&aacute;rio comum, que possui seus dados cadastrais e suas pr&oacute;prias habilita&ccedil;&otilde;es, espec&iacute;ficas para as fun&ccedil;&otilde;es que desempenha e aplicativos/elementos que utiliza; e</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>O usu&aacute;rio perfil modelo, que congrega caracter&iacute;sticas e habilita&ccedil;&otilde;es comuns a um grupo de usu&aacute;rios.</FONT> </P></DIR>

<FONT SIZE=2><P>Pessoas de uma mesma equipe, que comumente trabalham com os mesmos aplicativos, executando fun&ccedil;&otilde;es similares, possuem dados semelhantes em seus cadastramentos e habilita&ccedil;&otilde;es. Nesta situa&ccedil;&atilde;o, &eacute; aconselh&aacute;vel que se crie um perfil modelo, contendo esses dados comuns, e o relacione a todos os usu&aacute;rios pertencentes &agrave; equipe, atrav&eacute;s da opera&ccedil;&atilde;o de vincula&ccedil;&atilde;o de usu&aacute;rio a perfil.</FONT> </P>
<FONT SIZE=2><P>A vantagem de se criar um perfil modelo &eacute; que todas as caracter&iacute;sticas e habilita&ccedil;&otilde;es, comuns aos usu&aacute;rios, s&atilde;o cadastradas uma &uacute;nica vez para o perfil, sendo herdadas por todos os usu&aacute;rios a ele vinculados. Qualquer altera&ccedil;&atilde;o nestas habilita&ccedil;&otilde;es passar&aacute; a valer tamb&eacute;m para os usu&aacute;rios vinculados, ap&oacute;s efetuar suas libera&ccedil;&otilde;es.</FONT> </P>
<FONT SIZE=2><P>Um usu&aacute;rio pode ser vinculado a um ou mais perfis modelo, de acordo com as fun&ccedil;&otilde;es afins que compartilha com tais perfis.</FONT> </P>
<FONT SIZE=2><P>No momento da vincula&ccedil;&atilde;o &eacute; estipulada uma prioridade para a mesma, a fim de que, havendo coincid&ecirc;ncia ou discord&acirc;ncia de habilita&ccedil;&otilde;es a serem herdadas pelo usu&aacute;rio, quando o mesmo estiver vinculado a mais de um perfil, seja ent&atilde;o respeitada a prioridade destas vincula&ccedil;&otilde;es.</FONT> </P>
<FONT SIZE=2><P>Todo usu&aacute;rio deve ser submetido &agrave; opera&ccedil;&atilde;o de libera&ccedil;&atilde;o antes que possa efetuar <I>logon</I> e ap&oacute;s ter sido finalizado todo o seu cadastramento. Atrav&eacute;s deste processo &eacute; que s&atilde;o sintetizadas suas habilita&ccedil;&otilde;es, que foram cadastradas especificamente para o mesmo ou foram herdadas dos v&aacute;rios perfis modelo aos quais ele foi porventura vinculado.</FONT> </P>
<FONT SIZE=2><P>A cada vez que &eacute; alterado o cadastramento do usu&aacute;rio - unidades autorizadas ou habilita&ccedil;&otilde;es - ou forem alterados os perfis aos quais ele est&aacute; vinculado, deve-se ent&atilde;o proceder novamente &agrave; sua libera&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Ap&oacute;s a primeira libera&ccedil;&atilde;o do usu&aacute;rio, ele estar&aacute; apto a efetuar o <I>logon</I>, mesmo se seu cadastramento estiver sendo alterado. &Eacute; importante salientar que a altera&ccedil;&atilde;o de sua empresa, estabelecimento, unidade, esta&ccedil;&atilde;o, ambiente ou dias habilitados passar&aacute; imediatamente a ser considerada assim que processada. Por&eacute;m, para que suas habilita&ccedil;&otilde;es passem a ser consideradas, &eacute; necess&aacute;rio efetuar novamente sua libera&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Um usu&aacute;rio vinculado pode ter habilita&ccedil;&otilde;es pr&oacute;prias de aplicativos e elementos, diferentes daquelas cadastradas para os perfis a ele relacionados. Desta forma, &eacute; poss&iacute;vel redefinir - restringir ou ampliar - as habilita&ccedil;&otilde;es que um usu&aacute;rio herda de seus perfis modelo.</FONT> </P>
<FONT SIZE=2><P>Um usu&aacute;rio vinculado pode tamb&eacute;m ter suas caracter&iacute;sticas pr&oacute;prias, tais como ambiente autorizado, empresa, &aacute;rea, etc.</FONT> </P>
<FONT SIZE=2><P>Um usu&aacute;rio vinculado pode ser desligado de qualquer um de seus perfis a qualquer momento. Neste caso, o usu&aacute;rio perde as habilita&ccedil;&otilde;es que foram herdadas do perfil, atrav&eacute;s da vincula&ccedil;&atilde;o. O usu&aacute;rio fica com <I>status</I> "a liberar" e s&oacute; poder&aacute; efetuar novo <I>logon</I>, caso seja processada a sua libera&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Conforme percebido, um perfil modelo &eacute; um usu&aacute;rio abstrato, utilizado apenas para definir caracter&iacute;sticas e habilita&ccedil;&otilde;es a serem herdadas por um grupo de usu&aacute;rios. Ele n&atilde;o efetua <I>logon</I> e nem trabalha em uma sess&atilde;o SADS. Por este motivo, n&atilde;o possui dados cadastrais, referentes &agrave; utiliza&ccedil;&atilde;o dos sistemas e controle de <I>logon</I> e senha, quais sejam n&iacute;vel de acesso, indicador de integra&ccedil;&atilde;o do <I>logon</I> com o <I>Marc</I>, validade da senha, indicador de controle de altera&ccedil;&atilde;o de senha, indicador de dias habilitados para <I>logon</I> e c&oacute;digos das esta&ccedil;&otilde;es habilitadas para uso.</FONT> </P>
<FONT SIZE=2><P>As opera&ccedil;&otilde;es de manuten&ccedil;&atilde;o no cadastro de usu&aacute;rio - inclus&atilde;o, altera&ccedil;&atilde;o e exclus&atilde;o -, seja ele usu&aacute;rio comum ou perfil modelo, s&atilde;o disparadas a partir do mesmo menu de opera&ccedil;&atilde;o "CADUSU", bastando informar se o tipo do usu&aacute;rio a ser processado &eacute; um usu&aacute;rio comum ("U") ou perfil modelo ("P"). </P>
<P>Contudo, as telas de processamento utilizadas em tais opera&ccedil;&otilde;es s&atilde;o diferenciadas para os dois tipos de usu&aacute;rios. Na manuten&ccedil;&atilde;o de um usu&aacute;rio comum ser&atilde;o requeridos campos referentes &agrave; utiliza&ccedil;&atilde;o dos sistemas e controle de <I>logon</I> e senha, o que, conforme explicado anteriormente, n&atilde;o s&atilde;o exigidos na manuten&ccedil;&atilde;o de um usu&aacute;rio perfil modelo.</FONT> </P>
<B><FONT SIZE=5><P><A NAME="Inclu">Inclus&atilde;o de usu&aacute;rio/perfil</A></B></FONT> </P>
<FONT SIZE=2><P>Esta opera&ccedil;&atilde;o propicia a inclus&atilde;o de um usu&aacute;rio comum ou perfil modelo.</FONT> </P>
<FONT SIZE=2><P>Caso o n&uacute;mero do usu&aacute;rio a ser inclu&iacute;do n&atilde;o seja informado, ser&aacute; ent&atilde;o gerado um n&uacute;mero imediatamente superior ao maior n&uacute;mero de usu&aacute;rio j&aacute; cadastrado no Sistema de Seguran&ccedil;a.</FONT> </P>
<FONT SIZE=2><P>Ap&oacute;s a opera&ccedil;&atilde;o de inclus&atilde;o de usu&aacute;rio, ser&aacute; automaticamente encadeada a opera&ccedil;&atilde;o de habilita&ccedil;&atilde;o de aplicativos. Isto deve-se ao fato de que um usu&aacute;rio s&oacute; consegue efetuar <I>logon</I> caso o seu cadastramento esteja completo, ou seja, com as especifica&ccedil;&otilde;es de quais aplicativos e transa&ccedil;&otilde;es ele estar&aacute; autorizado a trabalhar.</FONT> </P>
<FONT SIZE=2><P>Por&eacute;m, se o usu&aacute;rio rec&eacute;m criado possuir n&iacute;vel de acesso 99, n&atilde;o ser&aacute; encadeada a transa&ccedil;&atilde;o de habilita&ccedil;&atilde;o de aplicativos, pois o Sistema de Seguran&ccedil;a assumir&aacute;, automaticamente, que ele estar&aacute; habilitado a trabalhar com todos os aplicativos e transa&ccedil;&otilde;es.</FONT> </P>
<FONT SIZE=2><P>Todo usu&aacute;rio de n&iacute;vel de acesso 99 est&aacute; habilitado a executar qualquer opera&ccedil;&atilde;o do Sistema de Seguran&ccedil;a, inclusive a inclus&atilde;o de usu&aacute;rio. Por&eacute;m, o usu&aacute;rio de n&iacute;vel de acesso 98, para que possa efetuar a inclus&atilde;o de um usu&aacute;rio, deve atender determinados requisitos, que se encontram relacionados nesta se&ccedil;&atilde;o, no item "Usu&aacute;rios e habilita&ccedil;&otilde;es", t&oacute;pico "Introdu&ccedil;&atilde;o", subt&oacute;pico "Respons&aacute;veis pelos cadastramentos".</FONT> </P>
<FONT SIZE=2><P>Para incluir um usu&aacute;rio comum ou perfil modelo, deve-se utilizar o menu de opera&ccedil;&atilde;o "CADUSU", opera&ccedil;&atilde;o "INC".</FONT> </P>
<B><FONT SIZE=2><P>CAMPOS DA TELA</B></FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Numero</B> - N&uacute;mero do usu&aacute;rio, caso tenha sido especificado o n&uacute;mero do usu&aacute;rio a ser inclu&iacute;do.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Nome</B> - Nome do usu&aacute;rio.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Codigo</B> - C&oacute;digo do usu&aacute;rio.</FONT> </P>
<FONT SIZE=2><P>O c&oacute;digo do usu&aacute;rio servir&aacute;, opcionalmente, para identificar o usu&aacute;rio junto ao Sistema de Seguran&ccedil;a. Desta forma, no momento do <I>logon</I> ou em qualquer opera&ccedil;&atilde;o a ser efetuada internamente ao Sistema de Seguran&ccedil;a, tanto o n&uacute;mero quanto o c&oacute;digo do usu&aacute;rio ser&atilde;o aceitos como seus identificadores.</FONT> </P>
<FONT SIZE=2><P>O c&oacute;digo e o n&uacute;mero devem ser &uacute;nicos e espec&iacute;ficos para cada usu&aacute;rio.</FONT> </P>
<FONT SIZE=2><P>O c&oacute;digo do usu&aacute;rio que efetuou o<I> logon</I> fica dispon&iacute;vel aos aplicativos atrav&eacute;s do campo global GBL-USUCODEXT, podendo estes utiliz&aacute;-lo ou n&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Quando houver integra&ccedil;&atilde;o do <I>logon</I> do usu&aacute;rio com o <I>Marc</I>, seu c&oacute;digo externo ser&aacute; obrigat&oacute;rio e dever&aacute; ser id&ecirc;ntico ao seu <I>usercode</I> no <I>Marc</I>.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Livre</B> - Dado livre a respeito do usu&aacute;rio.</FONT> </P>
<FONT SIZE=2><P>Este dado deve ser informado de acordo com a necessidade e conveni&ecirc;ncia de integra&ccedil;&atilde;o com outros aplicativos ou de identifica&ccedil;&atilde;o do usu&aacute;rio.</FONT> </P>
<FONT SIZE=2><P>Este dado poder&aacute; ser pesquisado posteriormente por outros aplicativos, atrav&eacute;s de acesso &agrave; sub-rotina SBTS05, que &eacute; respons&aacute;vel pelas consultas aos dados dos usu&aacute;rios.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Sigla da Empresa</B> - Sigla da empresa do usu&aacute;rio.</FONT> </P>
<FONT SIZE=2><P>Esta sigla deve ter sido cadastrada anteriormente na tabela SBPM6001 - Tabela de Empresas, conforme descrito na Se&ccedil;&atilde;o V, "Parametriza&ccedil;&otilde;es do SADS".</FONT> </P>
<FONT SIZE=2><P>A sigla da empresa do usu&aacute;rio que efetuou o <I>logon</I></FONT><FONT SIZE=2 COLOR="#00ffff"> </FONT><FONT SIZE=2>fica dispon&iacute;vel aos aplicativos atrav&eacute;s do campo global GBL-EMPSIGLA, podendo estes utiliz&aacute;-la ou n&atilde;o.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Area</B> - C&oacute;digo da &aacute;rea do usu&aacute;rio.<BR>
Este c&oacute;digo deve ter sido cadastrado anteriormente na tabela SBPM6006 - Tabela de &Aacute;reas, associado &agrave; sigla da empresa informada, conforme descrito na Se&ccedil;&atilde;o V, "Parametriza&ccedil;&otilde;es do SADS".</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Ambiente</B> - C&oacute;digo do ambiente no qual o usu&aacute;rio poder&aacute; obter acesso.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"T" - Quando o usu&aacute;rio puder obter acesso somente ao ambiente de teste;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"P" - Quando o usu&aacute;rio puder obter acesso somente ao ambiente de produ&ccedil;&atilde;o;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"A" - Quando o usu&aacute;rio puder obter acesso a ambos os ambientes, teste e produ&ccedil;&atilde;o.</FONT> </P></DIR>

<FONT SIZE=2><P>Uma vez determinado um ambiente espec&iacute;fico ("P" ou "T") para o usu&aacute;rio, este s&oacute; ter&aacute; acesso aos aplicativos habilitados a ele e que estiverem compilados para o ambiente em quest&atilde;o.</FONT> </P>
<FONT SIZE=2><P>O ambiente no qual o usu&aacute;rio efetuou o <I>logon</I> fica dispon&iacute;vel aos aplicativos atrav&eacute;s do campo global GBL-USUAMBI, podendo estes utiliz&aacute;-lo ou n&atilde;o.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Nivel de acesso</B> - Poder de acesso de um usu&aacute;rio comum, definido para o Sistema de Seguran&ccedil;a.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"99" - N&iacute;vel de acesso que identifica o administrador de seguran&ccedil;a. </P>
<P>Um usu&aacute;rio com n&iacute;vel de acesso 99 &eacute; implicitamente habilitado a realizar qualquer opera&ccedil;&atilde;o dentro do Sistema de Seguran&ccedil;a. N&atilde;o ser&aacute; ent&atilde;o necess&aacute;rio definir para ele habilita&ccedil;&otilde;es de aplicativos, transa&ccedil;&otilde;es e elementos, pois ser&aacute; automaticamente habilitado a todos os aplicativos (" " - branco) com tipo de habilita&ccedil;&atilde;o "2" e a todas as transa&ccedil;&otilde;es. Tamb&eacute;m ser&aacute; habilitado automaticamente a todos os elementos (LISTA DE ELEMENTOS: " " - ELEMENTO: " " - TIPO HAB: 2).</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"98" - N&iacute;vel de acesso que identifica os usu&aacute;rios habilitados, pelo administrador de seguran&ccedil;a, a realizar opera&ccedil;&otilde;es no Sistema de Seguran&ccedil;a, dentro de limites estabelecidos pelas suas pr&oacute;prias habilita&ccedil;&otilde;es.</FONT> </P>
<FONT SIZE=2><P>Estes usu&aacute;rios s&atilde;o tamb&eacute;m denominados subadministradores de seguran&ccedil;a.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"97" - N&iacute;vel de acesso que identifica o preparador de servi&ccedil;os no Sistema de Controle de Processamento (SPO).</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>N&iacute;veis inferiores a "97" - N&iacute;veis dos usu&aacute;rios que n&atilde;o podem efetuar manuten&ccedil;&otilde;es no Sistema de Seguran&ccedil;a, podendo ser utilizados de acordo com os crit&eacute;rios dos aplicativos.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Caso o usu&aacute;rio seja perfil modelo, o n&iacute;vel de acesso &eacute; um dado n&atilde;o especific&aacute;vel.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Caso o n&iacute;vel de acesso de um usu&aacute;rio comum n&atilde;o seja informado, ser&aacute; assumido n&iacute;vel "00" (zero).</FONT> </P></DIR>

<FONT SIZE=2><P>O n&iacute;vel de acesso do usu&aacute;rio que efetuou o <I>logon</I> fica dispon&iacute;vel aos aplicativos atrav&eacute;s do campo global GBL-USUNIVACES, podendo estes utiliz&aacute;-lo ou n&atilde;o.</FONT> </P>
<FONT SIZE=2><P>O n&iacute;vel de acesso do usu&aacute;rio pode tamb&eacute;m ser definido por aplicativo. Desta forma, para cada aplicativo habilitado ao usu&aacute;rio, pode-se estabelecer qual o seu n&iacute;vel de acesso espec&iacute;fico, que poder&aacute; ser testado pelo pr&oacute;prio aplicativo. </P>
<P>Maiores esclarecimentos a respeito dos n&iacute;veis de acesso dos usu&aacute;rios encontram-se descritos no item "N&iacute;veis de seguran&ccedil;a dispon&iacute;veis", nesta se&ccedil;&atilde;o.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Integrado com o Marc </B>- Indicador de que o<I> </I>logon do usu&aacute;rio ser&aacute; efetuado atrav&eacute;s de integra&ccedil;&atilde;o com o <I>Marc</I>.</FONT> </P>
<FONT SIZE=2><P>Caso seja definido que o <I>logon</I> do usu&aacute;rio ser&aacute; integrado com o <I>Marc</I>, ent&atilde;o n&atilde;o lhe ser&aacute; exigido o preenchimento da tela de habilita&ccedil;&atilde;o para in&iacute;cio de uma sess&atilde;o SADS. Neste caso o <I>logon</I> ser&aacute; disparado automaticamente pelo pr&oacute;prio Sistema de Seguran&ccedil;a, assumindo os seguintes valores para os campos da tela de<I> </I>logon:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>O c&oacute;digo do usu&aacute;rio ser&aacute; igual ao <I>usercode </I>por ele informado no <I>Marc </I>;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Atrav&eacute;s deste c&oacute;digo &eacute; ent&atilde;o identificado pelo SADS/SS o n&uacute;mero de usu&aacute;rio;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>A senha n&atilde;o ser&aacute; exigida;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>O ambiente e as unidades autorizadas ser&atilde;o obtidos do cadastro do usu&aacute;rio, caso sejam espec&iacute;ficas, ou, caso contr&aacute;rio, dos <I>defaults</I> cadastrados para o usu&aacute;rio, que, neste caso, para integra&ccedil;&atilde;o com o <I>Marc</I>, obrigatoriamente devem ter sido cadastrados. </P></DIR>

<P>Se o usu&aacute;rio possuir <I>logon</I> integrado com o <I>Marc</I> e desejar efetuar <I>logon</I> em um ambiente e unidades diferentes daqueles assumidos, ent&atilde;o ele deve utilizar o menu de opera&ccedil;&atilde;o "HAB" para disparar novo<I> </I>logon com os valores desej&aacute;veis. Neste caso ele necessita ent&atilde;o informar a senha.</FONT> </P>
<FONT SIZE=2><P>Caso o usu&aacute;rio seja perfil modelo, o indicador de <I>logon</I> integrado com o<I> Marc</I> &eacute; um dado n&atilde;o especific&aacute;vel.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Validade</B> - Data final para a validade do cadastro do usu&aacute;rio.</FONT> </P>
<FONT SIZE=2><P>Caso tenha sido estabelecida uma data de validade para o usu&aacute;rio, em qualquer data igual ou posterior a esta, o usu&aacute;rio ser&aacute; impedido de efetuar <I>logon</I> e, conseq&uuml;entemente, n&atilde;o conseguir&aacute; trabalhar com os aplicativos SADS que exigirem seguran&ccedil;a.</FONT> </P>
<FONT SIZE=2><P>Ap&oacute;s o vencimento do cadastro do usu&aacute;rio, seu <I>status</I> ser&aacute; alterado para "bloqueado".</FONT> </P>
<FONT SIZE=2><P>Caso o usu&aacute;rio seja perfil modelo, a validade &eacute; um dado n&atilde;o especific&aacute;vel.</FONT> </P>
<FONT SIZE=2><P>Caso a validade n&atilde;o seja informada para um usu&aacute;rio comum, seu cadastramento ter&aacute; validade ilimitada.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Alteracao de senha</B> - C&oacute;digo do controle de exig&ecirc;ncia de troca de senha do usu&aacute;rio.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"0" - Para que seja exigida troca peri&oacute;dica da senha do usu&aacute;rio, ap&oacute;s aproximadamente 60 dias de sua cria&ccedil;&atilde;o ou da &uacute;ltima troca realizada. </P>
<P>Haver&aacute;, ainda, um per&iacute;odo de toler&acirc;ncia de mais dez dias para que o usu&aacute;rio efetue a troca de senha, sendo que, findo esse prazo, o usu&aacute;rio ficar&aacute; impedido de efetuar <I>logon</I>.</FONT> </P>
<FONT SIZE=2><P>Caso isto ocorra, somente o administrador de seguran&ccedil;a ou o subadministrador, se devidamente habilitado, poder&aacute; trocar sua senha e liberar seu acesso.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"1" - Para que seja permitida a troca de senha pelo usu&aacute;rio, mas n&atilde;o seja exigida.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"2" - Para que n&atilde;o seja permitida a troca de senha pelo usu&aacute;rio.</FONT> </P></DIR>

<FONT SIZE=2><P>Caso o usu&aacute;rio seja perfil modelo, o c&oacute;digo de altera&ccedil;&atilde;o de senha &eacute; um dado n&atilde;o especific&aacute;vel.</FONT> </P>
<FONT SIZE=2><P>Caso este campo n&atilde;o seja informado para um usu&aacute;rio comum, ser&aacute; assumido o c&oacute;digo "0" e ser&aacute; ent&atilde;o exigida a troca peri&oacute;dica de sua senha .</FONT> </P>
<FONT SIZE=2><P>Caso o c&oacute;digo do controle seja "0" ou "1", o usu&aacute;rio poder&aacute; trocar sua senha a qualquer momento, independentemente do Sistema de Seguran&ccedil;a exigir ou n&atilde;o tal troca.</P>
<P>Pode ser cadastrado um valor default para o campo "Alteracao de senha", que dever&aacute; ser assumido por todos os usu&aacute;rios cadastrados na instala&ccedil;&atilde;o. Este valor pode ser informado no campo PAR-6, CODIGO igual a SISSEG, da tabela SBPM5000. Caso tenha sido feita esta parametriza&ccedil;&atilde;o, todos os usu&aacute;rios a serem inclu&iacute;dos ou alterados dever&atilde;o possuir igual valor no campo "Altera&ccedil;&atilde;o de senha". Detalhes sobre esta parametriza&ccedil;&atilde;o podem ser encontrados na Se&ccedil;&atilde;o V, "Parametriza&ccedil;&otilde;es do SADS", item "Seguran&ccedil;a, subitem "Altera&ccedil;&atilde;o de senhas", deste manual.</P>
</FONT><P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Dias Habilitados</B> - Indicador de controle de dias nos quais o usu&aacute;rio est&aacute; autorizado a efetuar <I>logon</I>.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"0" - Sem restri&ccedil;&otilde;es quanto aos dias nos quais o usu&aacute;rio poder&aacute; efetuar <I>logon</I>;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"1" - O usu&aacute;rio n&atilde;o poder&aacute; efetuar <I>logon</I> aos s&aacute;bados e domingos;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"2" - O usu&aacute;rio n&atilde;o poder&aacute; efetuar <I>logon</I> aos domingos;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"3" - O usu&aacute;rio n&atilde;o poder&aacute; efetuar <I>logon</I> nos feriados;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"4" - O usu&aacute;rio n&atilde;o poder&aacute; efetuar<I> logon</I> aos s&aacute;bados, domingos e feriados;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"5" - O usu&aacute;rio n&atilde;o poder&aacute; efetuar <I>logon</I> aos domingos e feriados.</FONT> </P></DIR>

<FONT SIZE=2><P>Caso o usu&aacute;rio seja perfil modelo o indicador de controle de dias habilitados &eacute; um dado n&atilde;o especific&aacute;vel.</FONT> </P>
<FONT SIZE=2><P>Caso este campo n&atilde;o seja informado para um usu&aacute;rio comum, ser&aacute; assumido que n&atilde;o existem restri&ccedil;&otilde;es quanto aos dias nos quais o usu&aacute;rio poder&aacute; efetuar <I>logon</I>.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Unidades Autorizadas</B>:</FONT> </P>
<FONT SIZE=2><P>As unidades dos usu&aacute;rios - empresa, estabelecimento e unidade - devem ser definidas respeitando-se a hierarquia da instala&ccedil;&atilde;o, considerando que uma empresa &eacute; formada por v&aacute;rios estabelecimentos, que por sua vez possuem v&aacute;rias unidades.</FONT> </P>
<FONT SIZE=2><P>Antes ent&atilde;o que se cadastre qualquer usu&aacute;rio, deve-se definir quais os c&oacute;digos de empresas, estabelecimentos e unidades dever&atilde;o ser definidos na instala&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>O cadastramento das unidades autorizadas de um usu&aacute;rio ir&aacute; estabelecer em quais unidades este obter&aacute; autoriza&ccedil;&atilde;o de acesso.</FONT> </P>
<FONT SIZE=2><P>Sempre que um usu&aacute;rio iniciar uma sess&atilde;o SADS, ser&atilde;o identificadas as unidades nas quais ele ir&aacute; trabalhar especificamente na sess&atilde;o por ele aberta.</FONT> </P>
<FONT SIZE=2><P>Estas unidades ficam dispon&iacute;veis para utiliza&ccedil;&atilde;o pelos aplicativos atrav&eacute;s dos campos globais GBL-EMPCOD, GBL-ETBCOD e GBL-UNDCOD. </P>
<P>Os aplicativos poder&atilde;o ent&atilde;o utilizar estas unidades para, por exemplo, selecionar os dados a serem exibidos ou manipulados pelo usu&aacute;rio.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Empresa</B> - C&oacute;digo da empresa na qual o usu&aacute;rio ter&aacute; autoriza&ccedil;&atilde;o de acesso.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"999" - Para indicar que o usu&aacute;rio poder&aacute; ter acesso a qualquer empresa. </P>
<P>No momento do <I>logon</I>, caso o usu&aacute;rio n&atilde;o possua empresa <I>default</I> cadastrada, ser&aacute; exigido ent&atilde;o que ele informe em qual empresa ele deseja obter acesso naquela sess&atilde;o de trabalho. Caso contr&aacute;rio, ser&aacute; assumida a empresa <I>default</I>.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"nnn" - Para indicar que o usu&aacute;rio tem acesso somente a uma empresa espec&iacute;fica. </P>
<P>Podem ser informados valores de "001" a "998" que, caso utilizados, devem estar cadastrados na tabela SBPM6001, conforme descrito na Se&ccedil;&atilde;o V, "Parametriza&ccedil;&otilde;es do SADS", item "Empresas".</FONT> </P>
<FONT SIZE=2><P>No momento do <I>logon</I>, n&atilde;o ser&aacute; exigido que o usu&aacute;rio informe a empresa na qual deseja trabalhar, porque a empresa especificada em seu cadastramento sempre ser&aacute; assumida, tendo em vista ser a &uacute;nica na qual o usu&aacute;rio poder&aacute; obter acesso.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"000" - Para indicar que o usu&aacute;rio n&atilde;o tem v&iacute;nculo a nenhuma empresa.</FONT> </P>
<FONT SIZE=2><P>Neste caso, se o usu&aacute;rio solicitar uma transa&ccedil;&atilde;o de um aplicativo que trata as informa&ccedil;&otilde;es de acordo com a empresa na qual o usu&aacute;rio efetuou o <I>logon</I>, ent&atilde;o n&atilde;o lhe ser&aacute; permitido, nesta transa&ccedil;&atilde;o, manipular ou consultar nenhuma informa&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>No momento do <I>logon</I>, n&atilde;o lhe ser&aacute; exigida a informa&ccedil;&atilde;o da empresa na qual deseja trabalhar, pois ser&aacute; assumida a empresa "000".</FONT> </P>
<FONT SIZE=2><P>Caso o c&oacute;digo da empresa n&atilde;o seja informado, ser&aacute; assumida, internamente ao Sistema de Seguran&ccedil;a, empresa "000".</FONT> </P></DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Estabelecimento</B> - C&oacute;digo do estabelecimento no qual o usu&aacute;rio ter&aacute; autoriza&ccedil;&atilde;o de acesso.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"9999" - Para indicar que o usu&aacute;rio poder&aacute; ter acesso a qualquer estabelecimento. </P>
<P>No momento do <I>logon</I>, caso o usu&aacute;rio n&atilde;o possua estabelecimento <I>default</I> cadastrado, ser&aacute; exigido ent&atilde;o que ele informe em qual estabelecimento ele deseja, naquela sess&atilde;o de trabalho, obter acesso. Caso contr&aacute;rio, ser&aacute; assumido o estabelecimento <I>default</I>.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"nnnn" - Para indicar que o usu&aacute;rio tem acesso somente a um estabelecimento espec&iacute;fico. </P>
<P>Podem ser informados valores de "0001" a "9998".</FONT> </P>
<FONT SIZE=2><P>No momento do <I>logon</I>, n&atilde;o ser&aacute; exigido que o usu&aacute;rio informe o estabelecimento no qual deseja trabalhar, porque o estabelecimento especificado em seu cadastramento ser&aacute; sempre assumido, tendo em vista ser o &uacute;nico no qual o usu&aacute;rio poder&aacute; obter acesso.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"0000" - Para indicar que o usu&aacute;rio n&atilde;o tem v&iacute;nculo a nenhum estabelecimento.</FONT> </P>
<FONT SIZE=2><P>Neste caso, se o usu&aacute;rio solicitar uma transa&ccedil;&atilde;o de um aplicativo que trata as informa&ccedil;&otilde;es de acordo com o estabelecimento no qual o usu&aacute;rio efetuou o<I> logon</I>, ent&atilde;o, nesta transa&ccedil;&atilde;o, n&atilde;o lhe ser&aacute; permitido manipular ou consultar nenhuma informa&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>N&atilde;o lhe ser&aacute; exigida a informa&ccedil;&atilde;o do estabelecimento no qual deseja trabalhar, no momento do <I>logon</I>, pois ser&aacute; assumido o estabelecimento "0000".</FONT> </P>
<FONT SIZE=2><P>Caso o c&oacute;digo do estabelecimento n&atilde;o seja informado, ser&aacute; assumido, internamente ao Sistema de Seguran&ccedil;a, estabelecimento "000". </P></DIR>

</FONT><P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Unidade</B> - C&oacute;digo da unidade na qual o usu&aacute;rio ter&aacute; autoriza&ccedil;&atilde;o de acesso.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"999" - Para indicar que o usu&aacute;rio poder&aacute; ter acesso a qualquer unidade. </P>
<P>Caso o usu&aacute;rio n&atilde;o possua unidade <I>default</I> cadastrada, no momento do <I>logon</I>, ser&aacute; exigido ent&atilde;o que ele informe em qual unidade ele deseja obter acesso naquela sess&atilde;o de trabalho. Caso contr&aacute;rio, ser&aacute; assumida a unidade <I>default</I>.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"nnn" - Para indicar que o usu&aacute;rio tem acesso somente a uma unidade espec&iacute;fica. </P>
<P>Podem ser informados valores de "001" a "998".</FONT> </P>
<FONT SIZE=2><P>No momento do <I>logon</I>, n&atilde;o ser&aacute; exigido que o usu&aacute;rio informe a unidade na qual deseja trabalhar, pois a unidade especificada em seu cadastramento ser&aacute; sempre assumida, tendo em vista ser a &uacute;nica que o usu&aacute;rio poder&aacute; acessar.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"000" - Para indicar que o usu&aacute;rio n&atilde;o tem v&iacute;nculo a nenhuma unidade.</FONT> </P>
<FONT SIZE=2><P>Neste caso, se o usu&aacute;rio solicitar uma transa&ccedil;&atilde;o de um aplicativo, que trata as informa&ccedil;&otilde;es de acordo com a unidade na qual o usu&aacute;rio efetuou o <I>logon</I>, ent&atilde;o, nesta transa&ccedil;&atilde;o, n&atilde;o lhe ser&aacute; permitido manipular ou consultar nenhuma informa&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>N&atilde;o lhe ser&aacute; exigida a informa&ccedil;&atilde;o da unidade na qual deseja trabalhar, no momento do <I>logon</I>, pois ser&aacute; assumida a unidade "000".</FONT> </P>
<FONT SIZE=2><P>Caso o c&oacute;digo da unidade n&atilde;o seja informada, ser&aacute; assumido, internamente ao Sistema de Seguran&ccedil;a, unidade "000". </P></DIR>

<P>Deve existir uma coer&ecirc;ncia na informa&ccedil;&atilde;o das unidades autorizadas de um usu&aacute;rio, da seguinte forma:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Se um usu&aacute;rio pode obter acesso &agrave;s informa&ccedil;&otilde;es de todas as empresas (999), conseq&uuml;entemente, n&atilde;o pode ser autorizado a um estabelecimento espec&iacute;fico (nnnn) e/ou unidade espec&iacute;fica (nnn);</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Se um usu&aacute;rio pode obter acesso &agrave;s informa&ccedil;&otilde;es de todos os estabelecimentos (9999), conseq&uuml;entemente, n&atilde;o pode ser autorizado a uma unidade espec&iacute;fica (nnn), independentemente da empresa ser espec&iacute;fica (nnn) ou gen&eacute;rica (999);</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Se um usu&aacute;rio n&atilde;o tem acesso a nenhuma empresa (000), ent&atilde;o tamb&eacute;m n&atilde;o poder&aacute; obter acesso a nenhum estabelecimento (0000) e unidade (000);</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Se um usu&aacute;rio n&atilde;o tem acesso a nenhum estabelecimento (0000), ent&atilde;o tamb&eacute;m n&atilde;o poder&aacute; obter acesso a nenhuma unidade (000);</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>As demais combina&ccedil;&otilde;es das unidades autorizadas de um usu&aacute;rio s&atilde;o v&aacute;lidas.</FONT> </P></DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Estacoes Habilitadas</B> - C&oacute;digos das esta&ccedil;&otilde;es da instala&ccedil;&atilde;o nas quais o usu&aacute;rio poder&aacute; trabalhar.</FONT> </P>
<FONT SIZE=2><P>Os c&oacute;digos das esta&ccedil;&otilde;es devem ser informados de acordo com os padr&otilde;es para nomenclaturas de esta&ccedil;&otilde;es estabelecidos na instala&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Os c&oacute;digos das esta&ccedil;&otilde;es podem ser informados de forma hierarquizada, representando, desta forma, um grupo de esta&ccedil;&otilde;es. </P>
<P>Se for informado, por exemplo, o c&oacute;digo de esta&ccedil;&atilde;o "A", o usu&aacute;rio poder&aacute; utilizar as esta&ccedil;&otilde;es cujos nomes sejam iniciados com a letra " A".</FONT> </P>
<FONT SIZE=2><P>Da mesma forma, se informadas as letras "XY", o usu&aacute;rio poder&aacute; utilizar as esta&ccedil;&otilde;es cujos c&oacute;digos iniciem pelas letras "XY".</FONT> </P>
<FONT SIZE=2><P>Se nenhuma esta&ccedil;&atilde;o for informada, ser&aacute; assumido que o usu&aacute;rio poder&aacute; trabalhar em todas esta&ccedil;&otilde;es da instala&ccedil;&atilde;o.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Confirme</B> - Indicador de confirma&ccedil;&atilde;o de opera&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"S" - Para confirmar a opera&ccedil;&atilde;o;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"N" - Para cancelar a opera&ccedil;&atilde;o.</FONT> </P></DIR>
</DIR>

<B><FONT SIZE=5><P>Altera&ccedil;&atilde;o de usu&aacute;rio/perfil</B></FONT> </P>
<FONT SIZE=2><P>Esta opera&ccedil;&atilde;o permite realizar altera&ccedil;&otilde;es nos dados cadastrais de um usu&aacute;rio comum ou perfil modelo.</FONT> </P>
<FONT SIZE=2><P>As unidades autorizadas do usu&aacute;rio devem ser sempre compat&iacute;veis com as unidades autorizadas de suas habilita&ccedil;&otilde;es de aplicativos, transa&ccedil;&otilde;es e elementos. Portanto, a altera&ccedil;&atilde;o daquelas unidades n&atilde;o ser&aacute; efetuada se houver habilita&ccedil;&otilde;es incompat&iacute;veis com as novas unidades autorizadas. Neste caso, antes que se processe a altera&ccedil;&atilde;o desejada, deve-se disparar a opera&ccedil;&atilde;o de altera&ccedil;&atilde;o de unidades autorizadas, atrav&eacute;s da opera&ccedil;&atilde;o "EMP" no menu "UTIUSU".</FONT> </P>
<FONT SIZE=2><P>Maiores esclarecimentos a respeito da opera&ccedil;&atilde;o de altera&ccedil;&atilde;o de unidades autorizadas encontram-se descritos posteriormente nesta se&ccedil;&atilde;o, no item "Altera&ccedil;&atilde;o de unidades autorizadas".</FONT> </P>
<FONT SIZE=2><P>Todo usu&aacute;rio de n&iacute;vel de acesso 99 est&aacute; habilitado a executar qualquer opera&ccedil;&atilde;o do Sistema de Seguran&ccedil;a, inclusive a altera&ccedil;&atilde;o de usu&aacute;rio. Por&eacute;m, para que o usu&aacute;rio de n&iacute;vel de acesso 98 possa efetuar a altera&ccedil;&atilde;o de um usu&aacute;rio, ele deve atender determinados requisitos, que se encontram relacionados nesta se&ccedil;&atilde;o, no item "Usu&aacute;rios e habilita&ccedil;&otilde;es", t&oacute;pico "Introdu&ccedil;&atilde;o", subt&oacute;pico "Respons&aacute;veis pelos cadastramentos".</FONT> </P>
<FONT SIZE=2><P>Para alterar dados do usu&aacute;rio, deve-se utilizar o menu de opera&ccedil;&atilde;o "CADUSU", opera&ccedil;&atilde;o "ALT".</FONT> </P>
<B><FONT SIZE=2><P>CAMPOS DA TELA</B></FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Numero</B> - N&uacute;mero do usu&aacute;rio.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Nome</B> - Nome do usu&aacute;rio.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Codigo</B> - C&oacute;digo do usu&aacute;rio.</FONT> </P>
<FONT SIZE=2><P>O c&oacute;digo do usu&aacute;rio servir&aacute;, opcionalmente, para identificar o usu&aacute;rio junto ao Sistema de Seguran&ccedil;a. Desta forma, no momento do<I> logon</I> ou em qualquer opera&ccedil;&atilde;o a ser efetuada internamente ao Sistema de Seguran&ccedil;a, ou o n&uacute;mero ou o c&oacute;digo do usu&aacute;rio ser&atilde;o aceitos como seus identificadores.</FONT> </P>
<FONT SIZE=2><P>O c&oacute;digo e o n&uacute;mero devem ser &uacute;nicos e espec&iacute;ficos para cada usu&aacute;rio.</FONT> </P>
<FONT SIZE=2><P>O c&oacute;digo do usu&aacute;rio que efetuou o <I>logon</I> fica dispon&iacute;vel aos aplicativos atrav&eacute;s do campo global GBL-USUCODEXT, podendo estes utiliz&aacute;-lo ou n&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Quando houver integra&ccedil;&atilde;o do <I>logon</I> do usu&aacute;rio com o <I>Marc</I>, seu c&oacute;digo externo ser&aacute; obrigat&oacute;rio e dever&aacute; ser id&ecirc;ntico ao seu <I>usercode</I> no<I> Marc</I>.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Livre</B> - Dado livre a respeito do usu&aacute;rio.</FONT> </P>
<FONT SIZE=2><P>Este dado deve ser informado de acordo com a necessidade e conveni&ecirc;ncia de integra&ccedil;&atilde;o com outros aplicativos ou de identifica&ccedil;&atilde;o do usu&aacute;rio.</FONT> </P>
<FONT SIZE=2><P>Este dado poder&aacute; ser pesquisado posteriormente por outros aplicativos, atrav&eacute;s de acesso &agrave; sub-rotina SBTS05, que &eacute; respons&aacute;vel pelas consultas aos dados dos usu&aacute;rios.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Sigla da Empresa</B> - Sigla da empresa do usu&aacute;rio.</FONT> </P>
<FONT SIZE=2><P>Esta sigla deve ter sido cadastrada anteriormente na tabela SBPM6001 - Tabela de Empresas, conforme descrito na Se&ccedil;&atilde;o V, "Parametriza&ccedil;&otilde;es do SADS".</FONT> </P>
<FONT SIZE=2><P>A sigla da empresa do usu&aacute;rio que efetuou o<I> logon</I> fica dispon&iacute;vel aos aplicativos atrav&eacute;s do campo global GBL-EMPSIGLA, podendo estes utiliz&aacute;-la ou n&atilde;o.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Area</B> - C&oacute;digo da &aacute;rea do usu&aacute;rio.</FONT> </P>
<FONT SIZE=2><P>Este c&oacute;digo deve ter sido cadastrado anteriormente na tabela SBPM6006 - Tabela de &Aacute;reas, associado &agrave; sigla da empresa informada, conforme descrito na Se&ccedil;&atilde;o V, "Parametriza&ccedil;&otilde;es do SADS".</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Ambiente</B> - C&oacute;digo do ambiente no qual o usu&aacute;rio poder&aacute; obter acesso.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"T" - Quando o usu&aacute;rio puder obter acesso somente ao ambiente de teste;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"P" - Quando o usu&aacute;rio puder obter acesso somente ao ambiente de produ&ccedil;&atilde;o;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"A" - Quando o usu&aacute;rio puder obter acesso a ambos os ambientes, teste e produ&ccedil;&atilde;o.</FONT> </P></DIR>

<FONT SIZE=2><P>Uma vez determinado um ambiente espec&iacute;fico ("P" ou "T") para o usu&aacute;rio, este s&oacute; ter&aacute; acesso aos aplicativos habilitados a ele e que estiverem compilados para o ambiente em quest&atilde;o.</FONT> </P>
<FONT SIZE=2><P>O ambiente no qual o usu&aacute;rio efetuou o <I>logon </I>fica dispon&iacute;vel aos aplicativos atrav&eacute;s do campo global GBL-USUAMBI, podendo estes utiliz&aacute;-lo ou n&atilde;o.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Nivel de acesso</B> - Poder de acesso de um usu&aacute;rio comum, definido para o Sistema de Seguran&ccedil;a.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"99" - N&iacute;vel de acesso que identifica o administrador de seguran&ccedil;a. </P>
<P>Um usu&aacute;rio com n&iacute;vel de acesso 99 &eacute; implicitamente habilitado a realizar qualquer opera&ccedil;&atilde;o dentro do Sistema de Seguran&ccedil;a. N&atilde;o ser&aacute; ent&atilde;o necess&aacute;rio definir para ele habilita&ccedil;&otilde;es de aplicativos, transa&ccedil;&otilde;es e elementos, pois ser&aacute; automaticamente habilitado a todos os aplicativos (" " - branco) com tipo de habilita&ccedil;&atilde;o "2" e a todas as transa&ccedil;&otilde;es. Tamb&eacute;m ser&aacute; habilitado automaticamente a todos os elementos (LISTA DE ELEMENTOS: " " - ELEMENTO: " " - TIPO HAB: 2).</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"98" - N&iacute;vel de acesso que identifica os usu&aacute;rios habilitados, pelo administrador de seguran&ccedil;a, a realizar opera&ccedil;&otilde;es no Sistema de Seguran&ccedil;a, dentro de limites estabelecidos pelas suas pr&oacute;prias habilita&ccedil;&otilde;es.</FONT> </P>
<FONT SIZE=2><P>Estes usu&aacute;rios s&atilde;o tamb&eacute;m denominados subadministradores de seguran&ccedil;a.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"97" - N&iacute;vel de acesso que identifica o preparador de servi&ccedil;os no Sistema de Controle de Processamento (SPO).</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>N&iacute;veis inferiores a "97" - N&iacute;veis dos usu&aacute;rios que n&atilde;o podem efetuar manuten&ccedil;&otilde;es no Sistema de Seguran&ccedil;a, podendo ser utilizados de acordo com os crit&eacute;rios dos aplicativos.</FONT> </P>
<FONT SIZE=2><P>Caso o usu&aacute;rio seja perfil modelo, o n&iacute;vel de acesso &eacute; um dado n&atilde;o especific&aacute;vel.</FONT> </P>
<FONT SIZE=2><P>Caso o n&iacute;vel de acesso de um usu&aacute;rio comum n&atilde;o seja informado, ser&aacute; assumido n&iacute;vel "00" (zero).</FONT> </P></DIR>

<FONT SIZE=2><P>O n&iacute;vel de acesso do usu&aacute;rio que efetuou o <I>logon</I> fica dispon&iacute;vel aos aplicativos atrav&eacute;s do campo global GBL-USUNIVACES, podendo estes utiliz&aacute;-lo ou n&atilde;o.</FONT> </P>
<FONT SIZE=2><P>O n&iacute;vel de acesso do usu&aacute;rio pode tamb&eacute;m ser definido por aplicativo. Desta forma, para cada aplicativo habilitado ao usu&aacute;rio, pode-se estabelecer qual o seu n&iacute;vel de acesso espec&iacute;fico, que poder&aacute; ser testado pelo pr&oacute;prio aplicativo. </P>
<P>Maiores esclarecimentos a respeito dos n&iacute;veis de acesso dos usu&aacute;rios encontram-se descritos no item "N&iacute;veis de seguran&ccedil;a dispon&iacute;veis", nesta se&ccedil;&atilde;o.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Integrado com o Marc</B> - Indicador de que o <I>logon</I> do usu&aacute;rio ser&aacute; efetuado atrav&eacute;s de integra&ccedil;&atilde;o com o <I>Marc</I>.</FONT> </P>
<FONT SIZE=2><P>Caso seja definido que o <I>logon</I> do usu&aacute;rio ser&aacute; integrado com o <I>Marc</I>, ent&atilde;o n&atilde;o lhe ser&aacute; exigido o preenchimento da tela de habilita&ccedil;&atilde;o para in&iacute;cio de uma sess&atilde;o SADS, pois o <I>logon</I> ser&aacute; disparado automaticamente pelo pr&oacute;prio Sistema de Seguran&ccedil;a, assumindo os seguintes valores para os campos da tela de <I>logon</I>:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>O c&oacute;digo do usu&aacute;rio ser&aacute; igual ao <I>usercode</I> por ele informado no<I> Marc </I>;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Atrav&eacute;s deste c&oacute;digo &eacute; ent&atilde;o identificado pelo SADS/SS o n&uacute;mero de usu&aacute;rio;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>A senha n&atilde;o ser&aacute; exigida;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>O ambiente e as unidades autorizadas ser&atilde;o obtidos do cadastro do usu&aacute;rio, caso sejam espec&iacute;ficas, ou, caso contr&aacute;rio, dos <I>defaults</I> cadastrados para o usu&aacute;rio, que, neste caso, para integra&ccedil;&atilde;o com o<I> Marc</I>, obrigatoriamente devem ter sido cadastrados. </P></DIR>

<P>Se o usu&aacute;rio possuir <I>logon</I> integrado com o <I>Marc</I> e desejar efetuar <I>logon</I> em um ambiente e unidades diferentes daqueles assumidos, ent&atilde;o ele deve utilizar o menu de opera&ccedil;&atilde;o "HAB" para disparar novo <I>logon</I> com os valores desej&aacute;veis. Neste caso ele necessita ent&atilde;o informar a senha.</FONT> </P>
<FONT SIZE=2><P>Caso o usu&aacute;rio seja perfil modelo, o indicador de <I>logon</I> integrado com o <I>Marc</I> &eacute; um dado n&atilde;o especific&aacute;vel.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Validade</B> - Data final para a validade do cadastro do usu&aacute;rio.</FONT> </P>
<FONT SIZE=2><P>Caso tenha sido estabelecida uma data de validade para o usu&aacute;rio, em qualquer data igual ou posterior a esta, o usu&aacute;rio ser&aacute; impedido de efetuar <I>logon</I> e, conseq&uuml;entemente, n&atilde;o conseguir&aacute; trabalhar com os aplicativos SADS que exigirem seguran&ccedil;a.</FONT> </P>
<FONT SIZE=2><P>Ap&oacute;s o vencimento do cadastro do usu&aacute;rio, seu <I>status</I> ser&aacute; alterado para "bloqueado".</FONT> </P>
<FONT SIZE=2><P>Caso o usu&aacute;rio seja perfil modelo, a validade &eacute; um dado n&atilde;o especific&aacute;vel.</FONT> </P>
<FONT SIZE=2><P>Caso a validade n&atilde;o seja informada para um usu&aacute;rio comum, seu cadastramento ter&aacute; validade ilimitada.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Alteracao de senha</B> - C&oacute;digo do controle de exig&ecirc;ncia de troca de senha do usu&aacute;rio.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"0" - Para que seja exigida troca peri&oacute;dica da senha do usu&aacute;rio, ap&oacute;s aproximadamente 60 dias de sua cria&ccedil;&atilde;o ou da &uacute;ltima troca realizada. </P>
<P>Haver&aacute;, ainda, um per&iacute;odo de toler&acirc;ncia de mais dez dias para que o usu&aacute;rio efetue a troca de senha, sendo que, findo esse prazo, o usu&aacute;rio ficar&aacute; impedido de efetuar <I>logon</I>.</FONT> </P>
<FONT SIZE=2><P>Caso isto ocorra, somente o adminstrador de seguran&ccedil;a ou o subadministrador, se devidamente habilitado, poder&aacute; trocar sua senha e liberar seu acesso.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"1" - Para que seja permitida a troca de senha pelo usu&aacute;rio, mas n&atilde;o seja exigida.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"2" - Para que n&atilde;o seja permitida a troca de senha pelo usu&aacute;rio.</FONT> </P></DIR>

<FONT SIZE=2><P>Caso o usu&aacute;rio seja perfil modelo, o c&oacute;digo de altera&ccedil;&atilde;o de senha &eacute; um dado n&atilde;o especific&aacute;vel.</FONT> </P>
<FONT SIZE=2><P>Caso este campo n&atilde;o seja informado para um usu&aacute;rio comum, ser&aacute; assumido o c&oacute;digo "0" e ser&aacute; ent&atilde;o exigida a troca peri&oacute;dica de sua senha.</FONT> </P>
<FONT SIZE=2><P>Caso o c&oacute;digo do controle seja "0" ou "1", o usu&aacute;rio poder&aacute; trocar sua senha a qualquer momento, independentemente do Sistema de Seguran&ccedil;a exigir ou n&atilde;o tal troca.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Dias Habilitados</B> - Indicador de controle de dias nos quais o usu&aacute;rio est&aacute; autorizado a efetuar <I>logon</I>.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"0" - Sem restri&ccedil;&otilde;es quanto aos dias nos quais o usu&aacute;rio poder&aacute; efetuar <I>logon</I>;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"1" - O usu&aacute;rio n&atilde;o poder&aacute; efetuar <I>logon</I> aos s&aacute;bados e domingos;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"2" - O usu&aacute;rio n&atilde;o poder&aacute; efetuar <I>logon</I> aos domingos;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"3" - O usu&aacute;rio n&atilde;o poder&aacute; efetuar <I>logon</I> nos feriados;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"4" - O usu&aacute;rio n&atilde;o poder&aacute; efetuar <I>logon</I> aos s&aacute;bados, domingos e feriados;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"5" - O usu&aacute;rio n&atilde;o poder&aacute; efetuar <I>logon</I> aos domingos e feriados.</FONT> </P></DIR>

<FONT SIZE=2><P>Caso o usu&aacute;rio seja perfil modelo, o indicador de controle de dias habilitados &eacute; um dado n&atilde;o especific&aacute;vel.</FONT> </P>
<FONT SIZE=2><P>Caso este campo n&atilde;o seja informado para um usu&aacute;rio comum, ser&aacute; assumido que n&atilde;o existem restri&ccedil;&otilde;es quanto aos dias nos quais o usu&aacute;rio poder&aacute; efetuar <I>logon</I>.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Unidades Autorizadas</B>:</FONT> </P>
<FONT SIZE=2><P>As unidades dos usu&aacute;rios - empresa, estabelecimento e unidade - devem ser definidas respeitando-se a hierarquia da instala&ccedil;&atilde;o, considerando que uma empresa &eacute; formada por v&aacute;rios estabelecimentos, que por sua vez possuem v&aacute;rias unidades.</FONT> </P>
<FONT SIZE=2><P>Antes ent&atilde;o que se cadastre qualquer usu&aacute;rio, deve-se definir quais os c&oacute;digos de empresas, estabelecimentos e unidades dever&atilde;o ser definidos na instala&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>O cadastramento das unidades autorizadas de um usu&aacute;rio ir&aacute; estabelecer em quais unidades este obter&aacute; autoriza&ccedil;&atilde;o de acesso.</FONT> </P>
<FONT SIZE=2><P>Sempre que um usu&aacute;rio iniciar uma sess&atilde;o SADS, ser&atilde;o identificadas as unidades nas quais ele ir&aacute; trabalhar especificamente na sess&atilde;o por ele aberta.</FONT> </P>
<FONT SIZE=2><P>Estas unidades ficam dispon&iacute;veis para utiliza&ccedil;&atilde;o pelos aplicativos atrav&eacute;s dos campos globais GBL-EMPCOD, GBL-ETBCOD e GBL-UNDCOD. </P>
<P>Os aplicativos poder&atilde;o ent&atilde;o utilizar estas unidades para, por exemplo, selecionar os dados a serem exibidos ou manipulados pelo usu&aacute;rio.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Empresa</B> - C&oacute;digo da empresa na qual o usu&aacute;rio ter&aacute; autoriza&ccedil;&atilde;o de acesso.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"999" - Para indicar que o usu&aacute;rio poder&aacute; ter acesso a qualquer empresa. </P>
<P>No momento do <I>logon</I>, caso o usu&aacute;rio n&atilde;o possua empresa <I>default</I> cadastrada, ser&aacute; exigido ent&atilde;o que ele informe em qual empresa ele deseja obter acesso naquela sess&atilde;o de trabalho. Caso contr&aacute;rio, ser&aacute; assumida a empresa <I>default</I>.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"nnn" - Para indicar que o usu&aacute;rio tem acesso somente a uma empresa espec&iacute;fica. </P>
<P>Podem ser informados valores de "001" a "998" que, caso utilizados, devem estar cadastrados na tabela SBPM6001, conforme descrito na Se&ccedil;&atilde;o V, "Parametriza&ccedil;&otilde;es do SADS", item "Empresas".</FONT> </P>
<FONT SIZE=2><P>No momento do <I>logon</I>, n&atilde;o ser&aacute; exigido que o usu&aacute;rio informe a empresa na qual deseja trabalhar, pois a empresa especificada em seu cadastramento ser&aacute; sempre assumida, visto ser a &uacute;nica na qual o usu&aacute;rio poder&aacute; obter acesso.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"000" - Para indicar que o usu&aacute;rio n&atilde;o tem v&iacute;nculo a nenhuma empresa.</FONT> </P>
<FONT SIZE=2><P>Neste caso, se o usu&aacute;rio solicitar uma transa&ccedil;&atilde;o de um aplicativo que trata as informa&ccedil;&otilde;es de acordo com a empresa na qual o usu&aacute;rio efetuou o <I>logon</I>, ent&atilde;o, n&atilde;o lhe ser&aacute; permitido manipular ou consultar nenhuma informa&ccedil;&atilde;o nesta transa&ccedil;&atilde;o, .</FONT> </P></DIR>

<FONT SIZE=2><P>No momento do <I>logon</I>, n&atilde;o lhe ser&aacute; exigida a informa&ccedil;&atilde;o da empresa na qual deseja trabalhar, pois ser&aacute; assumida a empresa "000".</FONT> </P>
<FONT SIZE=2><P>Caso o c&oacute;digo da empresa n&atilde;o seja informado, ser&aacute; assumido, internamente ao Sistema de Seguran&ccedil;a, empresa "000". </P>
</FONT><P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Estabelecimento</B> - C&oacute;digo do estabelecimento no qual o usu&aacute;rio ter&aacute; autoriza&ccedil;&atilde;o de acesso.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"9999" - Para indicar que o usu&aacute;rio poder&aacute; ter acesso a qualquer estabelecimento. </P>
<P>No momento do <I>logon</I>, caso o usu&aacute;rio n&atilde;o possua estabelecimento <I>default</I> cadastrado, ser&aacute; exigido ent&atilde;o que ele informe em qual estabelecimento ele deseja obter acesso naquela sess&atilde;o de trabalho. Caso contr&aacute;rio, ser&aacute; assumido o estabelecimento <I>default</I>.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"nnnn" - Para indicar que o usu&aacute;rio tem acesso somente a um estabelecimento espec&iacute;fico. </P>
<P>Podem ser informados valores de "0001" a "9998".</FONT> </P>
<FONT SIZE=2><P>No momento do <I>logon</I>, n&atilde;o ser&aacute; exigido que o usu&aacute;rio informe o estabelecimento no qual deseja trabalhar, pois o estabelecimento especificado em seu cadastramento ser&aacute; sempre assumido, tendo em vista ser o &uacute;nico no qual o usu&aacute;rio poder&aacute; obter acesso.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"0000" - Para indicar que o usu&aacute;rio n&atilde;o tem v&iacute;nculo a nenhum estabelecimento.</FONT> </P>
<FONT SIZE=2><P>Neste caso, se o usu&aacute;rio solicitar uma transa&ccedil;&atilde;o de um aplicativo que trata as informa&ccedil;&otilde;es de acordo com o estabelecimento no qual o usu&aacute;rio efetuou o <I>logon</I>, ent&atilde;o, n&atilde;o lhe ser&aacute; permitido manipular ou consultar nenhuma informa&ccedil;&atilde;o nesta transa&ccedil;&atilde;o.</FONT> </P></DIR>

<FONT SIZE=2><P>No momento do <I>logon</I>, n&atilde;o lhe ser&aacute; exigida a informa&ccedil;&atilde;o do estabelecimento no qual deseja trabalhar, pois ser&aacute; assumido o estabelecimento "0000".</FONT> </P>
<FONT SIZE=2><P>Caso o c&oacute;digo do estabelecimento n&atilde;o seja informado, ser&aacute; assumido, internamente ao Sistema de Seguran&ccedil;a, estabelecimento "000". </P>
</FONT><P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Unidade</B> - C&oacute;digo da unidade na qual o usu&aacute;rio ter&aacute; autoriza&ccedil;&atilde;o de acesso.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"999" - Para indicar que o usu&aacute;rio poder&aacute; ter acesso a qualquer unidade. </P>
<P>No momento do <I>logon</I>, caso o usu&aacute;rio n&atilde;o possua unidade <I>default</I> cadastrada, ser&aacute; exigido ent&atilde;o que ele informe em qual unidade ele deseja obter acesso naquela sess&atilde;o de trabalho. Caso contr&aacute;rio, ser&aacute; assumida a unidade <I>default</I>.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"nnn" - Para indicar que o usu&aacute;rio tem acesso somente a uma unidade espec&iacute;fica. </P>
<P>Podem ser informados valores de "001" a "998".</FONT> </P>
<FONT SIZE=2><P>No momento do <I>logon</I>, n&atilde;o ser&aacute; exigido que o usu&aacute;rio informe a unidade na qual deseja trabalhar, porque a unidade especificada em seu cadastramento ser&aacute; sempre assumida, tendo em vista ser a &uacute;nica que o usu&aacute;rio poder&aacute; acessar.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"000" - Para indicar que o usu&aacute;rio n&atilde;o tem v&iacute;nculo a nenhuma unidade.</FONT> </P>
<FONT SIZE=2><P>Neste caso, se o usu&aacute;rio solicitar uma transa&ccedil;&atilde;o de um aplicativo que trata as informa&ccedil;&otilde;es de acordo com a unidade na qual o usu&aacute;rio efetuou o <I>logon</I>, ent&atilde;o, n&atilde;o lhe ser&aacute; permitido manipular ou consultar nenhuma informa&ccedil;&atilde;o nesta transa&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>No momento do <I>logon</I>, n&atilde;o lhe ser&aacute; exigida a informa&ccedil;&atilde;o da unidade na qual deseja trabalhar, pois ser&aacute; assumida a unidade "000".</FONT> </P>
<FONT SIZE=2><P>Caso o c&oacute;digo da unidade n&atilde;o seja informada, ser&aacute; assumido, internamente ao Sistema de Seguran&ccedil;a, unidade "000". </P></DIR>

<P>Deve existir uma coer&ecirc;ncia na informa&ccedil;&atilde;o das unidades autorizadas de um usu&aacute;rio, da seguinte forma:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Se um usu&aacute;rio pode obter acesso &agrave;s informa&ccedil;&otilde;es de todas as empresas (999), conseq&uuml;entemente, n&atilde;o pode ser autorizado a um estabelecimento espec&iacute;fico (nnnn) e/ou unidade espec&iacute;fica (nnn);</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Se um usu&aacute;rio pode obter acesso &agrave;s informa&ccedil;&otilde;es de todos os estabelecimentos (9999), conseq&uuml;entemente, n&atilde;o pode ser autorizado a uma unidade espec&iacute;fica (nnn), independentemente da empresa ser espec&iacute;fica (nnn) ou gen&eacute;rica (999);</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Se um usu&aacute;rio n&atilde;o tem acesso a nenhuma empresa espec&iacute;fica (000), ent&atilde;o tamb&eacute;m n&atilde;o poder&aacute; obter acesso a nenhum estabelecimento (0000) e unidade (000);</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Se um usu&aacute;rio n&atilde;o tem acesso a nenhum estabelecimento espec&iacute;fico (0000), ent&atilde;o tamb&eacute;m n&atilde;o poder&aacute; obter acesso a nenhuma unidade (000);</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>As demais combina&ccedil;&otilde;es das unidades autorizadas de um usu&aacute;rio s&atilde;o v&aacute;lidas.</FONT> </P></DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Estacoes Habilitadas</B> - C&oacute;digos das esta&ccedil;&otilde;es da instala&ccedil;&atilde;o nas quais o usu&aacute;rio poder&aacute; trabalhar.</FONT> </P>
<FONT SIZE=2><P>Os c&oacute;digos das esta&ccedil;&otilde;es devem ser informados de acordo com os padr&otilde;es para nomenclaturas de esta&ccedil;&otilde;es estabelecidos na instala&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Os c&oacute;digos das esta&ccedil;&otilde;es podem ser informados de forma hierarquizada, representando, desta forma, um grupo de esta&ccedil;&otilde;es. </P>
<P>Se for informado, por exemplo, o c&oacute;digo de esta&ccedil;&atilde;o "A", o usu&aacute;rio poder&aacute; utilizar as esta&ccedil;&otilde;es cujos nomes sejam iniciados com a letra " A".</FONT> </P>
<FONT SIZE=2><P>Da mesma forma, se informadas as letras "XY", o usu&aacute;rio poder&aacute; utilizar as esta&ccedil;&otilde;es cujos c&oacute;digos iniciem pelas letras "XY".</FONT> </P>
<FONT SIZE=2><P>Se nenhuma esta&ccedil;&atilde;o for informada, ser&aacute; assumido que o usu&aacute;rio poder&aacute; trabalhar em todas esta&ccedil;&otilde;es da instala&ccedil;&atilde;o.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Confirme</B> - Indicador de confirma&ccedil;&atilde;o de opera&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"S" - Para confirmar a opera&ccedil;&atilde;o;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"N" - Para cancelar a opera&ccedil;&atilde;o.</FONT> </P></DIR>
</DIR>

<B><FONT SIZE=5><P><A NAME="Exclu">Exclus&atilde;o de usu&aacute;rio/perfil </A></P>
</B></FONT><FONT SIZE=2><P>Esta opera&ccedil;&atilde;o permite a exclus&atilde;o de usu&aacute;rios comuns ou perfis modelo das bases de dados do Sistema de Seguran&ccedil;a.</FONT> </P>
<FONT SIZE=2><P>Atrav&eacute;s desta opera&ccedil;&atilde;o &eacute; poss&iacute;vel excluir um perfil modelo, mesmo que ele possua v&iacute;nculo com outros usu&aacute;rios. Neste caso, os usu&aacute;rios ser&atilde;o desvinculados do perfil modelo e perder&atilde;o as habilita&ccedil;&otilde;es que lhes foram atribu&iacute;das atrav&eacute;s da vincula&ccedil;&atilde;o. Os usu&aacute;rios ficar&atilde;o com <I>status</I> "a liberar" e s&oacute; poder&atilde;o efetuar novo <I>logon</I>, caso sejam processadas as suas libera&ccedil;&otilde;es.</FONT> </P>
<FONT SIZE=2><P>Todo usu&aacute;rio de n&iacute;vel de acesso 99 est&aacute; habilitado a executar qualquer opera&ccedil;&atilde;o do Sistema de Seguran&ccedil;a, inclusive a exclus&atilde;o de usu&aacute;rio. Por&eacute;m, para que o usu&aacute;rio de n&iacute;vel de acesso 98 possa efetuar a exclus&atilde;o de um usu&aacute;rio, ele deve atender determinados requisitos, que se encontram relacionados nesta se&ccedil;&atilde;o, no item "Usu&aacute;rios e habilita&ccedil;&otilde;es", t&oacute;pico "Introdu&ccedil;&atilde;o", subt&oacute;pico "Respons&aacute;veis pelos cadastramentos".</FONT> </P>
<FONT SIZE=2><P>Para excluir um usu&aacute;rio, deve-se utilizar o menu de opera&ccedil;ao "CADUSU", opera&ccedil;&atilde;o "EXC".</FONT> </P>
<B><FONT SIZE=2><P>CAMPOS DA TELA</B></FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Numero</B> - N&uacute;mero do usu&aacute;rio.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Nome</B> - Nome do usu&aacute;rio.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Codigo</B> - C&oacute;digo do usu&aacute;rio.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Livre</B> - Dado livre a respeito do usu&aacute;rio.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Sigla da Empresa</B> - Sigla da empresa do usu&aacute;rio.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Area</B> - C&oacute;digo da &aacute;rea do usu&aacute;rio.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Ambiente</B> - C&oacute;digo do ambiente no qual o usu&aacute;rio poder&aacute; obter acesso.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Nivel de acesso</B> - Poder de acesso do usu&aacute;rio definido para o Sistema de Seguran&ccedil;a.</FONT> </P>
<FONT SIZE=2><P>Caso o usu&aacute;rio a ser exclu&iacute;do seja um perfil modelo, este campo n&atilde;o ser&aacute; apresentado.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Integrado com o Marc</B> - Indicador de que o <I>logon</I> do usu&aacute;rio ser&aacute; efetuado atrav&eacute;s de integra&ccedil;&atilde;o com o <I>Marc</I>.</FONT> </P>
<FONT SIZE=2><P>Caso o usu&aacute;rio a ser exclu&iacute;do seja um perfil modelo, este campo n&atilde;o ser&aacute; apresentado.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Validade</B> - Data final de validade do cadastro do usu&aacute;rio.</FONT> </P>
<FONT SIZE=2><P>Caso o usu&aacute;rio a ser exclu&iacute;do seja um perfil modelo, este campo n&atilde;o ser&aacute; apresentado.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Alteracao de senha</B> - C&oacute;digo do controle de exig&ecirc;ncia de troca de senha do usu&aacute;rio.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Dias Habilitados </B>- Indicador de controle de dias nos quais o usu&aacute;rio est&aacute; habilitado a efetuar <I>logon</I>.</FONT> </P>
<FONT SIZE=2><P>Caso o usu&aacute;rio a ser exclu&iacute;do seja um perfil modelo, este campo n&atilde;o ser&aacute; apresentado.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Unidades Autorizadas</B>:</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Empresa</B> - C&oacute;digo da empresa na qual o usu&aacute;rio tem autoriza&ccedil;&atilde;o de acesso.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Estabelecimento</B> - C&oacute;digo do estabelecimento no qual o usu&aacute;rio tem autoriza&ccedil;&atilde;o de acesso.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Unidade</B> - C&oacute;digo da unidade na qual o usu&aacute;rio tem autoriza&ccedil;&atilde;o de acesso.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Estacoes Habilitadas</B> - C&oacute;digos das esta&ccedil;&otilde;es da instala&ccedil;&atilde;o nas quais o usu&aacute;rio pode trabalhar.</FONT> </P>
<FONT SIZE=2><P>Exclui mesmo existindo v&iacute;nculo com usu&aacute;rios (S/N) - Indicador de exclus&atilde;o incondicional de perfil modelo, caso se esteja processando a exclus&atilde;o de um perfil modelo.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"S" - Para excluir o perfil modelo, independente de existirem usu&aacute;rios a ele vinculados.</FONT> </P>
<FONT SIZE=2><P>Neste caso, os usu&aacute;rios ser&atilde;o desvinculados do perfil modelo, perdendo as habilita&ccedil;&otilde;es que foram herdadas do perfil atrav&eacute;s da vincula&ccedil;&atilde;o. Os usu&aacute;rios ficam com <I>status</I> "a liberar" e s&oacute; poder&atilde;o efetuar novo <I>logon</I>, caso sejam processadas as suas libera&ccedil;&otilde;es.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"N" - Para n&atilde;o excluir o perfil modelo caso existam usu&aacute;rios a ele vinculados.</FONT> </P></DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Confirme</B> - Indicador de confirma&ccedil;&atilde;o de opera&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"S" - Para confirmar a opera&ccedil;&atilde;o de exclus&atilde;o;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"N" - Para cancelar a opera&ccedil;&atilde;o.</FONT> </P></DIR>
</DIR>

<B><FONT SIZE=5><P><A NAME="Defau">Cadastramento de defaults de usu&aacute;rio</A></B></FONT> </P>
<FONT SIZE=2><P>O Sistema de Seguran&ccedil;a permite que sejam cadastrados, para cada usu&aacute;rio, valores de campos que s&atilde;o comumente utilizados por ele e que, por isso, ser&atilde;o assumidos em diversas transa&ccedil;&otilde;es do SADS, caso n&atilde;o tenham sido informados.</FONT> </P>
<FONT SIZE=2><P>Pode-se ent&atilde;o definir, para um usu&aacute;rio, os valores <I>default</I> dos seguintes campos: impressora, <I>usercode</I>, ambiente, empresa, estabelecimento e unidade.</FONT> </P>
<FONT SIZE=2><P>Al&eacute;m disso, pode-se tamb&eacute;m definir, especificamente para um usu&aacute;rio, qual ser&aacute; a tela, programa, mensagem ou contexto a ser encadeado ap&oacute;s seu <I>logon</I> ou <I>logoff</I>.</FONT> </P>
<FONT SIZE=2><P>Atrav&eacute;s da tabela SBPM6004, pode-se definir qual a resposta que ser&aacute; encadeada ap&oacute;s o <I>logon</I> e o <I>logoff</I> em uma esta&ccedil;&atilde;o, em um grupo de esta&ccedil;&otilde;es (desde que haja hierarquia nos c&oacute;digos das esta&ccedil;&otilde;es) ou em todas as esta&ccedil;&otilde;es n&atilde;o explicitadas na tabela - pelo c&oacute;digo de esta&ccedil;&atilde;o "DEFAULT".</FONT> </P>
<FONT SIZE=2><P>Maiores detalhes a respeito desta tabela, deve-se consultar a se&ccedil;&atilde;o V, "Parametriza&ccedil;&otilde;es do SADS".</FONT> </P>
<FONT SIZE=2><P>Por&eacute;m, as respostas ap&oacute;s o <I>logon</I>, definidas nesta tabela, s&oacute; ser&atilde;o encadeadas pelo Sistema de Seguran&ccedil;a se forem satisfeitas as seguintes condi&ccedil;&otilde;es:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Se n&atilde;o houver nenhuma parametriza&ccedil;&atilde;o de resposta ap&oacute;s o <I>logon</I> cadastrada especificamente para o usu&aacute;rio, em seu cadastro no Sistema de Seguran&ccedil;a.</FONT> </P>
<FONT SIZE=2><P>Caso tenha sido cadastrada a resposta ap&oacute;s o <I>logon</I> para o usu&aacute;rio, esta ser&aacute; ent&atilde;o a resposta a ser encadeada.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Se nenhuma transa&ccedil;&atilde;o tiver sido solicitada antes da execu&ccedil;&atilde;o do <I>logon</I>.</FONT> </P>
<FONT SIZE=2><P>Caso contr&aacute;rio, a transa&ccedil;&atilde;o previamente solicitada ser&aacute; apresentada ap&oacute;s o <I>logon</I>, se o usu&aacute;rio estiver habilitado a ela. De outro modo, ser&aacute; apresentada a mensagem "S0110 - INFORME UM APLICATIVO QUE VOCE POSSA UTILIZAR".</FONT> </P></DIR>

<FONT SIZE=2><P>N&atilde;o se pode cadastrar <I>defaults</I> para perfil modelo, pois os <I>defaults</I> s&atilde;o valores de campos bastante espec&iacute;ficos para cada um dos usu&aacute;rios.</FONT> </P>
<FONT SIZE=2><P>Todo usu&aacute;rio de n&iacute;vel de acesso 99 est&aacute; habilitado a executar qualquer opera&ccedil;&atilde;o do Sistema de Seguran&ccedil;a, inclusive o cadastramento de <I>defaults</I> de usu&aacute;rio. Por&eacute;m, o usu&aacute;rio de n&iacute;vel de acesso 98, para que possa efetuar esta opera&ccedil;&atilde;o, deve atender determinados requisitos, que se encontram relacionados nesta se&ccedil;&atilde;o, no item "Usu&aacute;rios e habilita&ccedil;&otilde;es", t&oacute;pico "Introdu&ccedil;&atilde;o", subt&oacute;pico "Respons&aacute;veis pelos cadastramentos".</FONT> </P>
<FONT SIZE=2><P>Para cadastrar os <I>defaults</I> de um usu&aacute;rio, deve-se utilizar o menu de opera&ccedil;&atilde;o "CADUSU", opera&ccedil;&atilde;o "DEF".</FONT> </P>
<B><FONT SIZE=2><P>CAMPOS DA TELA</B></FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Usuario</B> - N&uacute;mero, nome e c&oacute;digo do usu&aacute;rio.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Impressora</B> - C&oacute;digo da impressora <I>default</I> do usu&aacute;rio.</FONT> </P>
<FONT SIZE=2><P>O c&oacute;digo da impressora ser&aacute; utilizado nas impress&otilde;es do SADS, sendo automaticamente assumido caso o usu&aacute;rio n&atilde;o informe um c&oacute;digo de impressora qualquer nas telas de disparo de impress&atilde;o.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Usercode </B>- C&oacute;digo do <I>usercode</I> <I>default</I> do usu&aacute;rio.</FONT> </P>
<FONT SIZE=2><P>O <I>usercode</I> <I>default</I> ser&aacute; utilizado nas gera&ccedil;&otilde;es e libera&ccedil;&otilde;es de elementos do SADS e nas compila&ccedil;&otilde;es e <I>binder</I> de programas, sendo automaticamente assumido caso o usu&aacute;rio n&atilde;o informe um <I>usercode</I> no momento do disparo de tais transa&ccedil;&otilde;es.</FONT> </P>
<FONT SIZE=2><P>Na inclus&atilde;o do <I>usercode</I> <I>default</I>, se o usu&aacute;rio respons&aacute;vel pela inclus&atilde;o possuir n&iacute;vel de acesso igual a 98 ou 99, o <I>usercode</I> informado ser&aacute; gravado na lista de elementos "SEGUSER" do usu&aacute;rio. Esta lista de elementos conter&aacute; todos os<I> usercodes </I>nos quais o usu&aacute;rio estar&aacute; autorizado a gerar e liberar elementos do SADS e disparar compila&ccedil;&otilde;es e <I>binder</I>. </P>
<P>Por outro lado, se o respons&aacute;vel pela inclus&atilde;o do <I>usercode</I> <I>default</I> n&atilde;o possuir n&iacute;vel de acesso igual a 98 ou 99, ent&atilde;o ser&aacute; feita a consist&ecirc;ncia da exist&ecirc;ncia do <I>usercode</I> <I>default</I> na lista de elementos "SEGUSER", que dever&aacute; obrigatoriamente existir.</FONT> </P>
<FONT SIZE=2><P>No momento da gera&ccedil;&atilde;o de elementos do SADS, compila&ccedil;&atilde;o ou binder, &eacute; verificado se o <I>usercode</I> informado pelo usu&aacute;rio pertence &agrave; sua lista de elementos "SEGUSER". Caso negativo, n&atilde;o poder&aacute; ser processada a opera&ccedil;&atilde;o no referido <I>usercode</I>.</FONT> </P>
<FONT SIZE=2><P>Pode-se informar "<I>Marc</I>" como <I>usercode</I> <I>default</I>, para que seja ent&atilde;o assumido o <I>usercode</I> do <I>logon</I> do <I>Marc</I>.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Ambiente</B> - C&oacute;digo do ambiente <I>default</I> do usu&aacute;rio.</FONT> </P>
<FONT SIZE=2><P>O ambiente <I>default</I> ser&aacute; utilizado no momento do <I>logon</I>, quando houver integra&ccedil;&atilde;o do <I>logon</I> com o <I>Marc</I>, ou quando ele n&atilde;o for informado e o usu&aacute;rio possuir habilita&ccedil;&atilde;o para ambos os ambientes (AMBIENTE = "A").</FONT> </P>
<FONT SIZE=2><P>Para efetuar a integra&ccedil;&atilde;o do <I>logon</I> com o <I>Marc</I>, o ambiente e as unidades autorizadas, a serem assumidos no momento do <I>logon</I>, ser&atilde;o obtidos do cadastro do usu&aacute;rio, caso sejam espec&iacute;ficas, ou dos <I>defaults</I> cadastrados para o usu&aacute;rio, que, neste caso, para integra&ccedil;&atilde;o com o <I>Marc</I>, obrigatoriamente devem ter sido cadastrados. </P>
<P>Caso o usu&aacute;rio possua ambiente espec&iacute;fico, "T" ou "P", n&atilde;o ser&aacute; permitido cadastrar seu ambiente <I>default</I>, pois aquele ser&aacute; o assumido.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Empresa</B> - C&oacute;digo da empresa <I>default</I> do usu&aacute;rio.</FONT> </P>
<FONT SIZE=2><P>A empresa <I>default</I> ser&aacute; utilizada no momento do <I>logon</I>, quando houver integra&ccedil;&atilde;o do <I>logon</I> com o <I>Marc</I>, ou quando ela n&atilde;o for informada e o usu&aacute;rio possuir habilita&ccedil;&atilde;o a v&aacute;rias empresas (EMPRESA = "999"). </P>
</FONT><P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Estabelecimento </B>- C&oacute;digo do estabelecimento <I>default</I> do usu&aacute;rio.</FONT> </P>
<FONT SIZE=2><P>O estabelecimento <I>default</I> ser&aacute; utilizado no momento do <I>logon</I>, quando houver integra&ccedil;&atilde;o do <I>logon</I> com o <I>Marc</I>, ou quando ele n&atilde;o for informado e o usu&aacute;rio possuir habilita&ccedil;&atilde;o a v&aacute;rios estabelecimentos (ESTABELECIMENTO = "9999"). </P>
</FONT><P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Unidade</B> - C&oacute;digo da unidade <I>default</I> do usu&aacute;rio.</FONT> </P>
<FONT SIZE=2><P>A unidade <I>default</I> ser&aacute; utilizada no momento do <I>logon</I>, quando houver integra&ccedil;&atilde;o do <I>logon</I> com o <I>Marc</I>, ou quando ela n&atilde;o for informada e o usu&aacute;rio possuir habilita&ccedil;&atilde;o a v&aacute;rias unidades (UNIDADE = "999"). </P>
</FONT><P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Resposta apos logon</B></FONT> </P>
<FONT SIZE=2><P>Uma vez executada com sucesso a habilita&ccedil;&atilde;o para in&iacute;cio da sess&atilde;o SADS, ser&aacute; encadeado o aplicativo anteriormente requisitado pelo usu&aacute;rio. Se o <I>logon</I> tiver sido atrav&eacute;s de integra&ccedil;&atilde;o com o <I>Marc</I>, ou se nenhum aplicativo houver sido anteriormente disparado, ser&aacute; encadeada ent&atilde;o a resposta ap&oacute;s <I>logon</I> cadastrada para o usu&aacute;rio ou, caso esta n&atilde;o esteja cadastrada, ser&aacute; encadeada a resposta ap&oacute;s <I>logon</I> cadastrada na tabela SBPM6004. </P>
<P>Maiores detalhes a respeito desta tabela deve-se consultar a se&ccedil;&atilde;o V, "Parametriza&ccedil;&otilde;es do SADS".</FONT> </P>
<FONT SIZE=2><P>Se o usu&aacute;rio efetuar o <I>logon</I> disparando diretamente seu menu de op&ccedil;&atilde;o (SBT02), para o SADS ele n&atilde;o estar&aacute; inserido em nenhum contexto. Nesse caso, quando ele transmitir o primeiro comando utilizando a navega&ccedil;&atilde;o, o SADS apresentar&aacute; a tela de escolha de contexto, pois n&atilde;o ser&aacute; poss&iacute;vel trabalhar em uma sess&atilde;o SADS sem estar inserido em um contexto qualquer.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Tipo (P/T/C/M)</B> - Tipo da resposta a ser encadeada ao usu&aacute;rio ap&oacute;s o <I>logon</I>.</FONT> </P>
<FONT SIZE=2><P>O tipo pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"T" - Para indicar que a resposta a ser encadeada ap&oacute;s o <I>logon</I> &eacute; uma tela.</FONT> </P>
<FONT SIZE=2><P>Ao apresentar a tela, seu c&oacute;digo de transa&ccedil;&atilde;o ser&aacute; limpado.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"P" - Para indicar que a resposta a ser encadeada ap&oacute;s o <I>logon</I> &eacute; um <I>trancode</I> v&aacute;lido, cadastrado no <I>Utility</I>, relacionado a um determinado programa.</FONT> </P>
<FONT SIZE=2><P>Neste caso, se for desej&aacute;vel o disparo de uma determinada op&ccedil;&atilde;o deste <I>trancode</I>, &eacute; necess&aacute;rio informar, como deve ser recebido pelo COMS, o<I> trancode</I> seguido dos argumentos necess&aacute;rios &agrave; execu&ccedil;&atilde;o da transa&ccedil;&atilde;o.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"M" - Para indicar que a resposta a ser encadeada ap&oacute;s o <I>logon</I> ser&aacute; uma mensagem, que ser&aacute; apresentada no rodap&eacute; da tela, composta em GBL-MENSAGEM.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"C" - Para indicar que a resposta a ser encadeada ap&oacute;s o <I>logon</I> ser&aacute; a tela inicial do contexto especificado.</FONT> </P>
<FONT SIZE=2><P>Ap&oacute;s a cria&ccedil;&atilde;o de um contexto qualquer e a constru&ccedil;&atilde;o de sua navega&ccedil;&atilde;o, pode-se definir, caso se queira, a tela inicial deste contexto como sendo a tela a ser enviada ao usu&aacute;rio ap&oacute;s o <I>logon</I> ou <I>logoff</I>.</FONT> </P>
<FONT SIZE=2><P>Caso n&atilde;o tenha sido informado o c&oacute;digo do contexto, ser&aacute; encadeada a tela de escolhas de contextos - STKT0004. O administrador de seguran&ccedil;a dever&aacute; alterar o desenho desta tela para conter todos os contextos da instala&ccedil;&atilde;o.</FONT> </P></DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Resposta</B> - Resposta a ser enviada ap&oacute;s o <I>logon</I> do usu&aacute;rio.</FONT> </P>
<FONT SIZE=2><P>A resposta, conforme citado anteriormente, pode ser o c&oacute;digo de uma tela qualquer, cujo desenho j&aacute; esteja cadastrado no reposit&oacute;rio de dados, um trancode v&aacute;lido, uma mensagem ou o c&oacute;digo de um contexto.</FONT> </P>
<FONT SIZE=2><P>Para informar a resposta, pode-se utilizar duas linhas de 40 (quarenta) posi&ccedil;&otilde;es.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Resposta apos Logoff</B></FONT> </P>
<FONT SIZE=2><P>As respostas ap&oacute;s o logoff definidas para o usu&aacute;rio ser&atilde;o encadeadas pelo Sistema de Seguran&ccedil;a sempre que for dado um FIM no campo ACAO ou informada a op&ccedil;&atilde;o 99.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Tipo (P/T/C/M)</B> - Tipo da resposta a ser encadeada ao usu&aacute;rio ap&oacute;s o <I>logoff</I>.</FONT> </P>
<FONT SIZE=2><P>O tipo pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"T" - Para indicar que a resposta a ser encadeada ap&oacute;s o<I> logoff </I>&eacute; uma tela.</FONT> </P>
<FONT SIZE=2><P>Ao apresentar a tela, seu c&oacute;digo de transa&ccedil;&atilde;o ser&aacute; limpado.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"P" - Para indicar que a resposta a ser encadeada ap&oacute;s o <I>logoff </I>&eacute; um <I>trancode</I> v&aacute;lido, cadastrado no <I>Utility</I>, relacionado a um determinado programa.</FONT> </P>
<FONT SIZE=2><P>Neste caso, se for desej&aacute;vel o disparo de uma determinada op&ccedil;&atilde;o deste trancode, &eacute; necess&aacute;rio informar, como deve ser recebido pelo COMS, o <I>trancode</I> seguido dos argumentos necess&aacute;rios &agrave; execu&ccedil;&atilde;o da transa&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Para que seja efetuado um <I>close</I> na janela ap&oacute;s o encerramento da sess&atilde;o COMS, um dos seguintes <I>trancodes</I> devem ser cadastrados para ser encadeado ap&oacute;s o <I>logoff</I>:</FONT> </P><DIR>

<P><IMG SRC="bullet9.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>SOS02 - Envia para o terminal o comando ?CLOSE;</FONT> </P>
<P><IMG SRC="bullet9.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>SOS03 - Envia para o terminal o comando ?CLOSE;</FONT> </P>
<P><IMG SRC="bullet9.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>SOS03.nn - Envia para o terminal o comando CLOSE precedido de um n&uacute;mero de caracteres "?" semelhante ao valor "nn" especificado;</FONT> </P>
<P><IMG SRC="bullet9.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>SOS04 - &Eacute; feita uma chamada a uma fun&ccedil;&atilde;o do COMS que efetua o encerramento da sess&atilde;o.</FONT> </P></DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"M" - Para indicar que a resposta a ser encadeada ap&oacute;s o<I> logoff </I>ser&aacute; uma mensagem, a ser apresentada no rodap&eacute; da tela, composta em GBL-MENSAGEM.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"C" - Para indicar que a resposta a ser encadeada ap&oacute;s o<I> logoff</I> ser&aacute; a tela inicial do contexto especificado.</FONT> </P>
<FONT SIZE=2><P>Ap&oacute;s a cria&ccedil;&atilde;o de um contexto qualquer e a constru&ccedil;&atilde;o de sua navega&ccedil;&atilde;o, pode-se definir, caso se queira, a tela inicial deste contexto como sendo a tela a ser enviada ao usu&aacute;rio ap&oacute;s o <I>logoff</I>.</FONT> </P>
<FONT SIZE=2><P>Caso n&atilde;o tenha sido informado o c&oacute;digo do contexto, ser&aacute; encadeada a tela de escolhas de contextos - STKT0004. O administrador de seguran&ccedil;a dever&aacute; alterar o desenho desta tela para conter todos os contextos da instala&ccedil;&atilde;o.</FONT> </P></DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Resposta</B> - Resposta a ser enviada ap&oacute;s o <I>logoff </I>do usu&aacute;rio.</FONT> </P>
<FONT SIZE=2><P>A resposta, conforme citado anteriormente, pode ser o c&oacute;digo de uma tela qualquer, cujo desenho j&aacute; esteja cadastrado no reposit&oacute;rio de dados, um <I>trancode </I>v&aacute;lido, uma mensagem ou o c&oacute;digo de um contexto.</FONT> </P>
<FONT SIZE=2><P>Para informar a resposta, pode-se utilizar duas linhas de 40 (quarenta) posi&ccedil;&otilde;es.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Confirme</B> - Indicador de confirma&ccedil;&atilde;o de opera&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"S" - Para confirmar a opera&ccedil;&atilde;o;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"N" - Para cancelar a opera&ccedil;&atilde;o.</FONT> </P></DIR>
</DIR>

<B><FONT SIZE=5><P><A NAME="Vincu">Vincula&ccedil;&atilde;o/desvincula&ccedil;&atilde;o de usu&aacute;rio a perfis</A></B></FONT> </P>
<P><HR></P>
<FONT SIZE=2><P>O usu&aacute;rio designado pelo SADS/SS como perfil modelo &eacute; aquele que possui dados comuns a um grupo de usu&aacute;rios.</FONT> </P>
<FONT SIZE=2><P>Pessoas de uma mesma equipe, que comumente trabalham com os mesmos aplicativos, executando fun&ccedil;&otilde;es similares, possuem dados semelhantes em seus cadastramentos e habilita&ccedil;&otilde;es. Nesta situa&ccedil;&atilde;o, &eacute; aconselh&aacute;vel que se crie um perfil modelo, contendo esses dados comuns, e o relacione a todos os usu&aacute;rios pertencentes &agrave; equipe, atrav&eacute;s da opera&ccedil;&atilde;o de vincula&ccedil;&atilde;o de usu&aacute;rio a perfil.</FONT> </P>
<FONT SIZE=2><P>A vantagem de se criar um perfil modelo &eacute; que todas as caracter&iacute;sticas e habilita&ccedil;&otilde;es, comuns aos usu&aacute;rios, s&atilde;o cadastradas uma &uacute;nica vez para o perfil, sendo herdadas por todos os usu&aacute;rios a ele vinculados. Qualquer altera&ccedil;&atilde;o nestas habilita&ccedil;&otilde;es passar&aacute; a valer tamb&eacute;m para os usu&aacute;rios vinculados, ap&oacute;s efetuar suas libera&ccedil;&otilde;es.</FONT> </P>
<FONT SIZE=2><P>Para vincular um usu&aacute;rio a um perfil modelo, &eacute; necess&aacute;rio que o perfil j&aacute; esteja cadastrado.</FONT> </P>
<FONT SIZE=2><P>Um usu&aacute;rio pode ser vinculado a um ou mais perfis modelo, de acordo com as fun&ccedil;&otilde;es afins que compartilha com tais perfis.</FONT> </P>
<FONT SIZE=2><P>No momento da vincula&ccedil;&atilde;o &eacute; estipulada uma prioridade para a vincula&ccedil;&atilde;o, a fim de que, havendo coincid&ecirc;ncia ou discord&acirc;ncia nas habilita&ccedil;&otilde;es a serem herdadas pelo usu&aacute;rio, caso esteja vinculado a mais de um perfil, seja ent&atilde;o respeitada a prioridade destas vincula&ccedil;&otilde;es.</FONT> </P>
<FONT SIZE=2><P>Todo usu&aacute;rio, antes que possa efetuar <I>logon</I> e ap&oacute;s ter sido finalizado todo o seu cadastramento, deve ser submetido &agrave; opera&ccedil;&atilde;o de libera&ccedil;&atilde;o. Atrav&eacute;s deste processo &eacute; que s&atilde;o sintetizadas suas habilita&ccedil;&otilde;es que foram cadastradas especificamente para o mesmo ou que foram herdadas dos v&aacute;rios perfis modelo aos quais ele foi porventura vinculado.</FONT> </P>
<FONT SIZE=2><P>Se houver discord&acirc;ncia entre as habilita&ccedil;&otilde;es do usu&aacute;rio e dos perfis aos quais ele estiver vinculado, a prioridade ser&aacute; :</FONT> </P>
<OL>

<FONT SIZE=2><LI>Habilita&ccedil;&otilde;es dos aplicativos do usu&aacute;rio; e depois</FONT> </LI>
<FONT SIZE=2><LI>Habilita&ccedil;&otilde;es dos aplicativos dos perfis, em ordem da prioridade de cadastramento.</FONT> </LI></OL>

<FONT SIZE=2><P>Na libera&ccedil;&atilde;o do usu&aacute;rio, as discord&acirc;ncias de unidades autorizadas do usu&aacute;rio e dos v&aacute;rios perfis vinculados ser&atilde;o resolvidas da seguinte forma:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Se o usu&aacute;rio possuir unidades autorizadas espec&iacute;ficas ou 0's :</FONT> </P>
<FONT SIZE=2><P>Vai herdar as unidades do usu&aacute;rio e estas n&atilde;o poder&atilde;o ser informadas na opera&ccedil;&atilde;o de vincula&ccedil;&atilde;o a perfil, desde que exatamente iguais &agrave;s unidades do usu&aacute;rio.</P>
</FONT><P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Se o usu&aacute;rio possuir unidades autorizadas igual a 9's e o perfil possuir unidades espec&iacute;ficas e diferentes de 0's: </P>
<P>Vai herdar as unidades do perfil, por&eacute;m estas poder&atilde;o ser informadas na opera&ccedil;&atilde;o de vincula&ccedil;&atilde;o a perfil.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Se o usu&aacute;rio e o perfil possu&iacute;rem unidades autorizadas igual a 9's :</FONT> </P>
<FONT SIZE=2><P>As unidades poder&atilde;o ser informadas na opera&ccedil;&atilde;o de vincula&ccedil;&atilde;o, caso sejam espec&iacute;ficas (nnn). Neste caso, prevalecer&atilde;o as unidades informadas na vincula&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Se as unidades n&atilde;o forem informadas no momento da vincula&ccedil;&atilde;o, os aplicativos ser&atilde;o habilitados com `9's .</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Se as unidades autorizadas do usu&aacute;rio forem iguais a 9's e as do perfil forem iguais a 0's:</FONT> </P>
<FONT SIZE=2><P>As unidades poder&atilde;o ser informadas na opera&ccedil;&atilde;o de vincula&ccedil;&atilde;o, caso sejam espec&iacute;ficas (nnn). Neste caso, a unidade informada ser&aacute; sobreposta em todas as habilita&ccedil;&otilde;es de aplicativos do perfil.</FONT> </P>
<FONT SIZE=2><P>Se as unidades n&atilde;o forem informadas no momento da vincula&ccedil;&atilde;o, os aplicativos ser&atilde;o habilitados com `9's (que &eacute; a defini&ccedil;&atilde;o do usu&aacute;rio).</FONT> </P>
<FONT SIZE=2><P>Este procedimento ser&aacute; sempre efetuado quando houver incompatibilidade entre as unidades autorizadas do perfil e do usu&aacute;rio.</FONT> </P></DIR>

<FONT SIZE=2><P>A cada vez que &eacute; alterado o cadastramento do usu&aacute;rio - unidades autorizadas ou habilita&ccedil;&otilde;es - ou forem alterados os perfis aos quais ele est&aacute; vinculado, deve-se ent&atilde;o proceder &agrave; sua libera&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Um usu&aacute;rio vinculado pode ter habilita&ccedil;&otilde;es pr&oacute;prias de aplicativos, transa&ccedil;&otilde;es e elementos, diferentes daquelas cadastradas para os perfis a ele relacionados. Desta forma, &eacute; poss&iacute;vel redefinir - restringir ou ampliar - as habilita&ccedil;&otilde;es que um usu&aacute;rio herda de seus perfis modelo.</FONT> </P>
<FONT SIZE=2><P>Um usu&aacute;rio vinculado pode ser desligado de qualquer um de seus perfis a qualquer momento.</FONT> </P>
<FONT SIZE=2><P>O usu&aacute;rio a ser vinculado a um perfil pode ou n&atilde;o estar cadastrado. Se ainda n&atilde;o tiver sido cadastrado, ser&aacute; exibida a tela para defini&ccedil;&atilde;o de seus dados pr&oacute;prios e, a seguir, ser&aacute; encadeada a tela para vincula&ccedil;&atilde;o do usu&aacute;rio aos perfis modelo desejados.</FONT> </P>
<FONT SIZE=2><P>Qualquer altera&ccedil;&atilde;o efetuada nas habilita&ccedil;&otilde;es de um perfil modelo ser&aacute; herdada por todos os usu&aacute;rios a ele vinculados.</FONT> </P>
<FONT SIZE=2><P>Ap&oacute;s desvinculado, o usu&aacute;rio perde todas as habilita&ccedil;&otilde;es herdadas do perfil modelo. A partir deste momento, portanto, nenhuma das modifica&ccedil;&otilde;es realizadas no cadastramento do perfil ser&aacute; herdada pelo usu&aacute;rio.</FONT> </P>
<FONT SIZE=2><P>O usu&aacute;rio poder&aacute; ser vinculado a v&aacute;rios perfis. Para cada perfil a ele vinculado, haver&aacute; a possibilidade de se cadastrar, opcionalmente, unidades autorizadas, tipo da habilita&ccedil;&atilde;o e n&iacute;vel de acesso, que ser&atilde;o sobrepostos em todos as habilita&ccedil;&otilde;es de aplicativos do perfil, para aquele usu&aacute;rio, observando as regras da libera&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Tanto o perfil quanto o usu&aacute;rio poder&atilde;o possuir listas de habilita&ccedil;&otilde;es de elementos. A prioridade destas habilita&ccedil;&otilde;es funciona como a de unidades autorizadas. Se existirem elementos habilitados iguais para o usu&aacute;rio e para os perfis, valer&atilde;o primeiramente as habilita&ccedil;&otilde;es de elemento do usu&aacute;rio e, depois, os elementos dos perfis, em ordem de prioridade.</FONT> </P>
<B><FONT SIZE=5><P><A NAME="Desvi">Vincula&ccedil;&atilde;o/desvincula&ccedil;&atilde;o de usu&aacute;rio j&aacute; cadastrado a perfis </A></P>
</B></FONT><FONT SIZE=2><P>Atrav&eacute;s desta opera&ccedil;&atilde;o &eacute; poss&iacute;vel vincular um usu&aacute;rio j&aacute; cadastrado a um ou v&aacute;rios perfis modelo, tamb&eacute;m j&aacute; cadastrados.</FONT> </P>
<FONT SIZE=2><P>Tamb&eacute;m &eacute; poss&iacute;vel excluir a vincula&ccedil;&atilde;o entre um usu&aacute;rio e qualquer um de seus perfis.</FONT> </P>
<FONT SIZE=2><P>Todo usu&aacute;rio de n&iacute;vel de acesso 99 est&aacute; habilitado a executar qualquer opera&ccedil;&atilde;o do Sistema de Seguran&ccedil;a, inclusive a vincula&ccedil;&atilde;o/desvincula&ccedil;&atilde;o de usu&aacute;rio. Por&eacute;m, para que o usu&aacute;rio de n&iacute;vel de acesso 98 possa efetuar esta opera&ccedil;&atilde;o, deve atender determinados requisitos, que se encontram relacionados nesta se&ccedil;&atilde;o, no item "Usu&aacute;rios e habilita&ccedil;&otilde;es", t&oacute;pico "Introdu&ccedil;&atilde;o", subt&oacute;pico "Respons&aacute;veis pelos cadastramentos".</FONT> </P>
<FONT SIZE=2><P>Para vincular um usu&aacute;rio a perfis modelo, deve-se utilizar o menu de opera&ccedil;&atilde;o "VINUSU", opera&ccedil;&atilde;o "VIN".</FONT> </P>
<B><FONT SIZE=2><P>CAMPOS DA TELA</B></FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Usuario</B> - N&uacute;mero, nome e c&oacute;digo do usu&aacute;rio que est&aacute; sendo vinculado ao perfil.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Prior</B> - Prioridade de vincula&ccedil;&atilde;o do usu&aacute;rio ao perfil modelo.</FONT> </P>
<FONT SIZE=2><P>Pode-se informar prioridade de "01" a "99", sendo que a prioridade "01" &eacute; a mais alta e "99" &eacute; a mais baixa.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Perfil</B> - N&uacute;mero do perfil modelo.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Emp</B> - C&oacute;digo da empresa autorizada ao perfil.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Estab</B> - C&oacute;digo do estabelecimento autorizado ao perfil.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Unid</B> - C&oacute;digo da unidade autorizada ao perfil.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Niv</B> - N&iacute;vel de acesso das habilita&ccedil;&otilde;es a serem herdadas do perfil.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Confirme</B> - Indicador de confirma&ccedil;&atilde;o de opera&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"S" - Para confirmar a vincula&ccedil;&atilde;o;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"N" - Para cancelar a opera&ccedil;&atilde;o.</FONT> </P></DIR>
</DIR>

<B><FONT SIZE=5><P><A NAME="Perfi">Inclus&atilde;o de usu&aacute;rio e vincula&ccedil;&atilde;o a perfis</A></B></FONT> </P>
<FONT SIZE=2><P>O usu&aacute;rio a ser vinculado a um perfil pode ou n&atilde;o estar cadastrado. Se ainda n&atilde;o tiver sido cadastrado, ser&aacute; exibida a tela para defini&ccedil;&atilde;o de seus dados pr&oacute;prios e, a seguir, ser&aacute; encadeada a tela para vincula&ccedil;&atilde;o do usu&aacute;rio aos perfis modelo desejados.</FONT> </P>
<FONT SIZE=2><P>Portanto, neste t&oacute;pico n&atilde;o ser&atilde;o informados os campos das telas apresentadas, pelo fato de j&aacute; terem sido descritos nos t&oacute;picos "Cadastramento de usu&aacute;rio/perfil" e "Vincula&ccedil;&atilde;o/desvincula&ccedil;&atilde;o de usu&aacute;rio j&aacute; cadastrado a perfis", respectivamente.</FONT> </P>
<FONT SIZE=2><P>Todo usu&aacute;rio de n&iacute;vel de acesso 99 est&aacute; habilitado a executar qualquer opera&ccedil;&atilde;o do Sistema de Seguran&ccedil;a, inclusive a inclus&atilde;o de usu&aacute;rio e vincula&ccedil;&atilde;o a perfis. Por&eacute;m, o usu&aacute;rio de n&iacute;vel de acesso 98, para que possa efetuar esta opera&ccedil;&atilde;o, deve atender determinados requisitos, que se encontram relacionados nesta se&ccedil;&atilde;o, no item "Usu&aacute;rios e habilita&ccedil;&otilde;es", t&oacute;pico "Introdu&ccedil;&atilde;o", subt&oacute;pico "Respons&aacute;veis pelos cadastramentos".</FONT> </P>
<FONT SIZE=2><P>Para incluir um usu&aacute;rio e vincul&aacute;-lo a perfis modelo, deve-se utilizar o menu de opera&ccedil;&atilde;o "VINUSU", opera&ccedil;&atilde;o "INC".</FONT> </P>
<B><FONT SIZE=5><P><A NAME="Noper">Vincula&ccedil;&atilde;o de novo perfil a usu&aacute;rios</A></B></FONT> </P>
<FONT SIZE=2><P>Um perfil modelo, ap&oacute;s ter sido criado, pode ser associado a v&aacute;rios usu&aacute;rios. Atrav&eacute;s de uma &uacute;nica opera&ccedil;&atilde;o, &eacute; poss&iacute;vel, ent&atilde;o, selecionar os usu&aacute;rios a serem vinculados ao novo perfil e processar a vincula&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>A sele&ccedil;&atilde;o dos usu&aacute;rios a serem vinculados pode ser feita de v&aacute;rias formas: escolhendo-os atrav&eacute;s da empresa/&aacute;rea onde est&atilde;o cadastrados, atrav&eacute;s de n&uacute;meros ou c&oacute;digos e etc.</FONT> </P>
<FONT SIZE=2><P>Apesar de haver v&aacute;rias maneiras de se selecionar os usu&aacute;rios a serem vinculados, somente uma forma de sele&ccedil;&atilde;o deve ser especificada a cada transa&ccedil;&atilde;o. </P>
<P>A prioridade para a vincula&ccedil;&atilde;o do novo perfil a cada um dos usu&aacute;rios ser&aacute; definida como sendo a menor prioridade ainda n&atilde;o vinculada a qualquer outro perfil.</P>
<P>Todo usu&aacute;rio de n&iacute;vel de acesso 99 est&aacute; habilitado a executar qualquer opera&ccedil;&atilde;o do Sistema de Seguran&ccedil;a, inclusive a vincula&ccedil;&atilde;o de novo perfil a usu&aacute;rios. Por&eacute;m, para que o usu&aacute;rio de n&iacute;vel de acesso 98 possa efetuar esta opera&ccedil;&atilde;o, deve atender determinados requisitos, que se encontram relacionados nesta se&ccedil;&atilde;o, no item "Usu&aacute;rios e habilita&ccedil;&otilde;es", t&oacute;pico "Introdu&ccedil;&atilde;o", subt&oacute;pico "Respons&aacute;veis pelos cadastramentos".</FONT> </P>
<FONT SIZE=2><P>Para vincular um novo perfil modelo a v&aacute;rios usu&aacute;rios, deve-se utilizar o menu de opera&ccedil;&atilde;o "VINUSU", opera&ccedil;&atilde;o "NOV".</FONT> </P>
<B><FONT SIZE=2><P>CAMPOS DA TELA</B></FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Perfil </B>- N&uacute;mero do perfil modelo.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Selecao por Sigla Empresa/Area </B>- C&oacute;digo da empresa e &aacute;rea nas quais os usu&aacute;rios a serem vinculados se encontram cadastrados.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Selecao por Perfil Vinculado</B> - N&uacute;mero do perfil modelo ao qual os usu&aacute;rios a serem vinculados j&aacute; se encontram associados.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Selecao por Numero </B>- N&uacute;meros dos usu&aacute;rios a serem vinculados ao novo perfil modelo.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Selecao por Codigo </B>- C&oacute;digos dos usu&aacute;rios a serem vinculados ao novo perfil modelo.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Confirme</B> - Indicador de confirma&ccedil;&atilde;o de opera&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"S" - Para confirmar a vincula&ccedil;&atilde;o;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"N" - Para cancelar a opera&ccedil;&atilde;o.</FONT> </P></DIR>
</DIR>

<B><FONT SIZE=5><P><A NAME="Libusu">Libera&ccedil;&atilde;o de usu&aacute;rio</A></B></FONT> </P>
<P><HR></P>
<FONT SIZE=2><P>Todo usu&aacute;rio, antes que possa efetuar <I>logon</I> e ap&oacute;s ter sido finalizado todo o seu cadastramento, deve ser submetido &agrave; opera&ccedil;&atilde;o de libera&ccedil;&atilde;o. Atrav&eacute;s deste processo &eacute; que s&atilde;o sintetizadas suas habilita&ccedil;&otilde;es, que foram cadastradas especificamente para o mesmo ou que foram herdadas dos v&aacute;rios perfis modelo aos quais ele foi porventura vinculado.</FONT> </P>
<FONT SIZE=2><P>A cada vez que &eacute; alterado o cadastramento do usu&aacute;rio - unidades autorizadas ou habilita&ccedil;&otilde;es - ou forem alterados os perfis aos quais ele est&aacute; vinculado, deve-se ent&atilde;o proceder novamente &agrave; sua libera&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Ap&oacute;s a primeira libera&ccedil;&atilde;o do usu&aacute;rio, ele estar&aacute; apto a efetuar o <I>logon</I>, mesmo se seu cadastramento estiver sendo alterado. &Eacute; importante salientar que a altera&ccedil;&atilde;o de sua empresa, estabelecimento, unidade, esta&ccedil;&atilde;o, ambiente ou dias habilitados passar&aacute; imediatamente a ser considerada assim que processada. Por&eacute;m, para que suas habilita&ccedil;&otilde;es passem a ser consideradas, &eacute; necess&aacute;rio efetuar novamente sua libera&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Na libera&ccedil;&atilde;o do usu&aacute;rio, as discord&acirc;ncias de unidades autorizadas do usu&aacute;rio e dos v&aacute;rios perfis vinculados ser&atilde;o resolvidas da seguinte forma:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Se o usu&aacute;rio possuir unidades autorizadas espec&iacute;ficas ou 0's:</FONT> </P>
<FONT SIZE=2><P>Vai herdar as unidades do usu&aacute;rio e estas n&atilde;o poder&atilde;o ser informadas na opera&ccedil;&atilde;o de vincula&ccedil;&atilde;o a perfil.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Se o usu&aacute;rio possuir unidades autorizadas iguais a 9's e o perfil possuir unidades espec&iacute;ficas e diferentes de 0's:</FONT> </P>
<FONT SIZE=2><P>Vai herdar as unidades do perfil e estas poder&atilde;o ser informadas na opera&ccedil;&atilde;o de vincula&ccedil;&atilde;o a perfil.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Se o usu&aacute;rio e o perfil possu&iacute;rem unidades autorizadas iguais a 9's:</FONT> </P>
<FONT SIZE=2><P>As unidades poder&atilde;o ser informadas na opera&ccedil;&atilde;o de vincula&ccedil;&atilde;o, caso sejam espec&iacute;ficas (nnn). Neste caso, prevalecer&atilde;o as unidades informadas na vincula&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Se as unidades n&atilde;o forem informadas no momento da vincula&ccedil;&atilde;o, os aplicativos ser&atilde;o habilitados com `9's .</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Se as unidades autorizadas do usu&aacute;rio forem iguais a 9's e as do perfil forem iguais a 0's:</FONT> </P>
<FONT SIZE=2><P>As unidades poder&atilde;o ser informadas na opera&ccedil;&atilde;o de vincula&ccedil;&atilde;o, caso sejam espec&iacute;ficas (nnn). Neste caso, a unidade informada ser&aacute; sobreposta em todas as habilita&ccedil;&otilde;es de aplicativos do perfil.</FONT> </P>
<FONT SIZE=2><P>Se as unidades n&atilde;o forem informadas no momento da vincula&ccedil;&atilde;o, os aplicativos ser&atilde;o habilitados com `9's (que &eacute; a defini&ccedil;&atilde;o do usu&aacute;rio).</FONT> </P>
<FONT SIZE=2><P>Este procedimento ser&aacute; sempre efetuado quando houver incompatibilidade entre as unidades autorizadas do perfil e do usu&aacute;rio.</FONT> </P></DIR>

<B><FONT SIZE=5><P><A NAME="Libus">Libera&ccedil;&atilde;o de usu&aacute;rio</A></B></FONT> </P>
<FONT SIZE=2><P>Para liberar um usu&aacute;rio, este deve possuir <I>status</I> "a liberar".</FONT> </P>
<FONT SIZE=2><P>Somente os usu&aacute;rios de de n&iacute;vel de acesso 99 e 98 est&atilde;o habilitados &agrave; opera&ccedil;&atilde;o libera&ccedil;&atilde;o de usu&aacute;rios. Detalhes a respeito de usu&aacute;rios habilitados a efetuar libera&ccedil;&atilde;o de usu&aacute;rios se encontram relacionados nesta se&ccedil;&atilde;o, no item "Usu&aacute;rios e habilita&ccedil;&otilde;es", t&oacute;pico "Introdu&ccedil;&atilde;o", subt&oacute;pico "Respons&aacute;veis pelos cadastramentos". </P>
<P>Para liberar um &uacute;nico usu&aacute;rio, basta informar seu n&uacute;mero ou c&oacute;digo no menu de opera&ccedil;&atilde;o "LIBUSU", opera&ccedil;&atilde;o "LIB", para que a libera&ccedil;&atilde;o seja diretamente disparada, sem a apresenta&ccedil;&atilde;o de nenhuma tela de processamento</FONT> </P>
<B><FONT SIZE=5><P><A NAME="Libvin">Libera&ccedil;&atilde;o de usu&aacute;rios vinculados a um perfil</A></B></FONT> </P>
<FONT SIZE=2><P>Atrav&eacute;s desta opera&ccedil;&atilde;o &eacute; poss&iacute;vel liberar todos os usu&aacute;rios que estejam vinculados a um perfil modelo espec&iacute;fico e que estejam com <I>status</I> "a liberar".</FONT> </P>
<FONT SIZE=2><P>Esta opera&ccedil;&atilde;o deve ser utilizada ap&oacute;s a altera&ccedil;&atilde;o de um perfil modelo que possua usu&aacute;rios vinculados. Para que estes usu&aacute;rios voltem novamente ao <I>status</I> normal, saindo do <I>status</I> de "a liberar", todos eles devem ser submetidos &agrave; libera&ccedil;&atilde;o, que pode ent&atilde;o ser feita atrav&eacute;s de um &uacute;nico disparo de transa&ccedil;&atilde;o.</P>
<P>Somente os usu&aacute;rios de n&iacute;vel de acesso 99 e 98 est&atilde;o habilitados &agrave; opera&ccedil;&atilde;o de libera&ccedil;&atilde;o de usu&aacute;rios. Detalhes a respeito de usu&aacute;rios habilitados a efetuar libera&ccedil;&atilde;o de usu&aacute;rios se encontram relacionados nesta se&ccedil;&atilde;o, no item "Usu&aacute;rios e habilita&ccedil;&otilde;es", t&oacute;pico "Introdu&ccedil;&atilde;o", subt&oacute;pico "Respons&aacute;veis pelos cadastramentos".</P>
<P>Para libera&ccedil;&atilde;o de usu&aacute;rios vinculados a um perfil modelo, deve-se utilizar o menu de opera&ccedil;&atilde;o "LIBUSU", opera&ccedil;&atilde;o "PER".</FONT> </P>
<B><FONT SIZE=2><P>CAMPOS DA TELA</B></FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Perfil </B>- N&uacute;mero e c&oacute;digo do perfil cujos usu&aacute;rios vinculados ser&atilde;o liberados.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Codigo do Perfil </B>- C&oacute;digo do perfil cujos usu&aacute;rios vinculados ser&atilde;o liberados.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Sigla da Empresa </B>- Sigla da empresa do perfil.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Area </B>- &Aacute;rea do perfil.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Ambiente</B> - Ambiente do perfil.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Empresa</B> - C&oacute;digo da empresa autorizada ao perfil.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Estab</B>. - C&oacute;digo do estabelecimento autorizado ao perfil.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Unidade</B> - C&oacute;digo da unidade autorizada ao perfil.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Confirme</B> - Indicador de confirma&ccedil;&atilde;o de opera&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"S" - Para confirmar a libera&ccedil;&atilde;o;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"N" - Para cancelar a opera&ccedil;&atilde;o.</FONT> </P></DIR>
</DIR>

<B><FONT SIZE=5><P><A NAME="Usuali">Sele&ccedil;&atilde;o de usu&aacute;rios "a liberar"</A></B></FONT> </P>
<FONT SIZE=2><P>Atrav&eacute;s desta opera&ccedil;&atilde;o, &eacute; poss&iacute;vel selecionar todos os usu&aacute;rios que se pretende liberar, dentre aqueles que est&atilde;o com <I>status</I> "a liberar".</FONT> </P>
<FONT SIZE=2><P>Pode-se tamb&eacute;m, caso se queira, liberar todos os usu&aacute;rios com tal <I>status</I>, indistintamente, sem que haja sele&ccedil;&atilde;o pr&eacute;via. </P>
<P>Somente os usu&aacute;rios de n&iacute;vel de acesso 99 e 98 est&atilde;o habilitados &agrave; opera&ccedil;&atilde;o de libera&ccedil;&atilde;o de usu&aacute;rios. Detalhes a respeito de usu&aacute;rios habilitados a efetuar libera&ccedil;&atilde;o de usu&aacute;rios se encontram relacionados nesta se&ccedil;&atilde;o, no item &quot;Usu&aacute;rios e habilita&ccedil;&otilde;es&quot;, t&oacute;pico &quot;Introdu&ccedil;&atilde;o&quot;, subt&oacute;pico &quot;Respons&aacute;veis pelos cadastramentos&quot;.</P>
</FONT><P> <FONT SIZE=2>Para selecionar e liberar usu&aacute;rios, deve-se utilizar o menu de opera&ccedil;&atilde;o "LIBUSU", opera&ccedil;&atilde;o "SEL".</FONT> </P>
<B><FONT SIZE=2><P>CAMPOS DA TELA</B></FONT> </P>
<P>&nbsp;</P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Libera&ccedil;&atilde;o de todos os usu&aacute;rios (S)</B> - Indicador de libera&ccedil;&atilde;o de todos os usu&aacute;rios exibidos, sem necessidade de sele&ccedil;&atilde;o individual.</FONT> </P>
<FONT SIZE=2><P>Pode assumir o seguinte valor:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"S" - Para confirmar a libera&ccedil;&atilde;o de todos os usu&aacute;rios com <I>status</I> "a liberar".</FONT> </P></DIR>

<FONT SIZE=2><P>Caso tenha sido especificado que todos os usu&aacute;rio ser&atilde;o liberados, ent&atilde;o n&atilde;o se pode selecionar individualmente os usu&aacute;rios exibidos na tela.</FONT> </P>
<FONT SIZE=2><P>Caso este campo n&atilde;o seja informado, apenas os usu&aacute;rios selecionados ser&atilde;o liberados.</FONT> </P>
<FONT SIZE=2><P>Para cada um dos usu&aacute;rios a serem selecionados, ser&atilde;o apresentados:</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Selecao </B>- Indicador de sele&ccedil;&atilde;o do usu&aacute;rio a ser liberado.</FONT> </P>
<FONT SIZE=2><P>Pode assumir o seguinte valor:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"S" - Para que o usu&aacute;rio fique selecionado para libera&ccedil;&atilde;o.</FONT> </P></DIR>

<FONT SIZE=2><P>Caso este campo n&atilde;o seja informado, o usu&aacute;rio n&atilde;o ser&aacute; selecionado para libera&ccedil;&atilde;o.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Numero</B> - N&uacute;mero do usu&aacute;rio.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Codigo</B> - C&oacute;digo do usu&aacute;rio.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Nome</B> - Nome do usu&aacute;rio.</FONT> </P></DIR>

<B><FONT SIZE=5><P><A NAME="Habus">Habilita&ccedil;&otilde;es de usu&aacute;rio</A></B></FONT> </P>
<P><HR></P>
<FONT SIZE=2><P>As habilita&ccedil;&otilde;es a serem definidas para os usu&aacute;rios do Sistema de Seguran&ccedil;a s&atilde;o:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Habilita&ccedil;&otilde;es de aplicativos: que ir&atilde;o determinar com quais aplicativos os usu&aacute;rios ter&atilde;o autoriza&ccedil;&atilde;o para trabalhar;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Habilita&ccedil;&otilde;es de transa&ccedil;&otilde;es: que ir&atilde;o determinar com quais transa&ccedil;&otilde;es dos aplicativos anteriormente habilitados os usu&aacute;rios poder&atilde;o obter acesso; e</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Habilita&ccedil;&otilde;es de elementos: que ir&atilde;o determinar com quais elementos (valores de campos) os usu&aacute;rios poder&atilde;o trabalhar em um aplicativo ou lista de elementos.</FONT> </P></DIR>

<FONT SIZE=2><P>As habilita&ccedil;&otilde;es de elementos n&atilde;o s&atilde;o obrigat&oacute;rias e somente se deve proceder aos seus cadastramentos para aqueles aplicativos que efetuarem o teste de habilita&ccedil;&atilde;o de elemento.</FONT> </P>
<FONT SIZE=2><P>Embora seja poss&iacute;vel n&atilde;o habilitar aplicativos, transa&ccedil;&otilde;es e elementos ao usu&aacute;rio, no momento de sua cria&ccedil;&atilde;o, &eacute; obrigat&oacute;rio que estas habilita&ccedil;&otilde;es tenham sido definidas em algum momento, para que ele possa trabalhar no ambiente SADS.</FONT> </P>
<B><FONT SIZE=4><P>Unidades das habilita&ccedil;&otilde;es</B></FONT> </P>
<FONT SIZE=2><P>Todas as habilita&ccedil;&otilde;es dos usu&aacute;rios (aplicativos, transa&ccedil;&otilde;es e elementos), definidas no Sistema de Seguran&ccedil;a, s&atilde;o cadastradas em n&iacute;vel de empresa, estabelecimento e unidade.</FONT> </P>
<FONT SIZE=2><P>As unidades autorizadas ao usu&aacute;rio e as unidades nas quais o aplicativo, transa&ccedil;&atilde;o ou elemento ser&aacute; habilitado devem ser sempre compat&iacute;veis, da seguinte forma:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Se o usu&aacute;rio estiver autorizado a trabalhar em diferentes empresas (Empresa autorizada = "999"), as habilita&ccedil;&otilde;es podem ser definidas para todas as empresas ("999") ou para uma empresa espec&iacute;fica ("nnn"). </P>
<P>Este procedimento tamb&eacute;m &eacute; v&aacute;lido para o estabelecimento e a unidade.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Se um usu&aacute;rio tem acesso a somente uma empresa espec&iacute;fica (Empresa autorizada = "nnn"), ent&atilde;o s&oacute; &eacute; permitido cadastrar habilita&ccedil;&otilde;es para esta mesma empresa ("nnn"). </P>
<P>Mesmo procedimento se aplica a estabelecimento e unidade autorizados.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Se um usu&aacute;rio tem acesso somente a sistemas que n&atilde;o est&atilde;o ligados a nenhuma empresa (Empresa autorizada = "000"), ent&atilde;o s&oacute; &eacute; permitido habilitar aplicativos, transa&ccedil;&otilde;es e elementos para a empresa "000". </P>
<P>Mesmo procedimento se aplica a estabelecimento e unidade autorizados.</FONT> </P></DIR>

<FONT SIZE=2><P>No momento em que o usu&aacute;rio estiver trabalhando em uma sess&atilde;o SADS, o aplicativo, transa&ccedil;&atilde;o ou elemento s&oacute; estar&aacute; habilitado ao usu&aacute;rio caso a empresa, estabelecimento e unidade informados no in&iacute;cio da sess&atilde;o de trabalho sejam compat&iacute;veis &agrave;queles especificados na habilita&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Para melhor entender a rela&ccedil;&atilde;o entre as unidades autorizadas do <I>logon</I> e as unidades das habilita&ccedil;&otilde;es, suponha as seguintes habilita&ccedil;&otilde;es de aplicativos de um usu&aacute;rio:</FONT> </P>
<TABLE BORDER CELLSPACING=1 BORDERCOLOR="#000000" WIDTH=509>
<TR><TD WIDTH="24%" VALIGN="MIDDLE">
<P><B><FONT SIZE=2>APLICATIVO</B></FONT> </TD>
<TD WIDTH="20%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P>EMPRESA</B></FONT> </TD>
<TD WIDTH="15%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P>ESTAB</B></FONT> </TD>
<TD WIDTH="13%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P>UNID.</B></FONT> </TD>
<TD WIDTH="28%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P ALIGN="CENTER">TIPO DA HABILITA&Ccedil;&Atilde;O</B></FONT></TD>
</TR>
<TR><TD WIDTH="24%" VALIGN="MIDDLE">
<P>GHD</TD>
<TD WIDTH="20%" VALIGN="MIDDLE">
<P>999</TD>
<TD WIDTH="15%" VALIGN="MIDDLE">
<P>9999 </TD>
<TD WIDTH="13%" VALIGN="MIDDLE">
<P>999</TD>
<TD WIDTH="28%" VALIGN="MIDDLE">
<P ALIGN="CENTER">2</TD>
</TR>
<TR><TD WIDTH="24%" VALIGN="MIDDLE">
<P>M</TD>
<TD WIDTH="20%" VALIGN="MIDDLE">
<P>011</TD>
<TD WIDTH="15%" VALIGN="MIDDLE">
<P>0001 </TD>
<TD WIDTH="13%" VALIGN="MIDDLE">
<P>001</TD>
<TD WIDTH="28%" VALIGN="MIDDLE">
<P ALIGN="CENTER">2</TD>
</TR>
<TR><TD WIDTH="24%" VALIGN="MIDDLE">
<P>F</TD>
<TD WIDTH="20%" VALIGN="MIDDLE">
<P>021</TD>
<TD WIDTH="15%" VALIGN="MIDDLE">
<P>0001 </TD>
<TD WIDTH="13%" VALIGN="MIDDLE">
<P>001</TD>
<TD WIDTH="28%" VALIGN="MIDDLE">
<P ALIGN="CENTER">2 </TD>
</TR>
</TABLE>

<P>Tendo como base as habilita&ccedil;&otilde;es anteriores, tem-se que: </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12>Se este usu&aacute;rio efetuar <I><FONT SIZE=2>logon</I> na empresa "011", estabelecimento "0001" e unidade "001", ent&atilde;o ele poder&aacute; acessar as transa&ccedil;&otilde;es do sistema "GHD" e as transa&ccedil;&otilde;es dos sistemas iniciados com "M". Os aplicativos iniciados com "F" n&atilde;o estar&atilde;o dispon&iacute;veis para ele.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Se este usu&aacute;rio efetuar <I>logon</I> na empresa "021", estabelecimento "0001" e unidade "001", ent&atilde;o ele poder&aacute; acessar as transa&ccedil;&otilde;es do sistema "GHD" e as transa&ccedil;&otilde;es dos sistemas iniciados com "F".</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Se este usu&aacute;rio efetuar <I>logon</I> em qualquer outra empresa, estabelecimento e unidade, ent&atilde;o ele s&oacute; poder&aacute; acessar as transa&ccedil;&otilde;es do sistema "GHD".</FONT> </P></DIR>

<B><FONT SIZE=4><P>Testes das habilita&ccedil;&otilde;es</B></FONT> </P>
<FONT SIZE=2><P>O Sistema de Seguran&ccedil;a faz a valida&ccedil;&atilde;o da habilita&ccedil;&atilde;o de aplicativos segundo os c&oacute;digos de transa&ccedil;&atilde;o das telas de processamento ou de menus 01 a 09. Para o SADS/SS, portanto, os c&oacute;digos de transa&ccedil;&atilde;o dos menus de escolha ou de opera&ccedil;&atilde;o n&atilde;o podem ser utilizados para definir as habilita&ccedil;&otilde;es dos usu&aacute;rios. Por&eacute;m, apenas os c&oacute;digos de menu (sssmm) dos menus de escolha e opera&ccedil;&atilde;o devem ser habilitados aos usu&aacute;rios para que eles possam utilizar a navega&ccedil;&atilde;o.</FONT> </P>
<B><FONT SIZE=5><P><A NAME="Habap">Habilita&ccedil;&atilde;o de aplicativos </A></P>
</B></FONT><FONT SIZE=2><P>Atrav&eacute;s da opera&ccedil;&atilde;o de habilita&ccedil;&atilde;o de aplicativos &eacute; poss&iacute;vel determinar com quais aplicativos o usu&aacute;rio est&aacute; autorizado a trabalhar e de qual maneira ele est&aacute; autorizado a trabalhar: somente consultar, consultar e atualizar ou n&atilde;o permite trabalhar.</FONT> </P>
<B><FONT SIZE=4><P>Hierarquia do aplicativo</B></FONT> </P>
<FONT SIZE=2><P>O aplicativo a ser habilitado ao usu&aacute;rio pode ser definido hierarquicamente, como por exemplo:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>" " (branco) - Para habilitar o usu&aacute;rio a utilizar todos os aplicativos da empresa, estabelecimento e unidade especificados.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>"S" - Para habilitar o usu&aacute;rio a utilizar todos os aplicativos iniciados pela letra "S" da empresa, estabelecimento e unidade especificados.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>"sssmm" - Para habilitar o usu&aacute;rio a trabalhar com um menu espec&iacute;fico (onde "sssmm" &eacute; o c&oacute;digo de menu).</FONT> </P></DIR>

<FONT SIZE=2><P>A habilita&ccedil;&atilde;o de um aplicativo hierarquicamente inferior se sobrep&otilde;e a uma habilita&ccedil;&atilde;o de um aplicativo hierarquicamente superior. </P>
<P>Como exemplo, suponha um usu&aacute;rio com as seguintes habilita&ccedil;&otilde;es:</FONT> </P>
<TABLE BORDER CELLSPACING=1 BORDERCOLOR="#000000" WIDTH=509>
<TR><TD WIDTH="24%" VALIGN="MIDDLE">
<P><B><FONT SIZE=2>APLICATIVO</B></FONT> </TD>
<TD WIDTH="20%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P ALIGN="CENTER">EMPRESA</B></FONT></TD>
<TD WIDTH="15%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P ALIGN="CENTER">ESTAB</B></FONT></TD>
<TD WIDTH="13%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P ALIGN="CENTER">UNID.</B></FONT></TD>
<TD WIDTH="28%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P ALIGN="CENTER">TIPO DA HABILITA&Ccedil;&Atilde;O</B></FONT></TD>
</TR>
<TR><TD WIDTH="24%" VALIGN="MIDDLE">
<P>GLH</TD>
<TD WIDTH="20%" VALIGN="MIDDLE">
<P ALIGN="CENTER">011</TD>
<TD WIDTH="15%" VALIGN="MIDDLE">
<P ALIGN="CENTER">0001</TD>
<TD WIDTH="13%" VALIGN="MIDDLE">
<P ALIGN="CENTER">001</TD>
<TD WIDTH="28%" VALIGN="MIDDLE">
<P ALIGN="CENTER">2</TD>
</TR>
<TR><TD WIDTH="24%" VALIGN="MIDDLE">
<P>H</TD>
<TD WIDTH="20%" VALIGN="MIDDLE">
<P ALIGN="CENTER">011</TD>
<TD WIDTH="15%" VALIGN="MIDDLE">
<P ALIGN="CENTER">0001</TD>
<TD WIDTH="13%" VALIGN="MIDDLE">
<P ALIGN="CENTER">001</TD>
<TD WIDTH="28%" VALIGN="MIDDLE">
<P ALIGN="CENTER">2</TD>
</TR>
<TR><TD WIDTH="24%" VALIGN="MIDDLE">
<P>GLH01</TD>
<TD WIDTH="20%" VALIGN="MIDDLE">
<P ALIGN="CENTER">011</TD>
<TD WIDTH="15%" VALIGN="MIDDLE">
<P ALIGN="CENTER">0001</TD>
<TD WIDTH="13%" VALIGN="MIDDLE">
<P ALIGN="CENTER">001</TD>
<TD WIDTH="28%" VALIGN="MIDDLE">
<P ALIGN="CENTER">3</TD>
</TR>
<TR><TD WIDTH="24%" VALIGN="MIDDLE">
<P>PD</TD>
<TD WIDTH="20%" VALIGN="MIDDLE">
<P ALIGN="CENTER">011</TD>
<TD WIDTH="15%" VALIGN="MIDDLE">
<P ALIGN="CENTER">0001</TD>
<TD WIDTH="13%" VALIGN="MIDDLE">
<P ALIGN="CENTER">001</TD>
<TD WIDTH="28%" VALIGN="MIDDLE">
<P ALIGN="CENTER">2 </TD>
</TR>
</TABLE>

<P>Embora tenha sido determinado na primeira habilita&ccedil;&atilde;o que o usu&aacute;rio poder&aacute; consultar e atualizar o aplicativo "GLH", ele n&atilde;o conseguir&aacute; obter acesso a nenhuma op&ccedil;&atilde;o do menu 01 do sistema "GLH" (Transa&ccedil;&otilde;es "GLH01.nn"). Isto se deve ao fato de que a terceira habilita&ccedil;&atilde;o ir&aacute; se sobrepor &agrave; primeira, pois o aplicativo "GLH01" &eacute; hierarquicamente inferior ao aplicativo "GLH" e por isso mesmo &eacute; testado anteriormente. </P>
<P>Para obter maiores esclarecimentos sobre o fluxo de testes efetuados pelo SADS/SS para validar se um usu&aacute;rio est&aacute; habilitado a utilizar um aplicativo, deve-se consultar o item "Fluxo de Testes", nesta se&ccedil;&atilde;o. </P>
<P>A altera&ccedil;&atilde;o das habilita&ccedil;&otilde;es de um usu&aacute;rio n&atilde;o ser&aacute; efetuada se as unidades das novas habilita&ccedil;&otilde;es forem incompat&iacute;veis com as definidas para o usu&aacute;rio. </P>
<P>Todo usu&aacute;rio de n&iacute;vel de acesso 99 est&aacute; habilitado a qualquer opera&ccedil;&atilde;o do Sistema de Seguran&ccedil;a, inclusive a habilita&ccedil;&atilde;o de aplicativo a usu&aacute;rios. Por&eacute;m, para que o usu&aacute;rio de n&iacute;vel de acesso 98 possa efetuar esta opera&ccedil;&atilde;o, deve atender determinados requisitos, que se encontram relacionados nesta se&ccedil;&atilde;o, no item "Usu&aacute;rios e habilita&ccedil;&otilde;es", t&oacute;pico "Introdu&ccedil;&atilde;o", subt&oacute;pico "Respons&aacute;veis pelos cadastramentos". </P>
<P>Para habilitar um usu&aacute;rio a utilizar determinados aplicativos, deve-se utilizar o menu de opera&ccedil;&atilde;o "HABUSU", opera&ccedil;&atilde;o "APL". </P>
<B><FONT SIZE=2><P>CAMPOS DA TELA</B></FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Usuario</B> - N&uacute;mero, nome e c&oacute;digo do usu&aacute;rio.</FONT> </P>
<FONT SIZE=2><P>Para cada aplicativo a ser habilitado, dever&atilde;o ser informados:</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Aplicativo</B> - C&oacute;digo do aplicativo autorizado ao usu&aacute;rio. </P>
</FONT><P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Empresa </B>- C&oacute;digo da empresa na qual o usu&aacute;rio pode ter acesso ao aplicativo.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"999" - Para habilitar o usu&aacute;rio a trabalhar com o aplicativo em todas as empresas;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"nnn" ("001" a "998") - Para habilitar o usu&aacute;rio a trabalhar com o aplicativo em uma empresa espec&iacute;fica;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"000" - Para habilitar o usu&aacute;rio a trabalhar com o aplicativo sem considerar a empresa.</FONT> </P></DIR>

<FONT SIZE=2><P>Caso este campo n&atilde;o seja informado, ser&aacute; assumida empresa "000".</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Estab</B>. - C&oacute;digo do estabelecimento no qual o usu&aacute;rio pode ter acesso ao aplicativo.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"9999" - Para habilitar o usu&aacute;rio a trabalhar com o aplicativo em todos os estabelecimentos;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"nnnn" ("0001" a "9998") - Para habilitar o usu&aacute;rio a trabalhar com o aplicativo em um estabelecimento espec&iacute;fico;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"0000" - Para habilitar o usu&aacute;rio a trabalhar o aplicativo sem considerar o estabelecimento.</FONT> </P></DIR>

<FONT SIZE=2><P>Caso este campo n&atilde;o seja informado, ser&aacute; assumido estabelecimento "0000".</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Unid</B>. - c&oacute;digo da unidade na qual o usu&aacute;rio pode ter acesso ao aplicativo.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"999" - Para habilitar o usu&aacute;rio a trabalhar com o aplicativo em todas as unidades;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"nnn" ("001" a "998") - Para habilitar o usu&aacute;rio a trabalhar com o aplicativo em uma unidade espec&iacute;fica;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"000" - Para habilitar o usu&aacute;rio a trabalhar com aplicativos sem considerar a unidade.</FONT> </P></DIR>

<FONT SIZE=2><P>Caso este campo n&atilde;o seja informado, ser&aacute; assumida unidade "000".</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Habilitacao</B> - Tipo da habilita&ccedil;&atilde;o do usu&aacute;rio ao aplicativo.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"0" - &Eacute; permitido ao usu&aacute;rio apenas consultar o aplicativo especificado.</FONT> </P>
<FONT SIZE=2><P>Neste caso, o usu&aacute;rio somente tem acesso &agrave;s transa&ccedil;&otilde;es de consulta do aplicativo, se estas lhe forem habilitadas.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"2" - &Eacute; permitido ao usu&aacute;rio consultar e atualizar o aplicativo especificado.</FONT> </P>
<FONT SIZE=2><P>Neste caso, o usu&aacute;rio tem acesso a qualquer transa&ccedil;&atilde;o do aplicativo que lhe esteja habilitada.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"3" - N&atilde;o &eacute; permitido ao usu&aacute;rio trabalhar com o aplicativo.</FONT> </P></DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Nivel</B> - N&iacute;vel de acesso do usu&aacute;rio ao aplicativo (opcional).</FONT> </P>
<FONT SIZE=2><P>O n&iacute;vel de acesso do usu&aacute;rio ao aplicativo fica dispon&iacute;vel para utiliza&ccedil;&atilde;o pelos programas aplicativos no campo global GBL-UAHNIVHAB e pode ser testado de acordo com as necessidades do aplicativo.</FONT> </P>
<FONT SIZE=2><P>Para obter maiores esclarecimentos, deve-se consultar o item "N&iacute;veis de seguran&ccedil;a dispon&iacute;veis", t&oacute;pico "N&iacute;veis de acesso do usu&aacute;rio", nesta se&ccedil;&atilde;o.</FONT> </P></DIR>

<B><FONT SIZE=5><P><A NAME="Habtra">Habilita&ccedil;&atilde;o de transa&ccedil;&otilde;es</A></B></FONT> </P>
<FONT SIZE=2><P>Esta opera&ccedil;&atilde;o permite habilitar um usu&aacute;rio a utilizar determinadas transa&ccedil;&otilde;es de um aplicativo qualquer, anteriormente habilitado ao usu&aacute;rio.</FONT> </P>
<FONT SIZE=2><P>Todo usu&aacute;rio de n&iacute;vel de acesso 99 est&aacute; habilitado a qualquer opera&ccedil;&atilde;o do Sistema de Seguran&ccedil;a, inclusive a habilita&ccedil;&atilde;o de transa&ccedil;&atilde;o a usu&aacute;rios. Por&eacute;m, para que o usu&aacute;rio de n&iacute;vel de acesso 98 possa efetuar esta opera&ccedil;&atilde;o, deve atender determinados requisitos, que se encontram relacionados nesta se&ccedil;&atilde;o, no item "Usu&aacute;rios e habilita&ccedil;&otilde;es", t&oacute;pico "Introdu&ccedil;&atilde;o", subt&oacute;pico "Respons&aacute;veis pelos cadastramentos".</FONT> </P>
<FONT SIZE=2><P>Para habilitar um usu&aacute;rio a utilizar transa&ccedil;&otilde;es de um aplicativo anteriormente habilitado, deve-se utilizar o menu de opera&ccedil;&atilde;o "HABUSU", opera&ccedil;&atilde;o "TRA".</FONT> </P>
<B><FONT SIZE=2><P>CAMPOS DA TELA</B></FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Usuario </B>- N&uacute;mero, nome e c&oacute;digo do usu&aacute;rio.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Aplicativo</B> - C&oacute;digo do aplicativo cujas transa&ccedil;&otilde;es ser&atilde;o habilitadas ao usu&aacute;rio.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Habilitacao</B> - Tipo da habilita&ccedil;&atilde;o do usu&aacute;rio ao aplicativo.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Empresa</B> - C&oacute;digo da empresa na qual o usu&aacute;rio foi habilitado ao aplicativo.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Estabelecimento </B>- C&oacute;digo do estabelecimento no qual o usu&aacute;rio foi habilitado ao aplicativo.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Unidade</B> - C&oacute;digo da unidade na qual o usu&aacute;rio foi habilitado ao aplicativo.</FONT> </P>
<FONT SIZE=2><P>Para habilitar uma transa&ccedil;&atilde;o, deve-se informar "S" no campo correspondente &agrave; interse&ccedil;&atilde;o de uma linha com uma coluna, que determina o n&uacute;mero da transa&ccedil;&atilde;o.</FONT> </P></DIR>

<B><FONT SIZE=5><P><A NAME="Habele">Habilita&ccedil;&atilde;o de elementos</A></B></FONT> </P>
<FONT SIZE=2><P>O Sistema de Seguran&ccedil;a permite aos aplicativos validar se um usu&aacute;rio pode ou n&atilde;o executar o acesso a um elemento espec&iacute;fico.</FONT> </P>
<FONT SIZE=2><P>O elemento a ser testado depende da necessidade do aplicativo, podendo ser qualquer informa&ccedil;&atilde;o, interna ao mesmo, que se queira validar a seguran&ccedil;a de acesso. Da&iacute; o elemento n&atilde;o possuir padr&atilde;o de codifica&ccedil;&atilde;o, podendo conter at&eacute; 17 posi&ccedil;&otilde;es e em qualquer formato de edi&ccedil;&atilde;o (num&eacute;rico, alfab&eacute;tico ou alfanum&eacute;rico). </P>
<P>O elemento a ser testado pode ser totalmente hierarquizado e se referir a um conjunto de elementos. Por exemplo, ao habilitar um usu&aacute;rio a trabalhar com o elemento "GO", ele estar&aacute; tamb&eacute;m habilitado a trabalhar com todos os elementos iniciados com "GO", tais como "GO10" e "GO20".</FONT> </P>
<FONT SIZE=2><P>Esta hierarquia na defini&ccedil;&atilde;o de acesso aos elementos possibilita habilitar um usu&aacute;rio, por exemplo, a consultar o sal&aacute;rio de qualquer empregado dos departamentos administrativos (elemento = "ADM") e t&eacute;cnicos (elemento = "TEC") nas transa&ccedil;&otilde;es do Sistema de Recursos Humanos (Aplicativo = "GRH"), sem a necessidade de habilitar cada um dos setores destes departamentos isoladamente:</FONT> </P>
<B><FONT SIZE=2><P>APLICATIVO/LISTA DE ELEMENTOS</B>: GRH</FONT> </P>
<TABLE BORDER CELLSPACING=1 BORDERCOLOR="#000000" WIDTH=331>
<TR><TD WIDTH="36%" VALIGN="MIDDLE">
<P ALIGN="CENTER"><B><FONT SIZE=2>ELEMENTO</B></FONT></TD>
<TD WIDTH="64%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P ALIGN="CENTER">TIPO DA HABILITA&Ccedil;&Atilde;O</B></FONT></TD>
</TR>
<TR><TD WIDTH="36%" VALIGN="MIDDLE">
<P ALIGN="CENTER">ADM</TD>
<TD WIDTH="64%" VALIGN="MIDDLE">
<P ALIGN="CENTER">2</TD>
</TR>
<TR><TD WIDTH="36%" VALIGN="MIDDLE">
<P ALIGN="CENTER">TEC</TD>
<TD WIDTH="64%" VALIGN="MIDDLE">
<P ALIGN="CENTER">2</TD>
</TR>
</TABLE>

<P>O c&oacute;digo da lista de elementos ou aplicativo na qual o elemento ser&aacute; habilitado pode tamb&eacute;m ser totalmente hierarquizado. Por exemplo, ao habilitar um usu&aacute;rio a trabalhar com um elemento na lista de elementos "PRO", ele estar&aacute; tamb&eacute;m habilitado ao mesmo elemento em todas as listas iniciadas com "PRO", tais como "PROJETO" e "PROGRAM", caso estas duas outras listas n&atilde;o possuam seus pr&oacute;prios elementos habilitados. </P>
<P>Para melhor elucidar esta hierarquia, ser&atilde;o apresentados os seguintes exemplos de c&oacute;digos de aplicativos ou lista de elementos, que poderiam ter sido definidos para um determinado usu&aacute;rio: </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12>"ABC" - Para habilitar o usu&aacute;rio a utilizar o elemento em todos os menus do sistema "ABC"; </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12>"PEDIDOS" - Para habilitar o usu&aacute;rio a utilizar o elemento nas transa&ccedil;&otilde;es de manuten&ccedil;&atilde;o de pedidos; </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12>"PDE01" - Para habilitar o usu&aacute;rio a utilizar o elemento em todas as transa&ccedil;&otilde;es do menu "PDE01"; </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12>"GRH0123" - Para habilitar o usu&aacute;rio a trabalhar com o elemento em uma transa&ccedil;&atilde;o espec&iacute;fica "GRH0123". </P></DIR>

<P>Cumpre ressaltar que a habilita&ccedil;&atilde;o do elemento em um aplicativo hierarquicamente inferior se sobrep&otilde;e a uma habilita&ccedil;&atilde;o do elemento em um aplicativo hierarquicamente superior. </P>
<P>Como exemplo, suponha um usu&aacute;rio com as seguintes habilita&ccedil;&otilde;es de elemento: </P>
<B><FONT SIZE=2><P>APLICATIVO/LISTA DE ELEMENTOS</B>: GLH</FONT> </P>
<TABLE BORDER CELLSPACING=1 BORDERCOLOR="#000000" WIDTH=331>
<TR><TD WIDTH="36%" VALIGN="MIDDLE">
<P><B><FONT SIZE=2>ELEMENTO</B></FONT> </TD>
<TD WIDTH="64%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P>TIPO DA HABILITA&Ccedil;&Atilde;O</B></FONT> </TD>
</TR>
<TR><TD WIDTH="36%" VALIGN="MIDDLE">
<P>SALARIO</TD>
<TD WIDTH="64%" VALIGN="MIDDLE">
<P>2 Consultar e atualizar </TD>
</TR>
<TR><TD WIDTH="36%" VALIGN="MIDDLE">
<P>CF</TD>
<TD WIDTH="64%" VALIGN="MIDDLE">
<P>0 Consultar e atualizar </TD>
</TR>
</TABLE>

<B><FONT SIZE=2><P>APLICATIVO/LISTA DE ELEMENTOS: GLH01</B></FONT> </P>
<TABLE BORDER CELLSPACING=1 BORDERCOLOR="#000000" WIDTH=331>
<TR><TD WIDTH="36%" VALIGN="MIDDLE">
<P><B><FONT SIZE=2>ELEMENTO</B></FONT> </TD>
<TD WIDTH="64%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P>TIPO DA HABILITA&Ccedil;&Atilde;O </B></FONT></TD>
</TR>
<TR><TD WIDTH="36%" VALIGN="MIDDLE">
<P>SALARIO</TD>
<TD WIDTH="64%" VALIGN="MIDDLE">
<P>3 N&atilde;o permite acessar </TD>
</TR>
</TABLE>

<P><BR>
Embora tenha sido determinado, na primeira habilita&ccedil;&atilde;o, que o usu&aacute;rio poder&aacute; consultar e atualizar o elemento "SALARIO" no aplicativo "GLH", ele n&atilde;o conseguir&aacute; obter acesso ao elemento "SALARIO" em nenhuma op&ccedil;&atilde;o do menu 01 do sistema "GLH" (Transa&ccedil;&otilde;es "GLH01.nn"). Isto se deve ao fato de que a terceira habilita&ccedil;&atilde;o ir&aacute; se sobrepor &agrave; primeira, visto que o aplicativo "GLH01" &eacute; hierarquicamente inferior ao aplicativo "GLH" e por isso mesmo &eacute; testado anteriormente. </P>
<P>Para obter maiores esclarecimentos sobre o fluxo de testes efetuados pelo SADS/SS para validar se um usu&aacute;rio est&aacute; habilitado a utilizar um elemento no aplicativo, deve-se consultar o item "Fluxo de testes", nesta se&ccedil;&atilde;o. </P>
<P>Quando um aplicativo for utilizar o teste de valida&ccedil;&atilde;o de elemento, ele dever&aacute; identificar qual o nome da lista que agrupar&aacute; os elementos a serem testados e quais elementos dever&atilde;o ser habilitados a cada usu&aacute;rio. O nome da lista pode ser o c&oacute;digo total ou parcial do aplicativo, o c&oacute;digo da transa&ccedil;&atilde;o que ir&aacute; disparar o teste do elemento ou pode ser um nome qualquer, que identifique a qual grupo de elementos o teste se refere. </P>
<P>Como exemplo de teste de elementos, tem-se: </P>
<P>No aplicativo de Controle de Projetos (ACP), os usu&aacute;rios somente poder&atilde;o apropriar horas em projetos para os quais est&atilde;o habilitados. Neste aplicativo ficou determinado, ent&atilde;o, que a lista de elementos a ser habilitada aos usu&aacute;rios se chamar&aacute; "PROJS" e nela dever&atilde;o estar definidos, para cada usu&aacute;rio, os c&oacute;digos dos projetos pass&iacute;veis de apropria&ccedil;&atilde;o. Esta lista poderia tamb&eacute;m se chamar, por exemplo, "ACP" ou "ACP0101" (Transa&ccedil;&atilde;o de apropria&ccedil;&atilde;o de horas do aplicativo ACP). </P>
<P>A habilita&ccedil;&atilde;o de elementos para um usu&aacute;rio &eacute; definida para um aplicativo/lista de elementos e pode ser definida considerando a empresa, o estabelecimento e a unidade nas quais o usu&aacute;rio est&aacute; habilitado a efetuar <I><FONT SIZE=2>logon</I>.</FONT> </P>
<FONT SIZE=2><P>Para que um aplicativo possa se utilizar do teste de valida&ccedil;&atilde;o de elemento, &eacute; necess&aacute;rio que sejam efetuados dois procedimentos, a saber:</FONT> </P>
<OL>

<FONT SIZE=2><LI>Habilita&ccedil;&atilde;o dos elementos autorizados aos usu&aacute;rios do aplicativo, na lista de elementos especificada;</FONT> </LI>
<FONT SIZE=2><P>A seguir, ser&aacute; detalhadamente explicado como se processa o cadastramento das habilita&ccedil;&otilde;es de elementos a um usu&aacute;rio.</FONT> </P>
<FONT SIZE=2><LI>Disparo do teste para valida&ccedil;&atilde;o do elemento, no momento da execu&ccedil;&atilde;o do aplicativo.</FONT> </LI></OL>
<DIR>
<DIR>

<FONT SIZE=2><P>Para que o teste de valida&ccedil;&atilde;o de um elemento seja executado assim que uma transa&ccedil;&atilde;o do aplicativo for disparada, um dos dois procedimentos a seguir deve ser efetuado:</FONT> </P></DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Incorpora&ccedil;&atilde;o, interna ao programa, da chamada ao teste oferecido pelo SADS/SS para essa valida&ccedil;&atilde;o de elemento; ou </P>
</FONT><P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Defini&ccedil;&atilde;o na consist&ecirc;ncia geral da tela ou tabela onde exista a requisi&ccedil;&atilde;o do elemento, da chamada ao teste de valida&ccedil;&atilde;o de elemento do SADS/SS.</FONT> </P></DIR>

<FONT SIZE=2><P>Para obter maiores detalhes sobre como disparar o teste de valida&ccedil;&atilde;o de elemento, deve-se consultar o item "N&iacute;veis de seguran&ccedil;a dispon&iacute;veis", t&oacute;pico "Valida&ccedil;&atilde;o de elemento", nesta se&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Todo usu&aacute;rio de n&iacute;vel de acesso 99 est&aacute; habilitado a qualquer opera&ccedil;&atilde;o do Sistema de Seguran&ccedil;a, inclusive a habilita&ccedil;&atilde;o de elemento a usu&aacute;rios. Por&eacute;m, para que o usu&aacute;rio de n&iacute;vel de acesso 98 possa efetuar esta opera&ccedil;&atilde;o, deve atender determinados requisitos, que se encontram relacionados nesta se&ccedil;&atilde;o, no item "Usu&aacute;rios e habilita&ccedil;&otilde;es", t&oacute;pico "Introdu&ccedil;&atilde;o", subt&oacute;pico "Respons&aacute;veis pelos cadastramentos".</FONT> </P>
<FONT SIZE=2><P>Para realizar a habilita&ccedil;&atilde;o de elementos, deve-se utilizar o menu de opera&ccedil;&atilde;o "HABUSU", opera&ccedil;&atilde;o "ELE".</FONT> </P>
<B><FONT SIZE=2><P>CAMPOS DA TELA</B></FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Usuario</B> - N&uacute;mero, nome e c&oacute;digo do usu&aacute;rio.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Aplicativo/ Lista de Elementos </B>- C&oacute;digo do aplicativo ou nome da lista de elementos para o qual as habilita&ccedil;&otilde;es de elementos ser&atilde;o realizadas.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Empresa</B> - C&oacute;digo da empresa para a qual a habilita&ccedil;&atilde;o de elemento do usu&aacute;rio ser&aacute; efetuada, caso o usu&aacute;rio tenha acesso a mais de uma empresa;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Estabelecimento</B> - C&oacute;digo do estabelecimento para o qual a habilita&ccedil;&atilde;o de elemento do usu&aacute;rio ser&aacute; efetuada, caso o usu&aacute;rio tenha acesso a mais de um estabelecimento;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Unidade</B> - C&oacute;digo da unidade para a qual a habilita&ccedil;&atilde;o de elemento do usu&aacute;rio ser&aacute; efetuada, caso o usu&aacute;rio tenha acesso a mais de uma unidade.</FONT> </P>
<FONT SIZE=2><P>Para cada um dos elementos a serem habilitados ao usu&aacute;rio, devem ser informados:</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Elemento</B> - C&oacute;digo do elemento ao qual o usu&aacute;rio ser&aacute; habilitado.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Habilitacao </B>- Tipo da habilita&ccedil;&atilde;o do usu&aacute;rio ao elemento.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"0" - Para indicar que &eacute; permitido ao usu&aacute;rio apenas consultar o elemento especificado;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"2" - Para indicar que &eacute; permitido ao usu&aacute;rio consultar e atualizar o elemento;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"3" - Para indicar que n&atilde;o &eacute; permitido ao usu&aacute;rio acessar o elemento;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"9" - Para indicar que &eacute; permitido, ao usu&aacute;rio de n&iacute;vel de acesso 98, habilitar um segundo usu&aacute;rio tamb&eacute;m de n&iacute;vel 98 a trabalhar com o elemento.</FONT> </P></DIR>

<FONT SIZE=2><P>S&oacute; um administrador de Seguran&ccedil;a possui autoriza&ccedil;&atilde;o para especificar "9" no tipo de habilita&ccedil;&atilde;o, somente para um usu&aacute;rio 98 e apenas quando a lista de elementos for a "SBT" ou "SBT01".</FONT> </P></DIR>

<B><FONT SIZE=5><P><A NAME="Habil">Habilita&ccedil;&atilde;o de usu&aacute;rio 98</A></B></FONT> </P>
<FONT SIZE=2><P>Atrav&eacute;s desta opera&ccedil;&atilde;o, o Sistema de Seguran&ccedil;a permite que sejam efetuados os seguintes cadastramentos para um usu&aacute;rio com n&iacute;vel de acesso 98 - subadministrador de seguran&ccedil;a:</FONT> </P>
<OL>

<FONT SIZE=2><LI>Cadastramento dos aplicativos com os quais ele estar&aacute; habilitado a trabalhar, com seus devidos tipos de habilita&ccedil;&atilde;o e unidades autorizadas para acesso.</FONT> </LI>
<FONT SIZE=2><P>Neste caso, estes aplicativos ser&atilde;o inclu&iacute;dos na lista de aplicativos habilitados ao usu&aacute;rio.</FONT> </P>
<FONT SIZE=2><LI>Cadastramento dos aplicativos que ele estar&aacute; autorizado a habilitar a um segundo usu&aacute;rio.</FONT> </LI>
<FONT SIZE=2><P>Neste caso, estes aplicativos ser&atilde;o inclu&iacute;dos como elementos, com tipo de habilita&ccedil;&atilde;o igual a "2", na lista de elementos "SBT01" do usu&aacute;rio.</FONT> </P>
<FONT SIZE=2><LI>Cadastramento dos aplicativos que ele estar&aacute; autorizado a habilitar a um segundo usu&aacute;rio, que tamb&eacute;m possua n&iacute;vel de acesso 98.</FONT> </LI></OL>
<DIR>
<DIR>

<FONT SIZE=2><P>Neste caso, estes aplicativos ser&atilde;o inclu&iacute;dos como elementos, com tipo de habilita&ccedil;&atilde;o igual a "9", na lista de elementos "SBT01" do usu&aacute;rio.</FONT> </P></DIR>
</DIR>

<FONT SIZE=2><P>Todo usu&aacute;rio de n&iacute;vel de acesso 99 est&aacute; habilitado a qualquer opera&ccedil;&atilde;o do Sistema de Seguran&ccedil;a, inclusive a habilita&ccedil;&atilde;o de usu&aacute;rio 98. Por&eacute;m, para que um usu&aacute;rio de n&iacute;vel de acesso 98 possa efetuar esta opera&ccedil;&atilde;o, deve atender determinados requisitos, que se encontram relacionados nesta se&ccedil;&atilde;o, no item "Usu&aacute;rios e habilita&ccedil;&otilde;es", t&oacute;pico "Introdu&ccedil;&atilde;o", subt&oacute;pico "Respons&aacute;veis pelos cadastramentos".</FONT> </P>
<FONT SIZE=2><P>Para autorizar um usu&aacute;rio de n&iacute;vel de acesso 98 a utilizar e/ou habilitar determinados aplicativos, deve-se utilizar o menu de opera&ccedil;&atilde;o "HABUSU", opera&ccedil;&atilde;o "H98".</FONT> </P>
<B><FONT SIZE=2><P>CAMPOS DA TELA</B></FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Usuario</B> - N&uacute;mero, nome e c&oacute;digo do usu&aacute;rio de n&iacute;vel de acesso 98.</FONT> </P>
<FONT SIZE=2><P>Para cada aplicativo a ser habilitado, dever&atilde;o ser informados:</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Aplicativo</B> - C&oacute;digo do aplicativo autorizado ao usu&aacute;rio. </P>
</FONT><P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Empresa </B>- C&oacute;digo da empresa na qual o usu&aacute;rio pode ter acesso ao aplicativo.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"999" - Para habilitar o usu&aacute;rio a trabalhar com o aplicativo em todas as empresas;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"nnn" ("001" a "998") - Para habilitar o usu&aacute;rio a trabalhar com o aplicativo em uma empresa espec&iacute;fica;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"000" - Para habilitar o usu&aacute;rio a trabalhar com o aplicativo sem considerar a empresa.</FONT> </P></DIR>

<FONT SIZE=2><P>Caso este campo n&atilde;o seja informado, ser&aacute; assumida empresa "000".</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Estab</B>. - C&oacute;digo do estabelecimento no qual o usu&aacute;rio pode ter acesso ao aplicativo.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"9999" - Para habilitar o usu&aacute;rio a trabalhar com o aplicativo em todos os estabelecimentos;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"nnnn" ("0001" a "9998") - Para habilitar o usu&aacute;rio a trabalhar com o aplicativo em um estabelecimento espec&iacute;fico;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"0000" - Para habilitar o usu&aacute;rio a trabalhar o aplicativo sem considerar o estabelecimento.</FONT> </P></DIR>

<FONT SIZE=2><P>Caso este campo n&atilde;o seja informado, ser&aacute; assumido estabelecimento "0000".</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Unid</B>. - c&oacute;digo da unidade na qual o usu&aacute;rio pode ter acesso ao aplicativo.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"999" - Para habilitar o usu&aacute;rio a trabalhar com o aplicativo em todas as unidades;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"nnn" ("001" a "998") - Para habilitar o usu&aacute;rio a trabalhar com o aplicativo em uma unidade espec&iacute;fica;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"000" - Para habilitar o usu&aacute;rio a trabalhar com aplicativos sem considerar a unidade.</FONT> </P></DIR>

<FONT SIZE=2><P>Caso este campo n&atilde;o seja informado, ser&aacute; assumida unidade "000".</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B>Habilitacao</B> - Tipo da habilita&ccedil;&atilde;o do usu&aacute;rio ao aplicativo. </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"0" - &Eacute; permitido ao usu&aacute;rio apenas consultar o aplicativo especificado.</FONT> </P>
<FONT SIZE=2><P>Neste caso o usu&aacute;rio somente tem acesso &agrave;s transa&ccedil;&otilde;es de consulta do aplicativo, se elas lhe forem habilitadas.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"2" - &Eacute; permitido ao usu&aacute;rio consultar e atualizar o aplicativo especificado.</FONT> </P>
<FONT SIZE=2><P>Neste caso o usu&aacute;rio tem acesso a qualquer transa&ccedil;&atilde;o do aplicativo, caso ela lhe seja habilitada.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"3" - N&atilde;o &eacute; permitido ao usu&aacute;rio trabalhar com o aplicativo.</FONT> </P></DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Nivel</B> - N&iacute;vel de acesso do usu&aacute;rio neste aplicativo (opcional).</FONT> </P>
<FONT SIZE=2><P>O n&iacute;vel de acesso do usu&aacute;rio no aplicativo fica dispon&iacute;vel para utiliza&ccedil;&atilde;o pelos programas aplicativos no campo global GBL-UAHNIVHAB e pode ser testado de acordo com as necessidades do aplicativo.</FONT> </P>
<FONT SIZE=2><P>Para maiores esclarecimentos, deve-se consultar o item "N&iacute;veis de seguran&ccedil;a dispon&iacute;veis", t&oacute;pico "N&iacute;veis de acesso do usu&aacute;rio".</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Hab. Cadastr. outro usuario </B>- Indicador de cadastramento do aplicativo a outro usu&aacute;rio.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"S" - Para indicar que o usu&aacute;rio 98 est&aacute; autorizado a habilitar o aplicativo a outros usu&aacute;rios.</FONT> </P>
<FONT SIZE=2><P>Neste caso, o aplicativo ser&aacute; inserido na sua lista de elementos "SBT01", com tipo de habilita&ccedil;&atilde;o "2".</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"N" - Para indicar que o usu&aacute;rio 98 n&atilde;o est&aacute; autorizado a habilitar o aplicativo a outros usu&aacute;rios.</FONT> </P>
<FONT SIZE=2><P>Neste caso, o aplicativo n&atilde;o ser&aacute; inserido na sua lista de elementos "SBT01".</FONT> </P></DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Hab. Cadastr. usuario 98</B> - Indicador de cadastramento do aplicativo a outro usu&aacute;rio de n&iacute;vel de acesso 98.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"S" - Para indicar que o usu&aacute;rio 98 estar&aacute; autorizado a habilitar o aplicativo a outros usu&aacute;rios de n&iacute;vel de acesso 98.</FONT> </P>
<FONT SIZE=2><P>Neste caso, o aplicativo ser&aacute; inserido na sua lista de elementos "SBT01", com tipo de habilita&ccedil;&atilde;o "9".</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"N" - Para indicar que o usu&aacute;rio 98 n&atilde;o estar&aacute; autorizado a habilitar o aplicativo a outros usu&aacute;rios de n&iacute;vel de acesso 98.</FONT> </P>
<FONT SIZE=2><P>Neste caso, o aplicativo n&atilde;o ser&aacute; inserido na sua lista de elementos "SBT01".</FONT> </P></DIR>
</DIR>

<B><FONT SIZE=5><P><A NAME="Utica">Utilit&aacute;rios do cadastramento de usu&aacute;rios</A></B></FONT> </P>
<P><HR></P>
<B><FONT SIZE=5><P><A NAME="Dupli">Duplica&ccedil;&atilde;o de usu&aacute;rio/perfil</A></B></FONT> </P>
<FONT SIZE=2><P>Esta opera&ccedil;&atilde;o propicia a cria&ccedil;&atilde;o de um usu&aacute;rio com as mesmas caracter&iacute;sticas e habilita&ccedil;&otilde;es de um outro usu&aacute;rio j&aacute; cadastrado.</FONT> </P>
<FONT SIZE=2><P>Ap&oacute;s a duplica&ccedil;&atilde;o de um usu&aacute;rio, pode-se optar por encadear a tela de altera&ccedil;&atilde;o do usu&aacute;rio rec&eacute;m-criado, para adequar suas caracter&iacute;sticas e/ou habilita&ccedil;&otilde;es.</FONT> </P>
<FONT SIZE=2><P>O administrador de seguran&ccedil;a pode efetuar a duplica&ccedil;&atilde;o de quaisquer usu&aacute;rios. </P>
<P>Um subadministrador de seguran&ccedil;a s&oacute; poder&aacute; efetuar a duplica&ccedil;&atilde;o, se todos os aplicativos habilitados ao usu&aacute;rio a ser duplicado existirem cadastrados como elementos, com tipo de habilita&ccedil;&atilde;o igual a "2", na lista de elementos do "SBT" ou "SBT01". Se o usu&aacute;rio a ser duplicado possuir tamb&eacute;m n&iacute;vel de acesso 98, ent&atilde;o este tipo de habilita&ccedil;&atilde;o deve ser "9", ao inv&eacute;s de "2", e o novo usu&aacute;rio s&oacute; ser&aacute; habilitado aos aplicativos que estiverem cadastrados para o usu&aacute;rio a ser duplicado com tipo de habilita&ccedil;&atilde;o "9". Tais habilita&ccedil;&otilde;es ser&atilde;o inclu&iacute;das para o novo usu&aacute;rio com tipo de habilita&ccedil;&atilde;o "2". </P>
<P>Para duplicar um usu&aacute;rio, deve-se utilizar o menu de opera&ccedil;&atilde;o "UTIUSU", opera&ccedil;&atilde;o "DUP".</FONT> </P>
<B><FONT SIZE=2><P>CAMPOS DA TELA</B></FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Usuario/Perfil modelo</B>:</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Numero</B> - N&uacute;mero do usu&aacute;rio cujos dados e habilita&ccedil;&otilde;es ser&atilde;o duplicados.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Codigo</B> - C&oacute;digo do usu&aacute;rio cujos dados e habilita&ccedil;&otilde;es ser&atilde;o duplicados.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Nome</B> - Nome do usu&aacute;rio, cujos dados e habilita&ccedil;&otilde;es ser&atilde;o duplicados.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Novo Usuario/Perfil</B>: </P>
</FONT><P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Numero</B> - N&uacute;mero do usu&aacute;rio a ser criado. </P>
<P>Caso este n&uacute;mero n&atilde;o seja informado, ser&aacute; gerado um n&uacute;mero imediatamente superior ao &uacute;ltimo j&aacute; cadastrado.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Codigo</B> - C&oacute;digo do novo usu&aacute;rio a ser criado.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Nome</B> - Nome do novo usu&aacute;rio.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Deseja alterar dados do novo usuario/perfil (S/N)</B> - Indicador de encadeamento da opera&ccedil;&atilde;o de altera&ccedil;&atilde;o do usu&aacute;rio ou perfil rec&eacute;m-criado.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"S" - Para encadear a altera&ccedil;&atilde;o do usu&aacute;rio rec&eacute;m-criado;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"N" - Para finalizar a duplica&ccedil;&atilde;o e n&atilde;o encadear a altera&ccedil;&atilde;o do novo usu&aacute;rio.</FONT> </P></DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Confirme</B> - Indicador de confirma&ccedil;&atilde;o de opera&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"S" - Para confirmar a duplica&ccedil;&atilde;o;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"N" - Para cancelar a opera&ccedil;&atilde;o.</FONT> </P></DIR>
</DIR>

<B><FONT SIZE=5><P><A NAME="Alter">Altera&ccedil;&atilde;o de unidades autorizadas</A></B></FONT> </P>
<FONT SIZE=2><P>Todas as habilita&ccedil;&otilde;es dos usu&aacute;rios (aplicativos, transa&ccedil;&otilde;es e elementos), definidas no Sistema de Seguran&ccedil;a, s&atilde;o cadastradas em n&iacute;vel de empresa, estabelecimento e unidade.</FONT> </P>
<FONT SIZE=2><P>As unidades autorizadas ao usu&aacute;rio e as unidades nas quais os aplicativos, transa&ccedil;&otilde;es e elementos lhe s&atilde;o habilitados devem ser sempre compat&iacute;veis, da seguinte forma:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Se o usu&aacute;rio estiver autorizado a trabalhar em diferentes empresas (Empresa autorizada = "999"), as habilita&ccedil;&otilde;es podem ser definidas para todas as empresas ("999") ou para uma empresa espec&iacute;fica ("nnn"). </P>
<P>Este procedimento tamb&eacute;m &eacute; v&aacute;lido para o estabelecimento e a unidade.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Se um usu&aacute;rio tem acesso a uma empresa espec&iacute;fica (Empresa autorizada = "nnn"), ent&atilde;o s&oacute; &eacute; permitido cadastrar habilita&ccedil;&otilde;es para esta mesma empresa ("nnn"). </P>
<P>Mesmo procedimento se aplica a estabelecimento e unidade autorizados.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Se um usu&aacute;rio tem acesso somente a sistemas que n&atilde;o est&atilde;o ligados a nenhuma empresa (Empresa autorizada = "000"), ent&atilde;o s&oacute; &eacute; permitido habilitar aplicativos, transa&ccedil;&otilde;es e elementos para a empresa "000".</FONT> </P>
<FONT SIZE=2><P>Mesmo procedimento se aplica a estabelecimento e unidade autorizados.</FONT> </P></DIR>

<FONT SIZE=2><P>Caso haja a necessidade de se alterar as unidades autorizadas de uma habilita&ccedil;&atilde;o, as novas unidades devem continuar mantendo compatibilidade com as unidades autorizadas ao usu&aacute;rio. Esta situa&ccedil;&atilde;o pode levar a um impasse: para alterar as unidades da habilita&ccedil;&atilde;o deve-se anteriormente alterar as unidades autorizadas ao usu&aacute;rio visando manter a compatibilidade. Por&eacute;m, antes de se alterar as unidades autorizadas, deve-se adequar as unidades das habilita&ccedil;&otilde;es, para que estas n&atilde;o se tornem incompat&iacute;veis.</FONT> </P>
<FONT SIZE=2><P>Para solucionar este impasse, a opera&ccedil;&atilde;o de altera&ccedil;&atilde;o de unidades autorizadas processa, de uma s&oacute; vez, a altera&ccedil;&atilde;o das unidades autorizadas ao usu&aacute;rio e a altera&ccedil;&atilde;o das unidades das habilita&ccedil;&otilde;es, evitando-se assim poss&iacute;veis incompatibilidades.</FONT> </P>
<FONT SIZE=2><P>Para se processar tal opera&ccedil;&atilde;o, devem ser informadas quais s&atilde;o as unidades atuais a serem trocadas e quais as novas unidades. </P>
<P>Tamb&eacute;m &eacute; poss&iacute;vel, ao inv&eacute;s de trocar o c&oacute;digo das unidades autorizadas, duplic&aacute;-las para os novos c&oacute;digos. Desta forma as habilita&ccedil;&otilde;es cadastradas nas antigas unidades ser&atilde;o mantidas e ser&atilde;o criadas iguais habilita&ccedil;&otilde;es nas novas unidades.</FONT> </P>
<FONT SIZE=2><P>Esta opera&ccedil;&atilde;o n&atilde;o ser&aacute; permitida se o n&uacute;mero de aplicativos a serem duplicados ultrapassar o limite de 500 por usu&aacute;rio.</FONT> </P>
<FONT SIZE=2><P>Cumpre ressaltar que, na tentativa de executar a opera&ccedil;&atilde;o de troca ou duplica&ccedil;&atilde;o, as unidades autorizadas ao usu&aacute;rio e as unidades das habilita&ccedil;&otilde;es dos aplicativos, transa&ccedil;&otilde;es e elementos devem manter sempre a compatibilidade. Desta forma, nenhuma altera&ccedil;&atilde;o ser&aacute; efetuada caso haja tentativa de se quebrar tal regra. </P>
<P>Respeitando a compatibilidade referida anteriormente, todas as habilita&ccedil;&otilde;es que forem encontradas cadastradas nas mesmas unidades atuais ser&atilde;o ent&atilde;o trocadas ou duplicadas para as novas unidades e, caso as unidades autorizadas do usu&aacute;rio sejam semelhantes &agrave;s unidades de origem especificadas, ent&atilde;o elas tamb&eacute;m ser&atilde;o trocadas (caso a opera&ccedil;&atilde;o seja de troca).</FONT> </P>
<FONT SIZE=2><P>Resumidamente, os seguintes testes ser&atilde;o efetuados no momento da troca ou duplica&ccedil;&atilde;o das unidades autorizadas de um usu&aacute;rio:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>As novas unidades dever&atilde;o ser diferentes das unidades atuais;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Um usu&aacute;rio de n&iacute;vel de acesso 98 s&oacute; poder&aacute; processar a opera&ccedil;&atilde;o caso as novas unidades sejam compat&iacute;veis &agrave;s suas;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Se alguma das unidades autorizadas do usu&aacute;rio for igual a 9's ("999"), ent&atilde;o a relativa unidade atual dever&aacute; ser informada;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Se alguma das unidades autorizadas do usu&aacute;rio for diferente de 9's ("999"), ent&atilde;o a relativa unidade atual dever&aacute; ser igual &agrave; unidade autorizada;</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Se uma das unidades autorizadas do usu&aacute;rio for igual a 9's ("999") e a nova unidade for igual a 0's ("000"), ent&atilde;o a opera&ccedil;&atilde;o s&oacute; ser&aacute; processada caso n&atilde;o haja nenhuma habilita&ccedil;&atilde;o na referida unidade com valor diferente de 9's.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Se todas as unidades autorizadas forem diferentes de 9's, ent&atilde;o n&atilde;o &eacute; necess&aacute;rio informar unidades atuais, pois ser&atilde;o assumidas as autorizadas. Caso as unidades atuais sejam informadas, elas devem ser iguais &agrave;s autorizadas.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Se todas as unidades autorizadas forem diferentes de 9's, ent&atilde;o n&atilde;o &eacute; permitido executar a opera&ccedil;&atilde;o de duplica&ccedil;&atilde;o, somente troca.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>S&oacute; ser&aacute; permitido trocar ou duplicar as unidades, caso n&atilde;o exista nenhuma habilita&ccedil;&atilde;o que, pelo fato de n&atilde;o possuir unidades iguais &agrave;s informadas, tenha unidades que se tornar&atilde;o incompat&iacute;veis com as novas unidades do usu&aacute;rio.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>As unidades das habilita&ccedil;&otilde;es n&atilde;o ser&atilde;o alteradas caso sejam diferentes das unidades atuais ou j&aacute; sejam iguais &agrave;s novas unidades.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Se a opera&ccedil;&atilde;o for de duplica&ccedil;&atilde;o, ent&atilde;o as unidades autorizadas do usu&aacute;rio n&atilde;o ser&atilde;o alteradas.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Se todas as unidades autorizadas do usu&aacute;rio forem iguais a 9's e todas as novas unidades forem diferentes de 0's, ent&atilde;o as unidades autorizadas do usu&aacute;rio n&atilde;o ser&atilde;o alteradas. </P>
</FONT><P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><FONT SIZE=2>Se a unidade autorizada for diferente de 9's ou, se a unidade autorizada for igual a 9's e a unidade destino for igual a 0's, ent&atilde;o a referida unidade autorizada ser&aacute; alterada.</FONT> </P></DIR>

<FONT SIZE=2><P>Para melhor entendimento, a seguir ser&atilde;o apresentados alguns exemplos de cadastramentos de usu&aacute;rios e opera&ccedil;&otilde;es de altera&ccedil;&atilde;o de unidades processadas sobre os mesmos:</FONT> </P>
<B><FONT SIZE=2><P>USUARIO 1 UNIDADES AUTORIZADAS: Empresa: 011 Estab.: 0001 Unidade: 002</B></FONT> </P>
<B><FONT SIZE=2><P>HABILITA&Ccedil;&Otilde;ES DE APLICATIVO:</B></FONT> </P>
<TABLE BORDER CELLSPACING=1 BORDERCOLOR="#000000" WIDTH=414>
<TR><TD WIDTH="31%" VALIGN="MIDDLE">
<P ALIGN="CENTER"><B><FONT SIZE=2>APLICATIVO</B></FONT></TD>
<TD WIDTH="26%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P ALIGN="CENTER">EMPRESA</B></FONT></TD>
<TD WIDTH="20%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P ALIGN="CENTER">ESTAB.</B></FONT></TD>
<TD WIDTH="23%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P ALIGN="CENTER">UNIDADE</B></FONT></TD>
</TR>
<TR><TD WIDTH="31%" VALIGN="MIDDLE">
<P ALIGN="CENTER">ABC</TD>
<TD WIDTH="26%" VALIGN="MIDDLE">
<P ALIGN="CENTER">011</TD>
<TD WIDTH="20%" VALIGN="MIDDLE">
<P ALIGN="CENTER">0001</TD>
<TD WIDTH="23%" VALIGN="MIDDLE">
<P ALIGN="CENTER">002</TD>
</TR>
<TR><TD WIDTH="31%" VALIGN="MIDDLE">
<P ALIGN="CENTER">JCF</TD>
<TD WIDTH="26%" VALIGN="MIDDLE">
<P ALIGN="CENTER">011</TD>
<TD WIDTH="20%" VALIGN="MIDDLE">
<P ALIGN="CENTER">0001</TD>
<TD WIDTH="23%" VALIGN="MIDDLE">
<P ALIGN="CENTER">002</TD>
</TR>
</TABLE>

<B><FONT SIZE=2><P>ALTERA&Ccedil;&Atilde;O</B>:<B> TROCA</B></FONT> </P>
<B><FONT SIZE=2><P>ARGUMENTOS</B>: </P>
<P>UNIDADES AUTORIZADAS ATUAIS: Empresa: 011 Estab.0001 Unidade: 002</FONT> </P>
<FONT SIZE=2><P>NOVAS UNIDADES AUTORIZADAS: Empresa: 009 Estab.0008 Unidade: 007</FONT> </P>
<B><FONT SIZE=2><P>RESULTADO</B>:</FONT> </P>
<FONT SIZE=2><P>USUARIO 1 UNIDADES AUTORIZADAS<B>:</B> Empresa: 009 Estab.: 0008 Unidade: 007</FONT> </P>
<B><FONT SIZE=2><P>HABILITA&Ccedil;&Otilde;ES DE APLICATIVO:</B></FONT> </P>
<TABLE BORDER CELLSPACING=1 BORDERCOLOR="#000000" WIDTH=414>
<TR><TD WIDTH="31%" VALIGN="MIDDLE">
<P ALIGN="CENTER"><B><FONT SIZE=2>APLICATIVO</B></FONT></TD>
<TD WIDTH="26%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P ALIGN="CENTER">EMPRESA</B></FONT></TD>
<TD WIDTH="20%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P ALIGN="CENTER">ESTAB.</B></FONT></TD>
<TD WIDTH="23%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P ALIGN="CENTER">UNIDADE</B></FONT></TD>
</TR>
<TR><TD WIDTH="31%" VALIGN="MIDDLE">
<P ALIGN="CENTER">ABC</TD>
<TD WIDTH="26%" VALIGN="MIDDLE">
<P ALIGN="CENTER">009</TD>
<TD WIDTH="20%" VALIGN="MIDDLE">
<P ALIGN="CENTER">0008</TD>
<TD WIDTH="23%" VALIGN="MIDDLE">
<P ALIGN="CENTER">007</TD>
</TR>
<TR><TD WIDTH="31%" VALIGN="MIDDLE">
<P ALIGN="CENTER">JCF</TD>
<TD WIDTH="26%" VALIGN="MIDDLE">
<P ALIGN="CENTER">009</TD>
<TD WIDTH="20%" VALIGN="MIDDLE">
<P ALIGN="CENTER">0008</TD>
<TD WIDTH="23%" VALIGN="MIDDLE">
<P ALIGN="CENTER">007</TD>
</TR>
</TABLE>

<B><FONT SIZE=2><P>ALTERA&Ccedil;&Atilde;O</B>:<B> DUPLICA&Ccedil;&Atilde;O</B></FONT> </P>
<B><FONT SIZE=2><P>ARGUMENTOS</B>:</FONT> </P>
<FONT SIZE=2><P>UNIDADES AUTORIZADAS ATUAIS: Empresa: 011 Estab.0001 Unidade: 002</FONT> </P>
<FONT SIZE=2><P>NOVAS UNIDADES AUTORIZADAS: Empresa: 999 Estab.9999 Unidade: 999</FONT> </P>
<B><FONT SIZE=2><P>RESULTADO</B>:</FONT> </P>
<FONT SIZE=2><P>N&atilde;o &eacute; permitida a duplica&ccedil;&atilde;o, pois todas as unidades autorizadas do usu&aacute;rio s&atilde;o diferentes de 9's.</FONT> </P>
<B><FONT SIZE=2><P>ALTERA&Ccedil;&Atilde;O</B>: <B>TROCA</B></FONT> </P>
<B><FONT SIZE=2><P>ARGUMENTOS</B>:</FONT> </P>
<FONT SIZE=2><P>UNIDADES AUTORIZADAS ATUAIS: Empresa: 011 Estab.0001 Unidade: 002</FONT> </P>
<FONT SIZE=2><P>NOVAS UNIDADES AUTORIZADAS: Empresa: 999 Estab.9999 Unidade: 999</FONT> </P>
<B><FONT SIZE=2><P>RESULTADO</B>:</FONT> </P>
<FONT SIZE=2><P>USUARIO 1 UNIDADES AUTORIZADAS: Empresa: 999 Estab.: 9999 Unidade: 999</FONT> </P>
<B><FONT SIZE=2><P>HABILITA&Ccedil;&Otilde;ES DE APLICATIVO:</B></FONT> </P>
<TABLE BORDER CELLSPACING=1 BORDERCOLOR="#000000" WIDTH=414>
<TR><TD WIDTH="31%" VALIGN="MIDDLE">
<P><B><FONT SIZE=2>APLICATIVO</B></FONT> </TD>
<TD WIDTH="26%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P ALIGN="CENTER">EMPRESA</B></FONT></TD>
<TD WIDTH="20%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P ALIGN="CENTER">ESTAB.</B></FONT></TD>
<TD WIDTH="23%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P ALIGN="CENTER">UNIDADE</B></FONT></TD>
</TR>
<TR><TD WIDTH="31%" VALIGN="MIDDLE">
<P>ABC</TD>
<TD WIDTH="26%" VALIGN="MIDDLE">
<P ALIGN="CENTER">999</TD>
<TD WIDTH="20%" VALIGN="MIDDLE">
<P ALIGN="CENTER">9999</TD>
<TD WIDTH="23%" VALIGN="MIDDLE">
<P ALIGN="CENTER">999</TD>
</TR>
<TR><TD WIDTH="31%" VALIGN="MIDDLE">
<P>JCF</TD>
<TD WIDTH="26%" VALIGN="MIDDLE">
<P ALIGN="CENTER">999</TD>
<TD WIDTH="20%" VALIGN="MIDDLE">
<P ALIGN="CENTER">9999</TD>
<TD WIDTH="23%" VALIGN="MIDDLE">
<P ALIGN="CENTER">999</TD>
</TR>
</TABLE>

<B><FONT SIZE=2><P>ALTERA&Ccedil;&Atilde;O</B>: <B>TROCA</B></FONT> </P>
<B><FONT SIZE=2><P>ARGUMENTOS</B>:</FONT> </P>
<FONT SIZE=2><P>UNIDADES AUTORIZADAS ATUAIS: Empresa: 011 Estab.0001 Unidade: 002</FONT> </P>
<FONT SIZE=2><P>NOVAS UNIDADES AUTORIZADAS: Empresa: 000 Estab.0000 Unidade: 000</FONT> </P>
<B><FONT SIZE=2><P>RESULTADO</B>:</FONT> </P>
<FONT SIZE=2><P>USUARIO 1 UNIDADES AUTORIZADAS: Empresa:000 Estab.: 0000 Unidade: 000</FONT> </P>
<B><FONT SIZE=2><P>HABILITA&Ccedil;&Otilde;ES DE APLICATIVO:</B></FONT> </P>
<TABLE BORDER CELLSPACING=1 BORDERCOLOR="#000000" WIDTH=414>
<TR><TD WIDTH="31%" VALIGN="MIDDLE">
<P><B><FONT SIZE=2>APLICATIVO</B></FONT> </TD>
<TD WIDTH="26%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P>EMPRESA</B></FONT> </TD>
<TD WIDTH="20%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P>ESTAB.</B></FONT> </TD>
<TD WIDTH="23%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P>UNIDADE</B></FONT> </TD>
</TR>
<TR><TD WIDTH="31%" VALIGN="MIDDLE">
<P>ABC</TD>
<TD WIDTH="26%" VALIGN="MIDDLE">
<P>000</TD>
<TD WIDTH="20%" VALIGN="MIDDLE">
<P>0000 </TD>
<TD WIDTH="23%" VALIGN="MIDDLE">
<P>000</TD>
</TR>
<TR><TD WIDTH="31%" VALIGN="MIDDLE">
<P>JCF</TD>
<TD WIDTH="26%" VALIGN="MIDDLE">
<P>000</TD>
<TD WIDTH="20%" VALIGN="MIDDLE">
<P>0000 </TD>
<TD WIDTH="23%" VALIGN="MIDDLE">
<P>000</TD>
</TR>
</TABLE>

<B><FONT SIZE=2><P>ALTERA&Ccedil;&Atilde;O</B>: <B>DUPLICA&Ccedil;&Atilde;O</B></FONT> </P>
<B><FONT SIZE=2><P>ARGUMENTOS</B>:</FONT> </P>
<FONT SIZE=2><P>UNIDADES AUTORIZADAS ATUAIS: Empresa: 077 Estab.0001 Unidade: 002</FONT> </P>
<FONT SIZE=2><P>NOVAS UNIDADES AUTORIZADAS: Empresa: 009 Estab.0000 Unidade: 000</FONT> </P>
<B><FONT SIZE=2><P>RESULTADO</B>:</FONT> </P>
<FONT SIZE=2><P>N&atilde;o foram encontradas unidades semelhantes &agrave;s informadas no argumento, portanto nenhuma altera&ccedil;&atilde;o foi efetuada.</FONT> </P>
<B><FONT SIZE=2><P>USUARIO 2 UNIDADES AUTORIZADAS: Empresa: 003 Estab.: 9999 Unidade: 999</B></FONT> </P>
<B><FONT SIZE=2><P>HABILITA&Ccedil;&Otilde;ES DE APLICATIVO</B>:</FONT> </P>
<TABLE BORDER CELLSPACING=1 BORDERCOLOR="#000000" WIDTH=414>
<TR><TD WIDTH="31%" VALIGN="MIDDLE">
<P><B><FONT SIZE=2>APLICATIVO</B></FONT> </TD>
<TD WIDTH="26%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P>EMPRESA</B></FONT> </TD>
<TD WIDTH="20%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P>ESTAB.</B></FONT> </TD>
<TD WIDTH="23%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P>UNIDADE</B></FONT> </TD>
</TR>
<TR><TD WIDTH="31%" VALIGN="MIDDLE">
<P>ADG</TD>
<TD WIDTH="26%" VALIGN="MIDDLE">
<P>003</TD>
<TD WIDTH="20%" VALIGN="MIDDLE">
<P>0001 </TD>
<TD WIDTH="23%" VALIGN="MIDDLE">
<P>002</TD>
</TR>
<TR><TD WIDTH="31%" VALIGN="MIDDLE">
<P>DER</TD>
<TD WIDTH="26%" VALIGN="MIDDLE">
<P>003</TD>
<TD WIDTH="20%" VALIGN="MIDDLE">
<P>9999 </TD>
<TD WIDTH="23%" VALIGN="MIDDLE">
<P>999</TD>
</TR>
<TR><TD WIDTH="31%" VALIGN="MIDDLE">
<P>BDS</TD>
<TD WIDTH="26%" VALIGN="MIDDLE">
<P>003</TD>
<TD WIDTH="20%" VALIGN="MIDDLE">
<P>0002 </TD>
<TD WIDTH="23%" VALIGN="MIDDLE">
<P>999</TD>
</TR>
</TABLE>

<B><FONT SIZE=2><P>ALTERA&Ccedil;&Atilde;O</B>: <B>TROCA</B></FONT> </P>
<B><FONT SIZE=2><P>ARGUMENTOS</B>: </P>
<P>UNIDADES AUTORIZADAS ATUAIS: Empresa: 003 Estab.0001 Unidade: 002</FONT> </P>
<FONT SIZE=2><P>NOVAS UNIDADES AUTORIZADAS: Empresa: 005 Estab.0008 Unidade: 007</FONT> </P>
<B><FONT SIZE=2><P>RESULTADO</B>:</FONT> </P>
<FONT SIZE=2><P>Apesar de terem sido encontradas unidades iguais &agrave;quelas informadas no argumento, na habilita&ccedil;&atilde;o do aplicativo "ADG", caso sejam alteradas tais unidades elas ir&atilde;o se tornar incompat&iacute;veis com as unidades autorizadas ao usu&aacute;rio - Empresa autorizada ao usu&aacute;rio &eacute; igual a "003" e a empresa habilitada ao aplicativo ficaria com "005". Portanto, nenhuma altera&ccedil;&atilde;o ser&aacute; efetuada. </P>
<B><P>ALTERA&Ccedil;&Atilde;O</B>: <B>TROCA</B></FONT> </P>
<B><FONT SIZE=2><P>ARGUMENTOS</B>: </P>
<P>UNIDADES AUTORIZADAS ATUAIS: Empresa: 003 Estab.0001 Unidade: 002</FONT> </P>
<FONT SIZE=2><P>NOVAS UNIDADES AUTORIZADAS: Empresa: 003 Estab.0003 Unidade: 003</FONT> </P>
<B><FONT SIZE=2><P>RESULTADO</B>:</FONT> </P>
<FONT SIZE=2><P>USUARIO 2 UNIDADES AUTORIZADAS: Empresa:&nbsp;003 Estab.: 9999 Unidade: 999</FONT> </P>
<B><FONT SIZE=2><P>HABILITA&Ccedil;&Otilde;ES DE APLICATIVO:</B></FONT> </P>
<TABLE BORDER CELLSPACING=1 BORDERCOLOR="#000000" WIDTH=414>
<TR><TD WIDTH="31%" VALIGN="MIDDLE">
<P><B><FONT SIZE=2>APLICATIVO</B></FONT> </TD>
<TD WIDTH="26%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P ALIGN="CENTER">EMPRESA</B></FONT></TD>
<TD WIDTH="20%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P ALIGN="CENTER">ESTAB.</B></FONT></TD>
<TD WIDTH="23%" VALIGN="MIDDLE">
<B><FONT SIZE=2><P ALIGN="CENTER">UNIDADE</B></FONT></TD>
</TR>
<TR><TD WIDTH="31%" VALIGN="MIDDLE">
<P>ADG</TD>
<TD WIDTH="26%" VALIGN="MIDDLE">
<P ALIGN="CENTER">003</TD>
<TD WIDTH="20%" VALIGN="MIDDLE">
<P ALIGN="CENTER">0003</TD>
<TD WIDTH="23%" VALIGN="MIDDLE">
<P ALIGN="CENTER">003</TD>
</TR>
<TR><TD WIDTH="31%" VALIGN="MIDDLE">
<P>DER</TD>
<TD WIDTH="26%" VALIGN="MIDDLE">
<P ALIGN="CENTER">003</TD>
<TD WIDTH="20%" VALIGN="MIDDLE">
<P ALIGN="CENTER">9999</TD>
<TD WIDTH="23%" VALIGN="MIDDLE">
<P ALIGN="CENTER">999</TD>
</TR>
<TR><TD WIDTH="31%" VALIGN="MIDDLE">
<P>BDS</TD>
<TD WIDTH="26%" VALIGN="MIDDLE">
<P ALIGN="CENTER">003</TD>
<TD WIDTH="20%" VALIGN="MIDDLE">
<P ALIGN="CENTER">0002</TD>
<TD WIDTH="23%" VALIGN="MIDDLE">
<P ALIGN="CENTER">999</TD>
</TR>
</TABLE>

<P>Todo usu&aacute;rio de n&iacute;vel de acesso 99 est&aacute; habilitado a executar qualquer opera&ccedil;&atilde;o do Sistema de Seguran&ccedil;a, inclusive a altera&ccedil;&atilde;o de unidades autorizadas de usu&aacute;rio. Por&eacute;m, o usu&aacute;rio de n&iacute;vel de acesso 98, para que possa efetuar esta opera&ccedil;&atilde;o, deve atender determinados requisitos, que se encontram relacionados nesta se&ccedil;&atilde;o, no item "Usu&aacute;rios e habilita&ccedil;&otilde;es", t&oacute;pico "Introdu&ccedil;&atilde;o", subt&oacute;pico "Respons&aacute;veis pelos cadastramentos". </P>
<P>Para efetuar a opera&ccedil;&atilde;o de altera&ccedil;&atilde;o de unidades autorizadas de um usu&aacute;rio, deve-se utilizar o menu de opera&ccedil;&atilde;o "UTIUSU", opera&ccedil;&atilde;o "EMP". </P>
<B><FONT SIZE=2><P>CAMPOS DA TELA</B></FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Numero </B>- N&uacute;mero e c&oacute;digo do usu&aacute;rio.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Nome </B>- Nome do usu&aacute;rio.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Sigla da Empresa</B> - Sigla da empresa do usu&aacute;rio.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Area</B> - C&oacute;digo da &aacute;rea do usu&aacute;rio.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Unidades Autorizadas</B>:</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Unidades Atuais</B></FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Empresa</B> - C&oacute;digo da empresa na qual o usu&aacute;rio tem autoriza&ccedil;&atilde;o de acesso.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Estabelecimento</B> - C&oacute;digo do estabelecimento no qual o usu&aacute;rio tem autoriza&ccedil;&atilde;o de acesso.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Unidade</B> - C&oacute;digo da unidade na qual o usu&aacute;rio tem autoriza&ccedil;&atilde;o de acesso.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Novas Unidades</B></FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Empresa</B> - C&oacute;digo da empresa na qual o usu&aacute;rio ter&aacute; autoriza&ccedil;&atilde;o de acesso.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"999" - Para indicar que o usu&aacute;rio poder&aacute; ter acesso a qualquer empresa. </P>
<P>No momento do <I>logon</I>, caso o usu&aacute;rio n&atilde;o possua empresa <I>default</I> cadastrada, ser&aacute; exigido ent&atilde;o que ele informe em qual empresa ele deseja obter acesso naquela sess&atilde;o de trabalho. Caso contr&aacute;rio, ser&aacute; assumida a empresa <I>default</I>.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"nnn" - Para indicar que o usu&aacute;rio tem acesso somente a uma empresa espec&iacute;fica. </P>
<P>Podem ser informados valores de "001" a "998", que devem estar cadastrados na tabela SBPM6001, conforme descrito na Se&ccedil;&atilde;o V, "Parametriza&ccedil;&otilde;es do SADS", item "Empresas".</FONT> </P>
<FONT SIZE=2><P>No momento do <I>logon</I>, n&atilde;o ser&aacute; exigido que o usu&aacute;rio informe a empresa na qual deseja trabalhar, porque a empresa especificada em seu cadastramento ser&aacute; sempre assumida, tendo em vista ser a &uacute;nica empresa na qual o usu&aacute;rio poder&aacute; acessar.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"000" - Para indicar que o usu&aacute;rio n&atilde;o tem v&iacute;nculo a nenhuma empresa.</FONT> </P>
<FONT SIZE=2><P>Neste caso, se o usu&aacute;rio solicitar uma transa&ccedil;&atilde;o de um aplicativo que trata as informa&ccedil;&otilde;es de acordo com a empresa na qual o usu&aacute;rio efetuou o <I>logon</I>, ent&atilde;o, nesta transa&ccedil;&atilde;o, n&atilde;o lhe ser&aacute; permitido manipular ou consultar nenhuma informa&ccedil;&atilde;o.</FONT> </P></DIR>

<FONT SIZE=2><P>No momento do <I>logon</I>, n&atilde;o lhe ser&aacute; exigida a informa&ccedil;&atilde;o da empresa na qual deseja trabalhar, porque ser&aacute; assumida a empresa "000".</FONT> </P>
<FONT SIZE=2><P>Caso o c&oacute;digo da empresa n&atilde;o seja informado, ser&aacute; assumido, internamente ao Sistema de Seguran&ccedil;a, empresa "000". </P>
</FONT><P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Estabelecimento</B> - C&oacute;digo do estabelecimento no qual o usu&aacute;rio tem autoriza&ccedil;&atilde;o de acesso.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"9999" - Para indicar que o usu&aacute;rio poder&aacute; ter acesso a qualquer estabelecimento. </P>
<P>No momento do <I>logon</I>, caso o usu&aacute;rio n&atilde;o possua estabelecimento <I>default</I> cadastrado, ser&aacute; exigido ent&atilde;o que ele informe em qual estabelecimento ele deseja obter acesso naquela sess&atilde;o de trabalho. Caso contr&aacute;rio, ser&aacute; assumido o estabelecimento <I>default</I>.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"nnnn" - Para indicar que o usu&aacute;rio tem acesso somente a um estabelecimento espec&iacute;fico. </P>
<P>Podem ser informados valores de "001" a "9998".</FONT> </P>
<FONT SIZE=2><P>No momento do <I>logon</I>, n&atilde;o ser&aacute; exigido que o usu&aacute;rio informe o estabelecimento no qual deseja trabalhar, porque o estabelecimento especificado em seu cadastramento ser&aacute; sempre assumido, tendo em vista ser o &uacute;nico estabelecimento que o usu&aacute;rio poder&aacute; acessar.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"0000" - Para indicar que o usu&aacute;rio n&atilde;o tem v&iacute;nculo a nenhum estabelecimento.</FONT> </P>
<FONT SIZE=2><P>Neste caso, se o usu&aacute;rio solicitar uma transa&ccedil;&atilde;o de um aplicativo que trata as informa&ccedil;&otilde;es de acordo com o estabelecimento no qual o usu&aacute;rio efetuou o <I>logon</I>, ent&atilde;o, nesta transa&ccedil;&atilde;o, n&atilde;o lhe ser&aacute; permitido manipular ou consultar nenhuma informa&ccedil;&atilde;o.</FONT> </P></DIR>

<FONT SIZE=2><P>No momento do <I>logon</I>, n&atilde;o lhe ser&aacute; exigida a informa&ccedil;&atilde;o do estabelecimento no qual deseja trabalhar, pois ser&aacute; assumido o estabelecimento "0000".</FONT> </P>
<FONT SIZE=2><P>Caso o c&oacute;digo do estabelecimento n&atilde;o seja informado, ser&aacute; assumido, internamente ao Sistema de Seguran&ccedil;a, estabelecimento "0000". </P>
</FONT><P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Unidade</B> - C&oacute;digo da unidade na qual o usu&aacute;rio ter&aacute; autoriza&ccedil;&atilde;o de acesso.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"999" - Para indicar que o usu&aacute;rio poder&aacute; ter acesso a qualquer unidade. </P>
<P>No momento do <I>logon</I>, caso o usu&aacute;rio n&atilde;o possua unidade <I>default</I> cadastrada, ser&aacute; exigido ent&atilde;o que ele informe em qual unidade ele deseja obter acesso naquela sess&atilde;o de trabalho. Caso contr&aacute;rio, ser&aacute; assumida a unidade <I>default</I>.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"nnn" - Para indicar que o usu&aacute;rio tem acesso somente a uma unidade espec&iacute;fica. </P>
<P>No momento do <I>logon</I>, n&atilde;o ser&aacute; exigido que o usu&aacute;rio informe a unidade na qual deseja trabalhar, porque a unidade especificada em seu cadastramento ser&aacute; sempre assumida, tendo em vista ser a &uacute;nica unidade que o usu&aacute;rio poder&aacute; acessar.</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"000" - Para indicar que o usu&aacute;rio n&atilde;o tem v&iacute;nculo a nenhuma unidade.</FONT> </P>
<FONT SIZE=2><P>Neste caso, se o usu&aacute;rio solicitar uma transa&ccedil;&atilde;o de um aplicativo que trata as informa&ccedil;&otilde;es de acordo com a unidade na qual o usu&aacute;rio efetuou o <I>logon</I>, ent&atilde;o, nesta transa&ccedil;&atilde;o, n&atilde;o lhe ser&aacute; permitido manipular ou consultar nenhuma informa&ccedil;&atilde;o.</FONT> </P></DIR>

<FONT SIZE=2><P>No momento do <I>logon</I>, n&atilde;o lhe ser&aacute; exigida a informa&ccedil;&atilde;o da unidade na qual deseja trabalhar, pois ser&aacute; assumida a unidade "000".</FONT> </P>
<FONT SIZE=2><P>Caso o c&oacute;digo da unidade n&atilde;o seja informado, ser&aacute; assumido, internamente ao Sistema de Seguran&ccedil;a, unidade "000". </P>
<P>Deve existir uma coer&ecirc;ncia na informa&ccedil;&atilde;o das unidades autorizadas de um usu&aacute;rio, da seguinte forma:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Se um usu&aacute;rio pode ter acesso &agrave;s informa&ccedil;&otilde;es de todas as empresas (999), conseq&uuml;entemente, n&atilde;o pode ser autorizado a um estabelecimento espec&iacute;fico (nnnn) e/ou unidade espec&iacute;fica (nnn);</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Se um usu&aacute;rio pode ter acesso &agrave;s informa&ccedil;&otilde;es de todos os estabelecimentos (9999), conseq&uuml;entemente, n&atilde;o pode ser autorizado a uma unidade espec&iacute;fica (nnn), independentemente da empresa ser espec&iacute;fica (nnn) ou gen&eacute;rica (999);</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Se um usu&aacute;rio n&atilde;o tem acesso a nenhuma empresa (000), ent&atilde;o tamb&eacute;m n&atilde;o poder&aacute; ter acesso a nenhum estabelecimento (0000) e unidade (000);</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>Se um usu&aacute;rio n&atilde;o tem acesso a nenhum estabelecimento (0000), ent&atilde;o tamb&eacute;m n&atilde;o poder&aacute; obter acesso a nenhuma unidade (000);</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>As demais combina&ccedil;&otilde;es das unidades autorizadas s&atilde;o v&aacute;lidas.</FONT> </P></DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Operacao (Duplicacao/Troca)</B> - C&oacute;digo da opera&ccedil;&atilde;o a ser processada nas unidades autorizadas do usu&aacute;rio e em suas habilita&ccedil;&otilde;es</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"D" - Para duplicar as habilita&ccedil;&otilde;es;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"T" - Para trocar as unidades autorizadas do usu&aacute;rio e as unidades de suas habilita&ccedil;&otilde;es, caso satisfeitos os testes anteriormente relacionados.</FONT> </P></DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Confirme</B> - Indicador de confirma&ccedil;&atilde;o de opera&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"S" - Para confirmar a opera&ccedil;&atilde;o;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"N" - Para cancelar a opera&ccedil;&atilde;o.</FONT> </P></DIR>
</DIR>

<B><FONT SIZE=5><P><A NAME="Exlog">Exclus&atilde;o de usu&aacute;rios que n&atilde;o efetuaram logon no per&iacute;odo</A></B></FONT> </P>
<FONT SIZE=2><P>Atrav&eacute;s desta opera&ccedil;&atilde;o, &eacute; poss&iacute;vel excluir os usu&aacute;rios que n&atilde;o efetuaram <I>logon</I> nos &uacute;ltimos dias. Esta quantidade de dias, utilizada para pesquisar os usu&aacute;rios a serem exclu&iacute;dos, dever&aacute; ser informada no momento do disparo da opera&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Somente um administrador de seguran&ccedil;a poder&aacute; proceder esta exclus&atilde;o de usu&aacute;rios da base de dados do Sistema de Seguran&ccedil;a.</FONT> </P>
<FONT SIZE=2><P>Os usu&aacute;rios que n&atilde;o efetuaram <I>logon</I> durante os &uacute;ltimos dias ser&atilde;o anteriormente exibidos ao administrador de seguran&ccedil;a, e este poder&aacute; ent&atilde;o selecionar, informando "S" na linha referente a cada usu&aacute;rio, aqueles que realmente dever&atilde;o ser exclu&iacute;dos, ou poder&aacute; selecionar, informando "N", aqueles que dever&atilde;o permanecer cadastrados na base de dados do Sistema de Seguran&ccedil;a. </P>
<P>Tamb&eacute;m ser&atilde;o exibidos, para poss&iacute;vel exclus&atilde;o, aqueles usu&aacute;rios que ainda n&atilde;o efetuaram nenhum logon e cuja data de cadastramento seja inferior &agrave; data calculada a partir do n&uacute;mero de dias informado.</P>
<P>Para excluir usu&aacute;rios que n&atilde;o efetuaram <I>logon</I> no per&iacute;odo, deve-se utilizar o menu de opera&ccedil;&atilde;o "UTIUSU", opera&ccedil;&atilde;o "EXL".</FONT> </P>
<B><FONT SIZE=2><P>CAMPOS DA TELA</B></FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Exclui (S/N)</B> - Indicador de sele&ccedil;&atilde;o do respectivo usu&aacute;rio para exclus&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"S" - Para que o respectivo usu&aacute;rio seja exclu&iacute;do da base de dados do Sistema de Seguran&ccedil;a;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"N" - Para que o respectivo usu&aacute;rio n&atilde;o seja exclu&iacute;do da base de dados do Sistema de Seguran&ccedil;a.</FONT> </P></DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Usu&aacute;rio</B> - C&oacute;digo do usu&aacute;rio que n&atilde;o efetuou <I>logon</I> no per&iacute;odo.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Nome</B> - Nome do usu&aacute;rio que n&atilde;o efetuou <I>logon</I> no per&iacute;odo.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Emp</B> - Empresa do usu&aacute;rio que n&atilde;o efetuou <I>logon</I> no per&iacute;odo.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Est</B>. - Estabelecimento do usu&aacute;rio que n&atilde;o efetuou <I>logon</I> no per&iacute;odo.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Unid</B> - Unidade do usu&aacute;rio que n&atilde;o efetuou <I>logon</I> no per&iacute;odo.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Ult. <I>logon</B></I> - Data do &uacute;ltimo <I>logon</I> efetuado pelo usu&aacute;rio.</FONT> </P>
<FONT SIZE=2><P>Caso esta data seja informada igual a zeros (00/00/00), significa que o usu&aacute;rio nunca efetuou <I>logon</I>.</FONT> </P>
<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Confirme (S/N) </B>- Indicador de confirma&ccedil;&atilde;o de exclus&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"S" - Para que os usu&aacute;rios selecionados sejam exclu&iacute;dos da base de dados do Sistema de Seguran&ccedil;a;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"N" - Para que os usu&aacute;rios selecionados n&atilde;o sejam exclu&iacute;dos da base de dados do Sistema de Seguran&ccedil;a.</FONT> </P></DIR>
</DIR>

<FONT SIZE=2><P>Somente quando o campo "Proxima Pag." for preenchido com "99", indicando final da sele&ccedil;&atilde;o dos usu&aacute;rios, &eacute; que ser&aacute; pesquisada e exigida a informa&ccedil;&atilde;o do campo "Confirme", a fim de que, neste momento, seja conclu&iacute;da a execu&ccedil;&atilde;o ou cancelamento da opera&ccedil;&atilde;o.</FONT> </P>
<B><FONT SIZE=5><P>Transforma&ccedil;&atilde;o de usu&aacute;rio em perfil</B></FONT> </P>
<FONT SIZE=2><P>Esta opera&ccedil;&atilde;o propicia a altera&ccedil;&atilde;o do tipo do usu&aacute;rio, permitindo que um usu&aacute;rio j&aacute; cadastrado (tipo = "U") se transforme em perfil modelo (tipo = "P").</FONT> </P>
<FONT SIZE=2><P>O usu&aacute;rio a ser transformado n&atilde;o pode estar vinculado a nenhum perfil.</FONT> </P>
<FONT SIZE=2><P>Somente o administrador de seguran&ccedil;a poder&aacute; efetuar tal transforma&ccedil;&atilde;o. </P>
<P>Para transformar um usu&aacute;rio em perfil modelo, deve-se utilizar o menu de opera&ccedil;&atilde;o "UTIUSU", opera&ccedil;&atilde;o "TRA", e informar o n&uacute;mero ou c&oacute;digo do usu&aacute;rio.</FONT> </P>
<B><FONT SIZE=2><P>CAMPOS DA TELA</B></FONT> </P>
<FONT SIZE=2><P>Ser&atilde;o apresentados todos os dados cadastrais do usu&aacute;rio, informados no momento de seu cadastramento, para que se possa certificar do usu&aacute;rio a ser transformado.</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=12 HEIGHT=12><B><FONT SIZE=2>Confirme </B>- Indicador de confirma&ccedil;&atilde;o de opera&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>Pode assumir os seguintes valores:</FONT> </P><DIR>

<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"S" - Para confirmar a transforma&ccedil;&atilde;o do usu&aacute;rio em perfil;</FONT> </P>
<P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><FONT SIZE=2>"N" - Para cancelar a opera&ccedil;&atilde;o.</FONT> </P></DIR>
</DIR>
</BODY>
</HTML>
