<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft Word 97">
<TITLE>Visão geral e funcional</TITLE>
<META NAME="Template" CONTENT="J:\MSOFFICE\OFFICE\html.dot">
</HEAD>
<BODY LINK="#0000ff" VLINK="#800080" BACKGROUND="DOC_B.GIF">

<B><FONT SIZE=6><P><A NAME="Geral">Vis&atilde;o geral e funcional</A></B></FONT> </P>
<P><HR></P>
<B><FONT SIZE=5><P><A NAME="Intro">Introdu&ccedil;&atilde;o</A></B></FONT> </P>
<P><HR></P>
<FONT SIZE=2><P>O SADS/SS &eacute; a ferramenta que garante a seguran&ccedil;a de acesso &agrave;s informa&ccedil;&otilde;es da empresa, permitindo o uso de transa&ccedil;&otilde;es <I>on-line</I> dispon&iacute;veis somente &agrave;s pessoas devidamente habilitadas.</FONT> </P>
<FONT SIZE=2><P>Seu objetivo &eacute; controlar o acesso ao ambiente SADS, atrav&eacute;s de senhas individuais, que podem ser exigidas sempre que um usu&aacute;rio inicia uma sess&atilde;o de trabalho. O ambiente SADS compreende o pr&oacute;prio SADS, com todos os seus m&oacute;dulos, e/ou os aplicativos desenvolvidos atrav&eacute;s dele.</FONT> </P>
<FONT SIZE=2><P>O cadastramento dos usu&aacute;rios &eacute; feito de forma bastante flex&iacute;vel e a seguran&ccedil;a pode ser estabelecida em diversos n&iacute;veis, de modo a definir, exatamente, as habilita&ccedil;&otilde;es dos mesmos. Atrav&eacute;s destas defini&ccedil;&otilde;es, torna-se poss&iacute;vel impedir que um usu&aacute;rio efetue transa&ccedil;&otilde;es indevidas, tenha acesso a elementos impr&oacute;prios, tente trabalhar em hor&aacute;rio ou dia n&atilde;o permitidos ou tente utilizar uma esta&ccedil;&atilde;o para a qual ele n&atilde;o est&aacute; habilitado.</FONT> </P>
<FONT SIZE=2><P>Todas as habilita&ccedil;&otilde;es cadastradas para os usu&aacute;rios (habilita&ccedil;&otilde;es de aplicativos, transa&ccedil;&otilde;es e elementos) s&atilde;o definidas informando-se a empresa, estabelecimento e unidade. Deste modo, o usu&aacute;rio s&oacute; poder&aacute; trabalhar com o aplicativo, transa&ccedil;&atilde;o e/ou elemento caso a empresa, estabelecimento e unidade, por ele informados no in&iacute;cio da sess&atilde;o de trabalho, sejam compat&iacute;veis &agrave;queles cadastrados na sua habilita&ccedil;&atilde;o.</FONT> </P>
<FONT SIZE=2><P>O respons&aacute;vel pelos cadastramentos no SADS/SS e pela manuten&ccedil;&atilde;o do sistema &eacute; o administrador de seguran&ccedil;a ou outro usu&aacute;rio por ele devidamente habilitado. O que os identifica &eacute; o n&iacute;vel de acesso.</FONT> </P>
<FONT SIZE=2><P>Os dados de um usu&aacute;rio, cadastrados no SADS/SS podem ser consultados por outros aplicativos, sendo poss&iacute;vel tamb&eacute;m efetuar uma auditoria nas manuten&ccedil;&otilde;es efetuadas em todo o cadastro de usu&aacute;rios e habilita&ccedil;&otilde;es.</FONT> </P>
<FONT SIZE=2><P>As tentativas de habilita&ccedil;&atilde;o s&atilde;o registradas em um arquivo de LOG, possibilitando com isso o acesso a essas informa&ccedil;&otilde;es. </P>
</FONT><B><FONT SIZE=5><P><A NAME="Carfu">Caracter&iacute;sticas funcionais</A></B></FONT> </P>
<P><HR></P>
<FONT SIZE=2><P>As principais caracter&iacute;sticas do Sistema de Seguran&ccedil;a do SADS est&atilde;o abaixo sintetizadas:</FONT> </P><DIR>

<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13> Cadastramento e manuten&ccedil;&atilde;o das habilita&ccedil;&otilde;es de forma interativa; </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13> Cadastramento seletivo das habilita&ccedil;&otilde;es do usu&aacute;rio, podendo indicar tanto o que ele estar&aacute; habilitado quanto o que ele n&atilde;o estar&aacute;; </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13> Cadastramento das habilita&ccedil;&otilde;es de forma hierarquizada, podendo habilitar um usu&aacute;rio a trabalhar em uma esta&ccedil;&atilde;o espec&iacute;fica ou em todas as esta&ccedil;&otilde;es de um determinado setor. Caso haja hierarquia no c&oacute;digo da esta&ccedil;&atilde;o, habilit&aacute;lo a todas as transa&ccedil;&otilde;es de um sistema ou somente &agrave; de um menu, e assim por diante; </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13> Cadastramento de habilita&ccedil;&otilde;es de elementos (que s&atilde;o valores ou grupos de valores que um determinado campo pode assumir), para que os usu&aacute;rios possam processar uma determinada transa&ccedil;&atilde;o; </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13> Possibilidade de cadastramento de usu&aacute;rio "Perfil Modelo", que agrega habilita&ccedil;&otilde;es comuns a um grupo de usu&aacute;rios e que posteriormente, poder&atilde;o ser a ele vinculados a fim de herdar suas habilita&ccedil;&otilde;es comuns; </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13> Senhas criptografadas no arquivo de usu&aacute;rios, n&atilde;o permitindo o seu conhecimento at&eacute; mesmo pelo administrador de seguran&ccedil;a; </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13> Exig&ecirc;ncia de troca de senha periodicamente, de acordo com o cadastramento do usu&aacute;rio; </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13> Verifica&ccedil;&atilde;o de data de validade de senha; </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13> Bloqueio autom&aacute;tico de esta&ccedil;&atilde;o e/ou de usu&aacute;rio, sempre que houver tentativa de se burlar a seguran&ccedil;a; </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13> Bloqueio e <I>logoff</I> volunt&aacute;rios de usu&aacute;rio de uma esta&ccedil;&atilde;o; </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13> Bloqueio volunt&aacute;rio de uma esta&ccedil;&atilde;o; </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13> Desabilita&ccedil;&atilde;o autom&aacute;tica de transa&ccedil;&otilde;es, quando da ocorr&ecirc;ncia de cancelamentos, evitando cancelamentos iguais sucessivos; </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13> Habilita&ccedil;&atilde;o e desabilita&ccedil;&atilde;o volunt&aacute;rias de transa&ccedil;&atilde;o, quando o respons&aacute;vel por ela quiser impedir que a mesma seja executada; </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13> Bloqueio de uma transa&ccedil;&atilde;o apenas durante um intervalo de tempo especificado; </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13> Possibilidade de habilita&ccedil;&atilde;o e desabilita&ccedil;&atilde;o de transa&ccedil;&atilde;o por programas dos aplicativos; </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13> Limita&ccedil;&atilde;o de hor&aacute;rios de trabalho de um usu&aacute;rio, de um usu&aacute;rio em um aplicativo ou de um aplicativo; </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13> Registro, em arquivo de LOG, de informa&ccedil;&otilde;es importantes para o administrador de seguran&ccedil;a, tais como: tentativas de <I>logon</I> com senha inv&aacute;lida e todos os <I>logons e logoffs</I> executados na instala&ccedil;&atilde;o; </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13> Registro, na base de dados do Sistema de Seguran&ccedil;a, de todos as manuten&ccedil;&otilde;es efetuadas no cadastro de usu&aacute;rios e de habilita&ccedil;&otilde;es; </P>
<P><IMG SRC="Bullet5.gif" WIDTH=13 HEIGHT=13> Consultas e refer&ecirc;ncias cruzadas <I>o online</I> e relat&oacute;rios para aux&iacute;lio &agrave; manuten&ccedil;&atilde;o e utiliza&ccedil;&atilde;o do sistema. </P></DIR>
</BODY>
</HTML>
